[
  {
    "title": "A second person POV movie",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mrfdav/a_second_person_pov_movie/",
    "content": "Not just where youre involved in the story. Is there a movie out there where you are the main character, and its made like you are seeing the events out of your own eyes, like you would look down and see your own hands or something? Where the whole thing is from your point of view."
  },
  {
    "title": "ITunes equivalent for pc/andoid",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/",
    "content": "Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone. I dont want to use any sort of streaming service since I have already bought all my digital music over the years. I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer."
  },
  {
    "title": "Alarm clock with separate off button and no snooze",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mmb9oi/alarm_clock_with_separate_off_button_and_no_snooze/",
    "content": "I have a really hard time waking up, like will turn off the alarm in my sleep, wake up exhausted, tried every app hard. Does anything like the title exist?"
  },
  {
    "title": "Is there any media involving this specific kink?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mkgip9/is_there_any_media_involving_this_specific_kink/",
    "content": "So I'm into this oddly specific thing.. elongation of genitalia specifically, and I'm wondering if there's media involving that specifically? I know there's tons of media with elongation, but usually of arms and legs and stuff, im wondering if there's anything out there with parts elongated to unnatural lengths but like.. genitals specifically, I tried to use Google search AND talked to a chatbot (it's slim but there is always a small chance they'll give an answer with something real) and didn't find any useful results, maybe I didn't dig deep enough but.. well, reddit has never failed me yet so here I am, desperately seeking to see if this is a thing (it's fine if not I just need a damn answer) And just know I will settle for ANYTHING if it involves that (preferably no live action is my only preference, but as said, I WILL settle for anything at this point)"
  },
  {
    "title": "Small pair of devices that beep when separated more than a few feet from each other.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mbmgqx/small_pair_of_devices_that_beep_when_separated/",
    "content": "I'm looking for something with a hair trigger and not smart phone based. 2 \"things\" that just beep immediately when more than 5 feet apart. They're only paired to each other and nothing else, and the key feature is the immediacy of their reaction to being separated. You might describe this as a \"wireless tether\". All of the the trackers and tag systems seem to be built around bluetooth and phone apps as the anchor. They're more geared towards finding something after it's allowed to separate in the first place; they don't immediately notify you within seconds of separation from the phone. I'm wondering if this exists, but perhaps built for a different purpose than what I intend (put one on a phone and one on a wallet)? Maybe an industrial solution exists?"
  },
  {
    "title": "Kitchen scale dishware.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/",
    "content": "I did a light Google search and didn't find what I was looking for so I'm asking here. Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. Does this exist?"
  },
  {
    "title": "Anyone know if this exists or not?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m932x3/anyone_know_if_this_exists_or_not/",
    "content": "Im wondering if this thing I remember playing once really exists. I swear I remember a long time ago playing this game of my favorite show as a kid, call Blaze and the monster machines I think, and it was in the style of subway surfers, but it was before subway surfers came out in pretty sure. If you guys can figure it out, then thanks! But if not, it was probably a dream lol"
  },
  {
    "title": "What is better element, discord or what up app for creating communities?",
    "link": "https://www.reddit.com/r/apps/comments/1mz66kx/what_is_better_element_discord_or_what_up_app_for/",
    "content": "Im looking to create community and wonder what is better element, discord or what up app?"
  },
  {
    "title": "I need an app that solves every problem for education",
    "link": "https://www.reddit.com/r/apps/comments/1myxrqp/i_need_an_app_that_solves_every_problem_for/",
    "content": "I need an app that solves any subject and any problem. Like Photomath but this only solves math problem. Is there any app that do this?"
  },
  {
    "title": "Does anyone at all remember this game???? (Radish hat guy saving the ecosystem on an alien planet)",
    "link": "https://www.reddit.com/r/apps/comments/1myrv0c/does_anyone_at_all_remember_this_game_radish_hat/",
    "content": "It is an intro to coding type of game that involved collecting fruit balls and feeding them to their respective monsters as payment for their specific task. It was quiet and had an overarching goal to find seeds and replant the environment. It was on my school computer and now theyve wiped it bc I changed schools. There were aliens/creatures were called diggers, movers, seekers, and a few others. I only reached the stage where you have to get your friend, another bipedal parsnip hat wearer, out of this blue force field. There is a rule where you cant get too far away from a body of water or you will collapse and have to start over the round. I cant for the life of me remember its name or what studio it was from. It had to be cheap bc my school had it. All searches have been to no avail so far. If anyone thinks this sounds familiar or knows another subreddit to post this to, PLEASE,PLEASE,PLEASE let me know. Im starting to think I created it as a powerful delusional coping mechanism."
  },
  {
    "title": "I've kept 200 people employed for years. A tariff might end that overnight.",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mywp7p/ive_kept_200_people_employed_for_years_a_tariff/",
    "content": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well. Now with all this talk of a 25% tariff on furniture imports, Im just exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I dont even know how to answer them. What makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported. Instead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin. This could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me?"
  },
  {
    "title": "Just landed a gift shop contract pairing my candles with toy buses — how do I avoid buying cheap junk in bulk?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2lcg/just_landed_a_gift_shop_contract_pairing_my/",
    "content": "So I just landed an exciting contract with a local gift shop and wanted to create a custom bundle, one that includes a handmade candle by myself paired with a toy bus. I am going to tie both together with a nice ribbon so it looks like a nice gift set. The gift shop told me it would better if I source the toy buses myself. So I am a little lost and wanted advice on how to procure something that is not cheap or flimsy. I want something that feels more like a gift and not a party favor, so what are somethings I should look out for in regards to paint, size, and finish? Have any of you created bundled candle gift with non-candle items and have a specific vendor or site where you can order these items at a reasonable price. I was thinking of Alibaba, because I ordered a bunch of candle making supplies from there. Any other sites that I can use to order wholesale toy buses from? Should I prefer die-cast metal over plastic or is plastic okay if its good quality. Are there certain types of paints or coating that may be more likely to chip or smell that I should avoid? I don't want them to look like dollar-store junk."
  },
  {
    "title": "What do you think is a solid long-term path in IT?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2h3m/what_do_you_think_is_a_solid_longterm_path_in_it/",
    "content": "Hi everyone, Ill keep this short: I see a lot of fast money hype online, but Im more interested in what actually brings lasting success as an IT expert. Right now Im experimenting with automation workflows, and while it works to some degree, I also see how hype can destroy real opportunities when everyone suddenly jumps on the same trend. So my question is: Where do you think its truly worth investing time and energy in IT right now? What areas or skills do you see as a good long-term investment that will still matter in 510 years? Id love to hear your perspectives."
  },
  {
    "title": "What do you do with customers who leave false reviews just to hurt your business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5tws/what_do_you_do_with_customers_who_leave_false/",
    "content": "Hey everyone, I run a small family business (appliance repair in California) and Im struggling with a customer who keeps editing her review about us. The problem is her review is just not true. She claimed we charged her $250, when in reality it was $95 (I have the invoice). We did the full repair, her appliance is working, and then we even gave her a full refund. So basically, she got the repair for free. But in her review she forgets to mention that part. I tried replying publicly with the facts, but she keeps editing her review in a way that still makes us look bad. And after checking her review history, its obvious this is a pattern  she leaves bad reviews for lots of businesses, even for places she hasnt actually been. She even left a negative review for a restaurant next door, just because she doesnt like the owner personally. It feels less like feedback and more like someone who just enjoys damaging other peoples reputations. So Im wondering: -Have any of you dealt with people like this? -Can I even get a review like this removed if its clearly false? -At what point is it worth talking to a lawyer about defamation? Running a small business is stressful enough without people like this trying to tank your reputation for no reason. Would love to hear how others have handled it."
  },
  {
    "title": "Starting over at 30… how do I even start a small business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myp49i/starting_over_at_30_how_do_i_even_start_a_small/",
    "content": "Hey guys, Im in my 30s and honestly just trying to start over. I dont really have much right now. No siblings, no financial safety net, just my senior mom and my dogs. My long-term relationship also just ended, so it feels like a big reset in life. Ive always liked business and want to start again. I dont have much money, so Im thinking of starting small while keeping my job on the side. For anyone whos been in a similar place, what are some small business ideas or tips for starting on a really low budget?"
  },
  {
    "title": "are bad photos gonna be the next “aesthetic”?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myvvhk/are_bad_photos_gonna_be_the_next_aesthetic/",
    "content": "idk if anyone else noticed but polished content feels sooo fake now. e very brand ad looks like the same ai filter or stock template. but lately i find myself stopping on like blurry pics, messy vids, stuff that clearly wasnt staged. it actually feels more real. so maybe the future is unpolished? like bad photos, awkward angles, grainy phone vids could that actually be the new good? curious if anyone else feels this or if im just going nuts scrolling too much lol"
  },
  {
    "title": "At what point did you bring in bookkeeping help?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mys6k0/at_what_point_did_you_bring_in_bookkeeping_help/",
    "content": "I run a small catering business, and lately its been picking up more than I expected. Between invoices, supplier payments, and tracking deposits from events, Im realizing my spreadsheets are getting messy and Im probably missing things. For those of you whove been here when did you decide it was time to hand off the books to someone else, and how did you find the right help? Did you go with a local bookkeeper, an online service, or just keep pushing through until revenue got bigger?"
  },
  {
    "title": "What job title should I put when adding my small business to a resume?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2zdb/what_job_title_should_i_put_when_adding_my_small/",
    "content": "I (22) currently have a small videography business, just me and my own equipment & software working on videos for local businesses/organizations/etc. This isnt a full time gig since Im not busy enough with it to be working every day and my main job is being a freelance part-time production assistant for a corporate news entity. Im applying for other positions elsewhere but Im not sure what to put as my job description for the business I started. I know president indicates that I have employees so I wont be using that, would owner/operator be my best bet? TIA!"
  },
  {
    "title": "idk what idea to choose",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2qz4/idk_what_idea_to_choose/",
    "content": "im a 2d illustrator with not many pieces in my portfolio but the ones that are there are incredibly whimsical detailed very character design oriented i wanna know what can i do? i want to polish up my art and create a portfolio and then should i use that art for stickers prints keychains and small things like that? i also want to start a clothing business but idk if it should be street wear (i dont wear it) or semi formal boutique type clothes (i wear this) which i can design. im also considering tote bags but like jeans or courdroy type of cloth. argh so many ideas so little time"
  },
  {
    "title": "To the actual business owners of this community: how are you managing email without burning out?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz73on/to_the_actual_business_owners_of_this_community/",
    "content": "Lately Ive been realizing that one of the hardest parts of running a small but growing business isnt the sales or the bookkeeping its the emails. When I first started, I could get by replying to everything myself; late at night, on my phone, in between tasks. But now that things are picking up, the inbox is constantly filling with customer questions, supplier updates, and even staff stuff. The problem is, every email feels like a mini mental workout. I catch myself rewriting the same message five times just to make sure it doesnt sound curt, unprofessional, or worse, like Im annoyed. Half the time I sit there staring at the screen, knowing I should move on to bigger tasks, but feeling guilty if I dont answer right away. Curious how others here handle this: * Do you personally write every email, or have you found ways to streamline it? * Do you rely on canned templates, an assistant, or just sheer willpower? * Do you block out time for email, or reply as things come in? Feels like one of those invisible drains on energy that nobody talks about, but adds up fast. How are you all managing the inbox without it taking over your day?"
  },
  {
    "title": "is zenbusiness good for small businesses? i use it now for my small fashion label but im wondering if there are better options. i just started my business",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz6tj0/is_zenbusiness_good_for_small_businesses_i_use_it/",
    "content": "so ive done a lot of research after the fact that i signed up and paid for zenbusiness but is it worth it and will it help my business or should i switch elsewhere? should i terminate it? any suggestions are helpful, so thanks in advance  pls b nice in the comments lol"
  },
  {
    "title": "I’m lost on what to do in life",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5zfg/im_lost_on_what_to_do_in_life/",
    "content": "I just turned 25 I have over half a million saved up because I started a business when I was 20 and it became semi successful my business is now faking and Im shutting it down , my goal was to have millions by 30 but now Im lost on what to do next . Someone recommended insurance brokerage business could I attain this goal from starting an insurance brokerage"
  },
  {
    "title": "Custom home builder doing $5M-$10M revenue annually… how do I scale the value of the business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5ufp/custom_home_builder_doing_5m10m_revenue_annually/",
    "content": "I am the owner and am heavily involved. However I have a team of 4 that can virtually run everything without me (one in particular that operates as the COO). I mainly generate sales and am linked to the brand reputation. Our client base is mainly 5-10 customers annually given the high-end homes we build. How do I build on the value of the business? We have consistently strong revenue and EBITDA but we are very specialized doing a handful of high-end homes a year and reliant on myself landing clients. I worry that if I ever wanted to sell, the business valuation wouldnt be huge due to these reasons. Are there logical ways to expand? Do investors or private equity firms buy businesses like mine? How can I ensure valuation of the business brand beyond assets? I want to ensure I have a good exit and target as the business evolves."
  },
  {
    "title": "How to better retain things you read?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxmh8u/how_to_better_retain_things_you_read/",
    "content": "Hi All, As a product manager. You always have to keep learning. However, I always find myself reading lot of stuff but not able to retain them. I will forget articles or books days or after a month. I try keeping notes and flashcards but I find myself not visiting them again. I am curious to know how others retain stuff they read / learn."
  },
  {
    "title": "Is Everything Fine with Jira?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwqlrv/is_everything_fine_with_jira/",
    "content": "Hi, Im looking to learn more about Jiras ticketing system. Heard that keeping Jira aligned with the actual roadmap is a challenge; however, Im not sure how true this is. Some people claim they dont get the toxicity around Jira, while others are pulling their hair out. My question is: what is the problem with Jira? Is it that youre losing context that doesnt make it to Jira? (I dont have a product to pitchnot much came up that directly answered my question upon searching Reddit multiple times)"
  },
  {
    "title": "I’m thinking I will name a keyboard design after ‘Mantis’ in my on going Smart iPhone keyboard project!",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz2xto/im_thinking_i_will_name_a_keyboard_design_after/",
    "content": "I dont know where it came from but its been hours since its all over my Mac screen"
  },
  {
    "title": "I officially have an MVP!",
    "link": "https://www.reddit.com/r/SaaS/comments/1mywngy/i_officially_have_an_mvp/",
    "content": "It took a month from concept to launching next week. Im just so happy I wanted to share. I work in retail full time so its been challenging finding time to learn this and make it a reality. After weeks of late night grinding I can final say I did it! Just wanted to share the joy"
  },
  {
    "title": "If someone gave you $10k today, what crazy project would you try?”",
    "link": "https://www.reddit.com/r/SaaS/comments/1mys3qo/if_someone_gave_you_10k_today_what_crazy_project/",
    "content": "Serious question: if $10,000 landed in your lap todayno strings attachedwhat wild business or side project would you throw it into? Would you try flipping something online? Open a tiny coffee cart? Build an app? Or just YOLO into crypto and hope for the moon?  Im curious what people would actually risk it on. Drop your ideas below  and upvote the most creative ones. Who knows maybe someone here will actually make it happen."
  },
  {
    "title": "Do you charge clients by the hour?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myzv56/do_you_charge_clients_by_the_hour/",
    "content": "I use to keep track of how many hours I worked for people by using my iPhone app or excel sheets I tried the apps that were out there. Toggl was pretty solid but when I started the timer, I would forget to stop it, if I did remember, I would forget later what and who the timer was for - it got messy, So I created my own little app, added a picture in picture window for the timer, added a long running timer warning and some other small things that you almost cant go wrong with I then added in everything I do daily so I dont need to jump around to other apps. Its awesome and neat now What solution did you create to help an actual issue you had?"
  },
  {
    "title": "Just wanted to know how much u r willing to pay for 30 post creation a month? I am planning something similar kind of business so asking for knowledge",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mywgwv/just_wanted_to_know_how_much_u_r_willing_to_pay/",
    "content": ""
  },
  {
    "title": "Most people should NOT start a business",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1my2418/most_people_should_not_start_a_business/",
    "content": "I know this wont be a popular take, but hear me out. Not everyone is built for running their own business. Its full of uncertainty. Its lonely. And you will be tested in ways you couldnt imagine. Youll have to figure out how to create a good product. Youll have to figure out sales and marketing. Youll have to figure out how to manage finances and all the legal stuff. And much more. Honestly, its a brutal way to make a living. To pull through, you have to be obsessed with either creating a great product or making a lot of money, ideally both. But for the few that are ready for the challenge, I have good news. Overcoming the difficulties of running your own business will give you a lot of freedom and make you very capable. Its hands down the best training ground for self improvement. I went all in on this path 1.5 years ago and its been the most rewarding thing in my life. I have my SaaS now that is about to hit $10k/mo and Ive learned so much. So for most people: keep your job and just build projects on the side. You probably dont want all the stress. For the few that are ready for it, youre in for a hell of an adventure."
  }
]