[
  {
    "title": "Learning Theory that doesn't believe in homework?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1muiht8/learning_theory_that_doesnt_believe_in_homework/",
    "content": "Is there a learning theory that has any popular following that does not believe in homework? Or rather, homework just to have homework? I see what all my nieces and nephews have to do these days, and it seems ridiculous. I'd rather my son experience other things after school than more coursework when he's school age."
  },
  {
    "title": "A second person POV movie",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mrfdav/a_second_person_pov_movie/",
    "content": "Not just where youre involved in the story. Is there a movie out there where you are the main character, and its made like you are seeing the events out of your own eyes, like you would look down and see your own hands or something? Where the whole thing is from your point of view."
  },
  {
    "title": "ITunes equivalent for pc/andoid",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/",
    "content": "Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone. I dont want to use any sort of streaming service since I have already bought all my digital music over the years. I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer."
  },
  {
    "title": "Audio-to-Text Software",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/",
    "content": "I'm looking for a completely free software that could capture live audio from a webpage and translate it in real time into text. Nothing fancy, simple GUI and easy to use (I don't want to code anything, you should click on an exe and that's it). It should run in Windows, it has to be software for a desktop PC, not a cell phone app."
  },
  {
    "title": "A type of spin bucket washer?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mpogjn/a_type_of_spin_bucket_washer/",
    "content": "Like a mini washing machine for clothes but similar to a spin mop bucket. I couldn't find one. I found mini washers and they're all under 5 gallons and flimsy but expensive considering they're so flimsy. I'm kinda surprised I couldn't find this. I'm also surprised there's no mini washers that are like 5 gallons. That's small enough to make it portable but maybe big enough to do more than the flimsy 2 gallon ones I'm seeing for 50-150. I know about the plunger thing. That and some weird little plastic thing you stick in your sink are the only things I can find at all that are made to agitate laundry without a machine."
  },
  {
    "title": "[TECH] Tool wrap, but for various USB cables.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mobrf5/tech_tool_wrap_but_for_various_usb_cables/",
    "content": "You know that thing handymen unroll and it's got all their tools right there https://www.ridemore.fi/images/products/travel-tool-wrap-with-tools-1000x_orig.jpg Does that exist, but as a USB cable organizer?"
  },
  {
    "title": "Bluetooth hub/bridge/switch for car",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/",
    "content": "Our car, which I share with my wife, is new enough that it has Bluetooth to connect to the audio system, steering wheel controls, etc. but old enough that it only allows a single device to be stored in its memory. It's impractical to delete and store a new device every time we swap over between the two of us so our solution has been that my wife has the Bluetooth slot while I have a Bluetooth adapter that transmits to an FM channel that I use when I am driving. This is a suboptimal solution because the audio quality is bad, there is regularly interference from random radio stations on long journeys, and I can't use the steering wheel controls to answer calls, change tracks, etc. What I am looking for is a Bluetooth bridge device. Something that stays connected to the car, and which we both can pair to easily. Something that would relay the audio from our phone to the car and signals from the steering wheel controls to our phones. But it seems like a really niche thing. Do you think it might exist? Looking around I can find plenty of Bluetooth FM transmitter devices, or devices that operate either on TX or RX mode, but nothing that fills this two way passthrough function that I want. I should add that I'm not looking to have both our phones connected at the same time necessarily. Just something that is easy to pair with. It may be that we could find something that we can both connect to and then easily flip between which device is connected to the car, a bit like an HDMI switch. Any ideas?"
  },
  {
    "title": "Silent plug in timer switch with simple interface, temporary override function, and no hidden state",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/",
    "content": "I'm in the UK. I'm looking for something I can use to turn a bedroom light on to help me wake up. There are lots of lots of plug in timers but a lot of them seem like they'd be complicated to use - I'd be able read the instructions and use them while I remember but then I'd forget, and having to keep the instructions around and re-read them repeatedly would get really annoying. I think I may not great at learning things like that, and also a lot of products are just badly designed and cheaply made. Something like this would be pretty much perfect: https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr# - it uses an electromechanical mechanical timer and pins in holes to tell the mechanism when to turn off or on. I particularly like that there's no \"hidden state\" - if you want to know how the device is set you just have to look at it, you don't have to press buttons or anything to find out what settings are stored on internal memory. But as its mechanical I expect it will be audible, which I don't really want next to my bed. (I don't mind an audible sound when it turns the power on and off, I just don't want a constant noise) I also want the feature that you can turn the power on or off with the switch on the bottom left corner and it doesn't change any permanent setting - the timer continues to work and sets the output to what its programmed for at the next pin position. Effectively for each time position in the circle there are three options - turn power on, turn power off, and maintain current state. Lots of other alternatives have little switches instead of pins but those all seem to only have two positions available, on and off, instead of the three that I want. Something like this https://www.argos.co.uk/product/9822911?clickPR=plp:2:3 looks like it will be too hard to use. I see one reviewer wrote \" It was initially a bit complicated to set up but once I got the hang of it, it was no problem at all \" and I fear I would get the hang of it and then forget and have to go through the process of learning multiple times, which means keeping the manual around, especially since the buttons don't have full words on them. I have no idea what \"CD\" means in that context. Another reviewer said \" I managed to throw away the instructions before programming these and have found it impossible to do so despite looking at you tube etc. \" It also clearly has lots of hidden state, so I wouldn't be able to make a habit of glancing at it to check what time its set to go on in the morning before I sleep. I think my ideal would be something like the one I linked at tradesparky, except instead of an electromechanical clock and rotating rings it would have a silent electronic clock, either with hands or an LCD display to show the time, and a microprocessor programmed so that every 15 minutes it checks whether there's a pin in the relevant hole and turns the power on, off, or maintains the set position as appropriate. The current on/off position should be visible, ideally also feel-able like in the one I linked but it could be a display on the LCD with a button to flip it. Options to stay permanently on or off are probably unnecessary, since I can make the device always off using the switch on the device, and I can make it always on by plugging it in to a different socket."
  },
  {
    "title": "Flexible foil like on cream cheese",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mmlz30/flexible_foil_like_on_cream_cheese/",
    "content": "Can you buy foil that is like the foil on cream cheese? It's flexible and rebendable."
  },
  {
    "title": "Alarm clock with separate off button and no snooze",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mmb9oi/alarm_clock_with_separate_off_button_and_no_snooze/",
    "content": "I have a really hard time waking up, like will turn off the alarm in my sleep, wake up exhausted, tried every app hard. Does anything like the title exist?"
  },
  {
    "title": "Looking for a specific protractor",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mm1ts8/looking_for_a_specific_protractor/",
    "content": "I'm looking for a 360 protractor that is in a shape of a ring, not 2 half circles joined together."
  },
  {
    "title": "A website like aggie.io but for music",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mlywhb/a_website_like_aggieio_but_for_music/",
    "content": "Hello! I'm looking to see if there's a website where you can collaborate with multiple peiple on something online like aggie.io but for music !"
  },
  {
    "title": "games like BG3",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mlezgi/games_like_bg3/",
    "content": "Is there any high fantasy rpg game where you can make a bunch of decisions that impact the story, that let you make a bunch of builds like dnd and let you play multiple characters at once?"
  },
  {
    "title": "Is there any media involving this specific kink?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mkgip9/is_there_any_media_involving_this_specific_kink/",
    "content": "So I'm into this oddly specific thing.. elongation of genitalia specifically, and I'm wondering if there's media involving that specifically? I know there's tons of media with elongation, but usually of arms and legs and stuff, im wondering if there's anything out there with parts elongated to unnatural lengths but like.. genitals specifically, I tried to use Google search AND talked to a chatbot (it's slim but there is always a small chance they'll give an answer with something real) and didn't find any useful results, maybe I didn't dig deep enough but.. well, reddit has never failed me yet so here I am, desperately seeking to see if this is a thing (it's fine if not I just need a damn answer) And just know I will settle for ANYTHING if it involves that (preferably no live action is my only preference, but as said, I WILL settle for anything at this point)"
  },
  {
    "title": "A subreddit for pity funding",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mi1khl/a_subreddit_for_pity_funding/",
    "content": "Hear me out, theres some wild subreddits for things like selling media of all kinds of things (both sfw/nsfw). Theres also a few subreddits where people who need a parent for a moment. I know Facebook has something similar but is there a subreddit where you share a post as to why you need financial assistance and (often but not always) rich folks with disposable income will look over different causes and donate pity money to people who need it? Like a go fund me or crowdfunding subreddit that donations go directly to the person?"
  },
  {
    "title": "An analog watch with smart elements (step and sleep tracking)",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mf7u8e/an_analog_watch_with_smart_elements_step_and/",
    "content": "From a fashion standpoint, it would look like a nice analog watch, but inside are some smart elements that allows it to track your steps, heart rate, and sleep cycles, and then send that data to your phone."
  },
  {
    "title": "Small pair of devices that beep when separated more than a few feet from each other.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mbmgqx/small_pair_of_devices_that_beep_when_separated/",
    "content": "I'm looking for something with a hair trigger and not smart phone based. 2 \"things\" that just beep immediately when more than 5 feet apart. They're only paired to each other and nothing else, and the key feature is the immediacy of their reaction to being separated. You might describe this as a \"wireless tether\". All of the the trackers and tag systems seem to be built around bluetooth and phone apps as the anchor. They're more geared towards finding something after it's allowed to separate in the first place; they don't immediately notify you within seconds of separation from the phone. I'm wondering if this exists, but perhaps built for a different purpose than what I intend (put one on a phone and one on a wallet)? Maybe an industrial solution exists?"
  },
  {
    "title": "A web forum that specializes in car chases, road rage, car accidents, vehicles, etc.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9uyfc/a_web_forum_that_specializes_in_car_chases_road/",
    "content": ""
  },
  {
    "title": "Drinking cup with measurements on the inside",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9djnz/drinking_cup_with_measurements_on_the_inside/",
    "content": "I'm looking for a drinking cup not cooking type of measuring cup but with ounce measurements on the inside of the cup only. It has to be solid and not see through. So you can measure and drink liquid out of the same cup without anyone knowing."
  },
  {
    "title": "Kitchen scale dishware.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/",
    "content": "I did a light Google search and didn't find what I was looking for so I'm asking here. Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. Does this exist?"
  },
  {
    "title": "Anyone know if this exists or not?",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m932x3/anyone_know_if_this_exists_or_not/",
    "content": "Im wondering if this thing I remember playing once really exists. I swear I remember a long time ago playing this game of my favorite show as a kid, call Blaze and the monster machines I think, and it was in the style of subway surfers, but it was before subway surfers came out in pretty sure. If you guys can figure it out, then thanks! But if not, it was probably a dream lol"
  },
  {
    "title": "Library website/app that allows friends to share and borrow books",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/",
    "content": "Has anyone created an app or website that would allow you to create an account, connect with friends, upload a list of the books you own, and see your friends' books. You could search for a book you want to read, see who in your community has it, ask to borrow it, and track through the app who you've lent books to and whose books you have borrowed. Basically a library for friends groups or communities who want to connect and share books."
  },
  {
    "title": "Is there like a realistic online animal game(?)",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m7weqi/is_there_like_a_realistic_online_animal_game/",
    "content": "Basically I was watching a tier zoo video and I thought is like this fictional game of life their talking about kinda exist??? Like is there a online game where you can play as a bunch of different animals like squids insects that kinda stuff and it works like real life and every player is like an online thing like doe stgat exist something like that at least? Like it seems so fun"
  },
  {
    "title": "Does my dream underwear exist??",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m5dip3/does_my_dream_underwear_exist/",
    "content": "I'm looking for women's underwear OR women's boxers that are: -100% cotton -NOT high-waisted -if underwear, 100% seamless -if boxers, anti camel toe"
  },
  {
    "title": "A quality desktop wallpaper site that doesn't allow AI, and doesn't have haphazardly upscaled or downscaled pictures",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/",
    "content": "In my experience, wallpaper websites tend to be sketchy and filled with poorly upscaled or downscaled images. AI images are everywhere these days too, and it wouldn't surprise me if these sites were filled with them. I'm wondering if there's a high quality wallpaper site that isn't filled with scaled images or AI junk. EDIT: I'm not here to debate the merits of AI image generation. If you're here to promote it, go away."
  },
  {
    "title": "Links to download apps on any site other than the Google Play Store or the Apple App Store are no longer allowed.",
    "link": "https://www.reddit.com/r/apps/comments/lejc96/links_to_download_apps_on_any_site_other_than_the/",
    "content": "They're impossible to moderate and will no longer be allowed what so ever. Any post or comment in this sub not from either app store or a few common image hosting sites (ie, imgur, reddit, twimg/twitter) are automatically removed. Certain domains that are frequently spammed here are marked for either spam or banning of accounts (I won't list these domains for obvious reasons)."
  },
  {
    "title": "Can I get some insight & advice?",
    "link": "https://www.reddit.com/r/apps/comments/1mz6d3a/can_i_get_some_insight_advice/",
    "content": "M19), Im having a PWA developed for this idea I have, the developer quoted me 20k, broken up into 4 payments of 5k, 5k for each deliverable, started exactly a month ago today, and the progress so far is the UI & UX almost done, but still has revisions in the works, is this very little work & progress for the first 5k payed or is this pretty normal pace and arrangement?"
  },
  {
    "title": "What is better element, discord or what up app for creating communities?",
    "link": "https://www.reddit.com/r/apps/comments/1mz66kx/what_is_better_element_discord_or_what_up_app_for/",
    "content": "Im looking to create community and wonder what is better element, discord or what up app?"
  },
  {
    "title": "I want to make AI app but there is GPT",
    "link": "https://www.reddit.com/r/apps/comments/1mz44c2/i_want_to_make_ai_app_but_there_is_gpt/",
    "content": "Hi, I want to make AI app like other. Most people earn millions by building AI apps but I don't know why users pay them and not use GPT for free?"
  },
  {
    "title": "Why would people use Cal AI over gpt?",
    "link": "https://www.reddit.com/r/apps/comments/1mz43ez/why_would_people_use_cal_ai_over_gpt/",
    "content": "Is there people who use Cal AI and why do you do thatz there is gpt."
  },
  {
    "title": "Building a Widget-Supported Focus & Tracking App: Loopday",
    "link": "https://www.reddit.com/r/apps/comments/1mz3usm/building_a_widgetsupported_focus_tracking_app/",
    "content": "Hey everyone  Ive been working on a little side project called Loopday . Its basically a focus + habit tracker that leans heavily on widgets . You get a clean heatmap of how many minutes you studied each day The widget shows your progress right on the homescreen (no need to open the app) Inside the app, you can run simple focus sessions without distractions Its still super early, but I just put it on TestFlight and Id love to get some honest feedback from you all. Also, Im looking for ideas on new widget designs and features. Would love to hear what kind of widgets youd find useful.  Heres the TestFlight link Thanks in advance!"
  },
  {
    "title": "Running out of storage? Here is an app to convert Live Photos to still images",
    "link": "https://www.reddit.com/r/apps/comments/1mz1yyw/running_out_of_storage_here_is_an_app_to_convert/",
    "content": ""
  },
  {
    "title": "1 year of FREE premium access to BreatheInn app (all 37 breathing exercises & pro features)",
    "link": "https://www.reddit.com/r/apps/comments/1myzkbu/1_year_of_free_premium_access_to_breatheinn_app/",
    "content": "Download app from Appstore for Free: https://apps.apple.com/app/id6744612926 Use Promo Code to unlock premium features BREATHEINNR or use the direct redemption link : https://apps.apple.com/redeem?ctx=offercodes&id=6744612926&code=BREATHEINNR"
  },
  {
    "title": "I need an app that solves every problem for education",
    "link": "https://www.reddit.com/r/apps/comments/1myxrqp/i_need_an_app_that_solves_every_problem_for/",
    "content": "I need an app that solves any subject and any problem. Like Photomath but this only solves math problem. Is there any app that do this?"
  },
  {
    "title": "I need an app to track everything: daily spendings, stocks, credits, crypto. Is there any app which has all of those features",
    "link": "https://www.reddit.com/r/apps/comments/1myw2n9/i_need_an_app_to_track_everything_daily_spendings/",
    "content": ""
  },
  {
    "title": "New App Idea: “Donut” – Offline Social Media via Bluetooth?",
    "link": "https://www.reddit.com/r/apps/comments/1mysmyf/new_app_idea_donut_offline_social_media_via/",
    "content": "Hi everyone! Im working on a new app called Donut. The core idea:  You can create photos, short videos, and text posts.  Content is shared live via Bluetooth to nearby users, completely offline  no Wi-Fi, no cloud.  Likes, comments, and reactions are also synchronized offline when devices meet.  Posts can hop from device to device like a social virus. In short: Its like Instagram/TikTok offline, private and local for people around you. Im looking for feedback on:  How cool do you find the concept?  Would you use something like this?  Any suggestions to make it more fun or engaging? Thanks a lot for your opinions!"
  },
  {
    "title": "Does anyone at all remember this game???? (Radish hat guy saving the ecosystem on an alien planet)",
    "link": "https://www.reddit.com/r/apps/comments/1myrv0c/does_anyone_at_all_remember_this_game_radish_hat/",
    "content": "It is an intro to coding type of game that involved collecting fruit balls and feeding them to their respective monsters as payment for their specific task. It was quiet and had an overarching goal to find seeds and replant the environment. It was on my school computer and now theyve wiped it bc I changed schools. There were aliens/creatures were called diggers, movers, seekers, and a few others. I only reached the stage where you have to get your friend, another bipedal parsnip hat wearer, out of this blue force field. There is a rule where you cant get too far away from a body of water or you will collapse and have to start over the round. I cant for the life of me remember its name or what studio it was from. It had to be cheap bc my school had it. All searches have been to no avail so far. If anyone thinks this sounds familiar or knows another subreddit to post this to, PLEASE,PLEASE,PLEASE let me know. Im starting to think I created it as a powerful delusional coping mechanism."
  },
  {
    "title": "Best app?",
    "link": "https://www.reddit.com/r/apps/comments/1myhf8k/best_app/",
    "content": "What is a lesser known app we all should be using?"
  },
  {
    "title": "What's the best app to create apps using prompts that use AI?",
    "link": "https://www.reddit.com/r/apps/comments/1mynkq8/whats_the_best_app_to_create_apps_using_prompts/",
    "content": "There are so many like Lovable, Replit, Base 44, Flutterflow. Can you guys speak about your experience using these and which one would be best if I want to create an app for Android or iOS? My app uses some graphics and calendar view."
  },
  {
    "title": "I'm looking for this pyramid solitaire app that had a variety of ...",
    "link": "https://www.reddit.com/r/apps/comments/1mym87e/im_looking_for_this_pyramid_solitaire_app_that/",
    "content": "Pyramid solitaire games like kings corner, Russian solitaire Chinese solitaire, so many I hadn't played them all more than once, it was free, it was on my old phone and now I don't see it in the play store"
  },
  {
    "title": "We’ve crossed the 64% mark. Lock In",
    "link": "https://www.reddit.com/r/apps/comments/1myjpu6/weve_crossed_the_64_mark_lock_in/",
    "content": "https://apps.apple.com/in/app/lockin-daily-track-time/id6743713321"
  },
  {
    "title": "Domains are so fucking costly,not getting .com domain.ai seems out of budget(i am broke) does .io or .in be a problem",
    "link": "https://www.reddit.com/r/apps/comments/1mygx21/domains_are_so_fucking_costlynot_getting_com/",
    "content": "As the title above says domains are so costly,not able to get .com domain.ai seems out of budget(i am broke) does .io or .in be a problem from any aspect like target market,seo,aso for in app thing. first time builder can anyone help here"
  },
  {
    "title": "SPOTIFY WEB COM PROBLEMAS",
    "link": "https://www.reddit.com/r/apps/comments/1myg8bz/spotify_web_com_problemas/",
    "content": "Meu spotify premium web no roda nenhuma msica: coloco a playlist para rodar e o site comea a pular todas as msicas at chegar em uma e tocar apenas 10 segundos dela. O que pode estar acontecendo?"
  },
  {
    "title": "Building Revast - An AI Study App That Turns PDFs, PPTs & YouTube Lectures into Notes & Quizzes — Lessons Learned & Feedback Wanted",
    "link": "https://www.reddit.com/r/apps/comments/1mych87/building_revast_an_ai_study_app_that_turns_pdfs/",
    "content": "Im a college student and solo founder who recently launched Revast , an AI-powered app aimed at simplifying how students and lifelong learners study. The app lets users upload PDFs, PowerPoint presentations, or link YouTube videos, and instantly transforms them into organized notes, flashcards, quizzes, and summaries. Weve also integrated an AI Chat feature that allows users to ask questions and get instant help based on their study materials. Creating Revast has been a challenging but incredibly rewarding 1.5-month journey. Balancing schoolwork and building the app meant many late nights debugging and refining features. The most important lesson Ive learned is focusing on simplicitybuilding something that solves real pain points without overwhelming users. Right now, Im eager to hear from this community on a few things: What features would make you use a study app like this daily? Any UX/UI tips to make learning smoother and more engaging? Have you faced hurdles building apps on your own? How did you overcome them? Suggestions for growth or marketing focused specifically on student users? Building an app that genuinely helps learners is my mission, and Id love your insights to make it better. Thanks for reading!"
  },
  {
    "title": "App for knowing friends orders",
    "link": "https://www.reddit.com/r/apps/comments/1my6bgj/app_for_knowing_friends_orders/",
    "content": "Hey yall, made this app so you can follow your friends and see what their fave orders are- so you could not text them \"what do you want from ___\" and just know and pick it up. -- would love any feedback and you can search myordr on the app store- thanks! https://preview.redd.it/r3mqxe6qsskf1.png?width=710&format=png&auto=webp&s=374c31817aa61128d893d445fd1b1c571e5b20ff"
  },
  {
    "title": "Free for a week，my intimates app",
    "link": "https://www.reddit.com/r/apps/comments/1my4c5b/free_for_a_weekmy_intimates_app/",
    "content": "IT'S a sex activity and sex partner management app. IF you like it please give me"
  },
  {
    "title": "What app do you use to save useful posts from different social media platforms?",
    "link": "https://www.reddit.com/r/apps/comments/1my3sy4/what_app_do_you_use_to_save_useful_posts_from/",
    "content": "I know you can usually save and organize posts in the app itself but I use multiple social media platforms and my favorites are saved across different apps e.g YouTube, TikTok, X and LinkedIn. Is there an app where I can save and organize all these posts in one place?"
  },
  {
    "title": "Is there an app where we can learn programming but with fun",
    "link": "https://www.reddit.com/r/apps/comments/1mxyn0m/is_there_an_app_where_we_can_learn_programming/",
    "content": "Mabye using tiktok interface for scrolling to learn"
  },
  {
    "title": "I made JigSwap - photo jigsaw puzzles that you can play offline",
    "link": "https://www.reddit.com/r/apps/comments/1my3dgc/i_made_jigswap_photo_jigsaw_puzzles_that_you_can/",
    "content": "Hey folks  Im thrilled to share JigSwap  Photo Puzzles , my newest game for anyone who loves puzzles and beautiful imagery.  Over 1,000 stunning HD puzzles across themes like nature, art, travel, animals... No timers or gimmicks just pure, peaceful puzzling fun Works offline , so you can relax your mind anywhereeven when youre offline Difficulty levels from easy to legendary; plus helpful hints, smart saving Let me know what you thinkbugs, feature ideas, anything at all. Enjoy the calm!"
  },
  {
    "title": "Just launched an app called HUE – culture-first dating & friendship!",
    "link": "https://www.reddit.com/r/apps/comments/1my2491/just_launched_an_app_called_hue_culturefirst/",
    "content": "Hey everyone, I just finished building an app called HUE and Id love for you to check it out! What is it? HUE is a dating & friendship app built around culture. Instead of swiping endlessly on people with no context, HUE helps you meet, date, and make friends with others who share (or are curious about) your cultural background. You can connect with people from 20+ different ethnicities, explore prompts that highlight identity & interests, and join group chats to build real communities. Why did I build this? As a Nigerian American in the diaspora, Ive always loved Nigerian culture - Afrobeats, Nollywood, and everything in between - but I realized I didnt have a big enough community around me to share that love with. That gap inspired me to create HUE. I wanted a space where people could celebrate who they are, meet others who share their interests, and form relationships rooted in authenticity. Why HUE is different: Culture-first profiles (show who you are & where youre from) Meet people for friendship, dating, or networking Group chats to easily form communities with the people youve connected with Built-in icebreakers so conversations flow naturally Download link (iOS):  HUE on the App Store This is still early, so any feedback is super appreciated. If this sounds like something youd use, please give it a try - and if youve got feature ideas, Id love to hear them. Thanks for reading  https://preview.redd.it/hpillu4pyrkf1.png?width=1290&format=png&auto=webp&s=37fb0f269d978c446270426bce15275570b00cf6 https://preview.redd.it/d8ruhy4pyrkf1.png?width=1290&format=png&auto=webp&s=2a3c6e3d6e00e1dae6b03c9e649ae242405835dc https://preview.redd.it/241fou4pyrkf1.png?width=1290&format=png&auto=webp&s=a5c94b3de933ef6a87ccf31c90fc62190c74e795 https://preview.redd.it/0fcasu4pyrkf1.png?width=1290&format=png&auto=webp&s=5fc0742513be67529944417f839118280a360923"
  },
  {
    "title": "[4.99$ to FREE for 48H] Mindcast – Self-Talk Journal",
    "link": "https://www.reddit.com/r/apps/comments/1my19y3/499_to_free_for_48h_mindcast_selftalk_journal/",
    "content": "Hey Reddit! I just released Mindcast  Self-Talk Journal , an app that helps you understand yourself better through the power of voice journaling. Instead of typing, you just speak your thoughts  the app instantly transcribes, analyzes your mood, and organizes everything for clarity and growth.  Key features:  Voice journaling & transcription  Speak your mind, let the app write it down  Mood analysis  Detect emotional tone and patterns from your words  Categories & tags  Organize your thoughts with ease  Mood charts & insights  Track emotional trends over time  Milestone tracker  Celebrate growth and progress  Export audio  Turn multiple entries into podcast-like episodes Mindcast is built for people who want to self-reflect, track emotional well-being, and grow without the hassle of complicated journaling apps. What Id love from you: Feedback on the design and usability Suggestions for features or improvements General thoughts on voice-first journaling  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Actually working on translation, soon app will have 10 additional languages. Would love to hear your feedback, bug reports, or ideas  and if you try it out, let me know how voice journaling feels compared to traditional journaling!"
  },
  {
    "title": "In this post, share your small business experience, successes, failures, AMAS, and lessons learned.",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1ltkg12/in_this_post_share_your_small_business_experience/",
    "content": "This post welcomes and is dedicated to: Your business successes Small business anecdotes Lessons learned Unfortunate events Unofficial AMAs Links to outstanding educational materials (with explanations and/or an extract of the content) In this post, share your small business experience, successes, failures, AMAs, and lessons learned. Week of December 9, 2019 /r/smallbusiness is one of a very few subs where people can ask questions about operating their small business. To let that happen the main sub is dedicated to answering questions about subscriber's own small businesses. Many people also want to talk about things which are not specific questions about their own business. We don't want to disappoint those subscribers and provide this post as a place to share that content without overwhelming specific and often less popular simple questions. This isn't a license to spam the thread. Business promotion and free giveaways are welcome only in the Promote Your Business thread. Thinly-veiled website or video promoting posts will be removed as blogspam. Discussion of this policy and the purpose of the sub is welcome at https://www.reddit.com/r/smallbusiness/comments/ana6hg/psa_welcome_to_rsmallbusiness_we_are_dedicated_to/"
  },
  {
    "title": "Promote your business, week of August 18, 2025",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mta6a1/promote_your_business_week_of_august_18_2025/",
    "content": "Post business promotion messages here including special offers especially if you cater to small business. Be considerate. Make your message concise. Note: To prevent your messages from being flagged by the autofilter, don't use shortened URLs."
  },
  {
    "title": "I've kept 200 people employed for years. A tariff might end that overnight.",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mywp7p/ive_kept_200_people_employed_for_years_a_tariff/",
    "content": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well. Now with all this talk of a 25% tariff on furniture imports, Im just exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I dont even know how to answer them. What makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported. Instead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin. This could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me?"
  },
  {
    "title": "Just landed a gift shop contract pairing my candles with toy buses — how do I avoid buying cheap junk in bulk?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2lcg/just_landed_a_gift_shop_contract_pairing_my/",
    "content": "So I just landed an exciting contract with a local gift shop and wanted to create a custom bundle, one that includes a handmade candle by myself paired with a toy bus. I am going to tie both together with a nice ribbon so it looks like a nice gift set. The gift shop told me it would better if I source the toy buses myself. So I am a little lost and wanted advice on how to procure something that is not cheap or flimsy. I want something that feels more like a gift and not a party favor, so what are somethings I should look out for in regards to paint, size, and finish? Have any of you created bundled candle gift with non-candle items and have a specific vendor or site where you can order these items at a reasonable price. I was thinking of Alibaba, because I ordered a bunch of candle making supplies from there. Any other sites that I can use to order wholesale toy buses from? Should I prefer die-cast metal over plastic or is plastic okay if its good quality. Are there certain types of paints or coating that may be more likely to chip or smell that I should avoid? I don't want them to look like dollar-store junk."
  },
  {
    "title": "What do you think is a solid long-term path in IT?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2h3m/what_do_you_think_is_a_solid_longterm_path_in_it/",
    "content": "Hi everyone, Ill keep this short: I see a lot of fast money hype online, but Im more interested in what actually brings lasting success as an IT expert. Right now Im experimenting with automation workflows, and while it works to some degree, I also see how hype can destroy real opportunities when everyone suddenly jumps on the same trend. So my question is: Where do you think its truly worth investing time and energy in IT right now? What areas or skills do you see as a good long-term investment that will still matter in 510 years? Id love to hear your perspectives."
  },
  {
    "title": "What do you do with customers who leave false reviews just to hurt your business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5tws/what_do_you_do_with_customers_who_leave_false/",
    "content": "Hey everyone, I run a small family business (appliance repair in California) and Im struggling with a customer who keeps editing her review about us. The problem is her review is just not true. She claimed we charged her $250, when in reality it was $95 (I have the invoice). We did the full repair, her appliance is working, and then we even gave her a full refund. So basically, she got the repair for free. But in her review she forgets to mention that part. I tried replying publicly with the facts, but she keeps editing her review in a way that still makes us look bad. And after checking her review history, its obvious this is a pattern  she leaves bad reviews for lots of businesses, even for places she hasnt actually been. She even left a negative review for a restaurant next door, just because she doesnt like the owner personally. It feels less like feedback and more like someone who just enjoys damaging other peoples reputations. So Im wondering: -Have any of you dealt with people like this? -Can I even get a review like this removed if its clearly false? -At what point is it worth talking to a lawyer about defamation? Running a small business is stressful enough without people like this trying to tank your reputation for no reason. Would love to hear how others have handled it."
  },
  {
    "title": "Starting over at 30… how do I even start a small business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myp49i/starting_over_at_30_how_do_i_even_start_a_small/",
    "content": "Hey guys, Im in my 30s and honestly just trying to start over. I dont really have much right now. No siblings, no financial safety net, just my senior mom and my dogs. My long-term relationship also just ended, so it feels like a big reset in life. Ive always liked business and want to start again. I dont have much money, so Im thinking of starting small while keeping my job on the side. For anyone whos been in a similar place, what are some small business ideas or tips for starting on a really low budget?"
  },
  {
    "title": "are bad photos gonna be the next “aesthetic”?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myvvhk/are_bad_photos_gonna_be_the_next_aesthetic/",
    "content": "idk if anyone else noticed but polished content feels sooo fake now. e very brand ad looks like the same ai filter or stock template. but lately i find myself stopping on like blurry pics, messy vids, stuff that clearly wasnt staged. it actually feels more real. so maybe the future is unpolished? like bad photos, awkward angles, grainy phone vids could that actually be the new good? curious if anyone else feels this or if im just going nuts scrolling too much lol"
  },
  {
    "title": "My Dad is pressuring me to buy his auto business",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myiwd5/my_dad_is_pressuring_me_to_buy_his_auto_business/",
    "content": "Thanks for reading. I'll try to keep it short. My family has a small tire shop / auto repair business. It used to have multiple locations all over our city. It now only has two locations. My uncle (68yo) is pressuring my Dad (71yo) to retire and sell his location. My Dad is now pressuring me to find partners and buy his Tire Store / Repair Shop. He hasn't given me a number but I am guessing about 1.1 Million. He seems to think that me and my friends/partners should easily be able to come up with a loan to purchase it. He hasn't been managing it too closely the last couple years and it takes in about 5k-9k or more in revenue a day ( this is based off anecdotal evidence when I was doing the deposit at the end of the day last year). I am currently employed as a teacher (probably one of the few with a State Inspection and Emission license) and finally reached the top of my pay scale (about 110k a year). The only debt I have is about 50k left on my home and about 40k left on my wife's student loans. I (43yo) have worked here continuously since I was 15. Even being a teacher for the last 20 years I came in after school and have run the counter, changed tires, done inspections and light maintenance. I am mostly terrified of having to pay for auto maintenance that I can't do in my drive way. Does anyone think that if I got at least one if not two partners we could secure a small business loan? Might there be another way to finance this? Thanks, I am clueless. Addendum: My Dad and uncle are on the outs. He has been told he can retire and collect a paycheck but he is not welcome in his store. So my dad is kind of hoping I can buy his location so he can have both the money and the location to have his car and tires serviced."
  },
  {
    "title": "Is a good website still worth it or do most people just run off socials now?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mywqf2/is_a_good_website_still_worth_it_or_do_most/",
    "content": "Feels like everyone I know is pushing their biz on Instagram or TT and kinda ignoring their websites. Some even say why bother if 90% of customers come from socials anyway... Do you think having a proper website still matters for small businesses? Or is social media + a linktree good enough in 2025?"
  },
  {
    "title": "Should I lower my prices to match internet pricing or offer Buy 1 Get X% OFF deals?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5c6i/should_i_lower_my_prices_to_match_internet/",
    "content": "I have physical niche store. 90% of my customers know find and purchase the same products online. The benefit I provide is that they can see and experience it in person before buying. For that experience I charge $10-$15 more. It's the only way I can make a profit. Instead I am thinking to lower my prices to capture a large amount of orders from my customers and make them repeat customers. I can either lower my pricing to be $5 within the Amazon or online pricing. Or I can incentivize by creating Buy 1 Get X % off offers. Is there a recommended sales strategy for pricing based on psychology of purchasing?"
  },
  {
    "title": "At what point did you bring in bookkeeping help?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mys6k0/at_what_point_did_you_bring_in_bookkeeping_help/",
    "content": "I run a small catering business, and lately its been picking up more than I expected. Between invoices, supplier payments, and tracking deposits from events, Im realizing my spreadsheets are getting messy and Im probably missing things. For those of you whove been here when did you decide it was time to hand off the books to someone else, and how did you find the right help? Did you go with a local bookkeeper, an online service, or just keep pushing through until revenue got bigger?"
  },
  {
    "title": "What job title should I put when adding my small business to a resume?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2zdb/what_job_title_should_i_put_when_adding_my_small/",
    "content": "I (22) currently have a small videography business, just me and my own equipment & software working on videos for local businesses/organizations/etc. This isnt a full time gig since Im not busy enough with it to be working every day and my main job is being a freelance part-time production assistant for a corporate news entity. Im applying for other positions elsewhere but Im not sure what to put as my job description for the business I started. I know president indicates that I have employees so I wont be using that, would owner/operator be my best bet? TIA!"
  },
  {
    "title": "idk what idea to choose",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz2qz4/idk_what_idea_to_choose/",
    "content": "im a 2d illustrator with not many pieces in my portfolio but the ones that are there are incredibly whimsical detailed very character design oriented i wanna know what can i do? i want to polish up my art and create a portfolio and then should i use that art for stickers prints keychains and small things like that? i also want to start a clothing business but idk if it should be street wear (i dont wear it) or semi formal boutique type clothes (i wear this) which i can design. im also considering tote bags but like jeans or courdroy type of cloth. argh so many ideas so little time"
  },
  {
    "title": "To the actual business owners of this community: how are you managing email without burning out?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz73on/to_the_actual_business_owners_of_this_community/",
    "content": "Lately Ive been realizing that one of the hardest parts of running a small but growing business isnt the sales or the bookkeeping its the emails. When I first started, I could get by replying to everything myself; late at night, on my phone, in between tasks. But now that things are picking up, the inbox is constantly filling with customer questions, supplier updates, and even staff stuff. The problem is, every email feels like a mini mental workout. I catch myself rewriting the same message five times just to make sure it doesnt sound curt, unprofessional, or worse, like Im annoyed. Half the time I sit there staring at the screen, knowing I should move on to bigger tasks, but feeling guilty if I dont answer right away. Curious how others here handle this: * Do you personally write every email, or have you found ways to streamline it? * Do you rely on canned templates, an assistant, or just sheer willpower? * Do you block out time for email, or reply as things come in? Feels like one of those invisible drains on energy that nobody talks about, but adds up fast. How are you all managing the inbox without it taking over your day?"
  },
  {
    "title": "is zenbusiness good for small businesses? i use it now for my small fashion label but im wondering if there are better options. i just started my business",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz6tj0/is_zenbusiness_good_for_small_businesses_i_use_it/",
    "content": "so ive done a lot of research after the fact that i signed up and paid for zenbusiness but is it worth it and will it help my business or should i switch elsewhere? should i terminate it? any suggestions are helpful, so thanks in advance  pls b nice in the comments lol"
  },
  {
    "title": "How non-technical owners can actually use AI (without rebuilding everything)",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz6t7k/how_nontechnical_owners_can_actually_use_ai/",
    "content": "We wear ten hats. What worked for me: tiny wins  auto-responses for FAQs, batching content with GPT, and simple Make/Zapier flows to sync CRM + email. I put the methods into Athenero for solo owners who are not tech people. No link unless mods allow  happy to share examples/checklists. Whats the most repetitive process in your shop right now?"
  },
  {
    "title": "How do you keep track of competitors as a (starting) small business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1myx9tp/how_do_you_keep_track_of_competitors_as_a/",
    "content": "for those of you running a small business, how do you actually keep track of what your competitors are doing? do you have some kind of system, or is it more like random google alerts and stumbling across their updates by accident? feels like every time a competitor changes pricing, launches a new product, or announces something big, i only notice weeks later. curious if other smb owners actively track this stuff or if most just focus on their own thing until it becomes a direct threat."
  },
  {
    "title": "Anyone need Cheap Server",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz6iec/anyone_need_cheap_server/",
    "content": "Anyone need of Shared server or VPS. DM me. I will provide low cost Shared Server at 2000/- annually with 1 cpanel and 5 mail with unlimited bandwidth. We will provide free migration. If you can provide 10 leads I will provide you free Server.."
  },
  {
    "title": "Looking to collaborate with early stage startups",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz6ad7/looking_to_collaborate_with_early_stage_startups/",
    "content": "Running a consulting team and wish to work with founders at early stage startups to help them launch/raise funds/grow. A mutually beneficial collaboration, would love to hear more from founders who have a solid plan and are in pre-seed, seed or series A stage. Strategy, consulting, marketing, execution, would love to hear and discuss more on this."
  },
  {
    "title": "MAGIC TRADESHOW/BOUTIQUE HUB (as a vendor)",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz64on/magic_tradeshowboutique_hub_as_a_vendor/",
    "content": "Hi - i just attended the vegas magic fashion tradeshow. I may want to exhibit in february as a brand selling sunglasses. It was great but i got some intel it has slowed down. Are retailers really placing orders? Also, I met with the boutique hub about selling on their platform. Any other vendors feel its worth it? Thanks!"
  },
  {
    "title": "Monthly Business Support Service – Helpful or Just Added Expense?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz62nv/monthly_business_support_service_helpful_or_just/",
    "content": "Im launching my own small healthcare practice (solo telehealth) and could use some perspective from other business owners. Ive handled most of the basics (LLC setup, business licenses, insurance credentialing, website, and initial marketing). Im now considering hiring a support service that offers one monthly meeting + unlimited email questions to help me navigate practice management. No contract, just month-to-month. Its healthcare-specific (Duet NP), but I imagine many industries have similar services. My questions are: If you used something like this for your small healthcare business? Was it worth the investment for ongoing support, or do you feel ad hoc consulting/resources were enough? Any red flags youd advise me to look for? Would love to hear how others balanced the costs vs benefits of this type of service."
  },
  {
    "title": "I’m lost on what to do in life",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5zfg/im_lost_on_what_to_do_in_life/",
    "content": "I just turned 25 I have over half a million saved up because I started a business when I was 20 and it became semi successful my business is now faking and Im shutting it down , my goal was to have millions by 30 but now Im lost on what to do next . Someone recommended insurance brokerage business could I attain this goal from starting an insurance brokerage"
  },
  {
    "title": "Custom home builder doing $5M-$10M revenue annually… how do I scale the value of the business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz5ufp/custom_home_builder_doing_5m10m_revenue_annually/",
    "content": "I am the owner and am heavily involved. However I have a team of 4 that can virtually run everything without me (one in particular that operates as the COO). I mainly generate sales and am linked to the brand reputation. Our client base is mainly 5-10 customers annually given the high-end homes we build. How do I build on the value of the business? We have consistently strong revenue and EBITDA but we are very specialized doing a handful of high-end homes a year and reliant on myself landing clients. I worry that if I ever wanted to sell, the business valuation wouldnt be huge due to these reasons. Are there logical ways to expand? Do investors or private equity firms buy businesses like mine? How can I ensure valuation of the business brand beyond assets? I want to ensure I have a good exit and target as the business evolves."
  },
  {
    "title": "Buying a Car Repair Shop as of Friday",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz59sa/buying_a_car_repair_shop_as_of_friday/",
    "content": "As of Friday I'm in discussions to buy a local repair shop. The purchase will be the assets under a new LLC that I have yet to form. I have an experienced CPA in my family that will review and I am currently seeking a transaction lawyer and bank. The owner has repeatedly told his acquaintances in front of me that I am the one buying the shop and has expressed to me various other parties have been very interested including an offer over his asking price and stated he informed them I was already \"the buyer\". There are a few problems so far, one being my inexperience. The other is the seller is a boomer and is sort of handwaving the whole thing in the most literal \"I know what I got\" sense. To wit the only numbers I have are a profit and loss statement from 2023 and 2024. I've requested the to date 2025 p&l plus balance sheets from the same years and tax statements from 2022-2024 and gotten no response (not unreasonable as it is the weekend over which all of this has occurred). In addition I've asked for an asset list but instead got walked around the shop, told of a few issues, shown the on-hand inventory room and had it handwaved as \"all this\". It's a viable business doing poorly but on top of my agenda is a true asset list because I have to know what I'm buying. I mean there are literally no details, such as is there a shop owned vehicle? Is the wall art included? I mean there is literally no way to value the assets without knowing what they are. At the very least it seems like I'd need this information for the bank as I intend for the assets to be the collateral under the LLC. There are many other open boxes on my checklist such as key employee retention and ensuring the landlord is going to honor the existing lease, and the actual lease details which I have yet to even get verbal details save the dollar amount. US state, \"at-will\" employment. When I mentioned reviewing a purchase agreement contract he seemed like that is something I would be providing, which to me was just insanely weird. As far a a training period, as I have no experience in this industry, he has repeatedly stated that he is just going to stay on and keep doing the exact same things. That's a whole other issue as I intend to change everything and not just be some wallflower intern holding the bag while he continues to pretend he owns the business. Just a red flag for later, I don't intend to press the point until we have a contract which I believe should include his ongoing involvement. I'm convinced he would void the whole transaction if he knew I planned to change anything if not everything. In addition I am recalcitrant to share my ideas for improvement before obtaining ownership. In the most mundane sense it seems like he would expect the aforementioned wall art to remain, but also himself remain in ownership of it. At leat that's my impression, and I don't want to test that this early in the process. I mean this to be an anchor post for what I assume are many, many questions during the process as I have never owned a business. I feel like I'm buying a truck from this guy and he doesn't want me to look under the hood. I expect it's bad based on the P&L but how bad and is it fixable are outstanding questions. The biggest sticking point I have right now is the lack of financial documentation and the asset list. The few most pressing questions are: What do I look for in a bank or credit union, or is there a service that will shop around for my loan? Apart from business loan is there any type I should be seeking (analogous to 30 year home mortgage)? What will they likely want apart from my information? Realistically what kind of timeline should I expect, assuming the financials are provided, from setup of the LLC to loan application to legal issues?"
  },
  {
    "title": "Baltimore area Accounting firms",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz51gf/baltimore_area_accounting_firms/",
    "content": "I live north west of Baltimore and am looking for an accountant who could help with both my small business taxes and personal. I've worked with another firm that I've felt underwhelmed with in regards to personal taxes so I am looking to explore my options. If you could also post how much these firms charge for filing that would be awesome Thanks in advance"
  },
  {
    "title": "Hiring an email marketer?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz4z2c/hiring_an_email_marketer/",
    "content": "READ FIRST: I'm not hiring an email marketer. I'm doing research. As a small business owner, what's stopping you from hiring an email marketer to help you build an email list, manage it, grow it, write emails, and set up sequences for it for you? Share your genuine answer or any past experience. Thanks in advance,"
  },
  {
    "title": "Quarterly Career Thread",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1lc83ow/quarterly_career_thread/",
    "content": "For all career related questions - how to get into product management, resume review requests, interview help, etc."
  },
  {
    "title": "Weekly rant thread",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mw5qbw/weekly_rant_thread/",
    "content": "Share your frustrations and get support/feedback. You are not alone!"
  },
  {
    "title": "How would you approach USER SEGMENTATION for this interview question (Meta, product sense interview about a week ago)?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mz5wfd/how_would_you_approach_user_segmentation_for_this/",
    "content": "Question: You're a PM at Trader Joe's. We've been losing revenue to a new entrant, which is a meal delivery service like Blue Apron / Hello Fresh. How would you counter this competitive threat? I had a really hard time with this, because I kept gravitating towards segmenting by the reason the user would have left Trader Joe's in favor of meal delivery (eg convenience, no car, urban dweller, etc.), but that meant jumping to the problems section prematurely and really limiting myself once I got there. How would you approach this?"
  },
  {
    "title": "Due to a hiring freeze, I had to recruit candidates without product management experience to meet demand. Best tools and resources to help them?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1myt0dl/due_to_a_hiring_freeze_i_had_to_recruit/",
    "content": "Large Tech company involved in B2B software development. Due to a hiring freeze at my company and an immediate requirement for BAs/Proxy POs, I had to recruit 3 folks without product management experience. They are essentially from the business development side of our org and have good PM and communication skills (reason why I was okay with them). I have personally trained them on Agile, Scrum and Product Management over a series of 9 x 1-hr sessions focusing on the fundamental concepts and specific practical knowledge about product management practices with this client. I am wondering what resources I can share with them that focuses less on processes and tools and more on experiential learnings specifically in a B2B environment and in T&M projects where we dont really own the scope."
  },
  {
    "title": "Anyone here very take a lower level and TC to move from small company to bigger tech?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mz0wn1/anyone_here_very_take_a_lower_level_and_tc_to/",
    "content": "I've been at my current PM role for a few years now and have the opportunity to accept an APM offer. Current role has been ok but I'm tired of it The offer is not exactly FAANG or even F100, but it's an F500 software company with global presence. I'm less worried about title and comp but want to make sure I don't screw myself due to it being an employer's market"
  },
  {
    "title": "[Seeking advice] Asked to takeover another PM's team and found out...",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mz6p5k/seeking_advice_asked_to_takeover_another_pms_team/",
    "content": "I have been a high performer for a product area. The other product manager (went to another org) under the same manager of mine has left, my Dir of Product has asked me to take over this person's product area and engineering team but asked me to hand over my area to a current Associate PM as his promotion. I was been told the new product area and squad is a good team. Two weeks after taking over the area, I found that things were buried under the rug like 1)features done but never released to production for 1/2 year. 2) initiative spanned 3 quarters never had MVP defined and kept getting delayed."
  },
  {
    "title": "Al isn't the dot-com bubble, it's the cloud",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1my00cf/al_isnt_the_dotcom_bubble_its_the_cloud/",
    "content": "I keep seeing people compare Al to the dot-com bubble, and I don't think that's the right analogy. The dot-com bubble was due to companies not having any real revenue model that worked. Eventually we figured it out. But Al is actually being adopted and there are real productivity gains. If anything, Al looks more like the early cloud days. At first, the cloud was pitched as cheaper, but once everyone was hooked, the bills exploded and it became a permanent line item. Even Elon Musk had X/Twitter ditch parts of the cloud to save money. claiming 60% lower storage costs and $100M a year in savings by moving back to servers. Eventually these Al companies will have to make serious returns and jack up the price. Don't get fooled by the current price and know that this will not last forever."
  },
  {
    "title": "How was your experience dealing conflicts in workplace? conflicts, not disagreements, like a uncooperative coworker/dev or tough stakeholder in your job?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1my9g4t/how_was_your_experience_dealing_conflicts_in/",
    "content": "Here's my experience: Dev Lead was always talking down any suggestions I make, I involve devs early as it gives shared ownership and quick buy-in, and when i tried asking their opinion during discovery on inputs we have about a potential feature, here's what i got from dev \"This is something you should tell not us\", which technically is true but i think it set a tone in the room and didn't know how to handle it; i knew if i said something in the moment it would end up becoming bigger than what it should be; I stopped asking open ended questions for sure and stopped involving dev in discovery as they felt that its waste of time and although i tried to tell benefits in retrospective meeting, nothing worked how would you handle such situations? i tried looking up web and tired of bookish answers, not just this scenario but how to handle such situations say with stakeholders and others?"
  },
  {
    "title": "How much time do you spend finding A/B test ideas",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxzc2f/how_much_time_do_you_spend_finding_ab_test_ideas/",
    "content": "Hey fellow PMs!  Working on understanding real CRO workflows. Quick questions: How much time per week** do you spend brainstorming/researching A/B test ideas? How many tests** do you typically launch per month? Where do you get your test ideas?** Analytics deep dives? User feedback? Competitor research? Team brainstorming? Other sources? What's your biggest bottleneck** for launching more tests? Coming up with ideas? Getting dev resources? Analysis paralysis? Tool limitations? No sales pitch ( yet.. WIP) - just trying to understand if there's a real gap between \"knowing we should test more\" and actually doing it. Thanks!  *Feel free to DM if you prefer !"
  },
  {
    "title": "ChatGPT makes me think clearer?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1myjdvi/chatgpt_makes_me_think_clearer/",
    "content": "There's research and anecdotal data saying that the use of LLMs like ChatGPT is making you think less, like written here - Is ChatGPT really making us dumb and lazy? . I'm a heavy AI-x/y/z products user (ChatGPT, Perplexity, Loavble, Gemini, V) and use it for almost everything. I've noticed recently that something changed for me in the past year, I've been \"seeing things\" differently, in a more systemic and \"1st principals\" types of ways, helping me cut through the noise in my day-to-day corporate PM job.. and my hypothesis is that these tools helped (substantially) with it. On one hand, they help a lot, on the other, they do a lot of garbage-in garbage-out, and I'm hyper-sensitive to people thinking I did a poor job at something, making me really think with the perspective of someone reading the output and is objecting to it and thinking it's trash/written by AI - and it makes me very aware at whether the output of the LLM is true and makes sense, forcing me to see the deltas between my thinking and the output in a very nuanced way, so I add context and repeat it again and again. At the end, I spend more time on refinement with AI compared to just writing it. But when I'm done with the refinement, I feel like I have a very good sense of what I want to do, and especially what led me to it (tracing it back to the source, the ground truth). So, it's not all bad, at least for me. Wonder if anyone else noticed it.. it's a bit unexpected since it does most of the \"heavy lifting\""
  },
  {
    "title": "Grad schools! UIUC vs. UMD comparison; help me choose.",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxyyhq/grad_schools_uiuc_vs_umd_comparison_help_me_choose/",
    "content": "I'm a highly experienced technical project manager (digital transformation, cybersecurity, web product development) in the DC area looking to get formal product training, since my experience has been much more heavily weighted to the project side of things than product. I'd prefer fully online coursework, but I would also highly value the strength of the networking opportunities, since this is currently a weak point for me. Any insights on the pros / cons of the two options below would be greatly appreciated. Background: I have an undergraduate degree in cybersecurity, and will complete an MS in Cybersecurity Management & Policy soon. This is at an online school (UMGC), which does not have a strong alumni networking presence even here in the DMW. Certified Scrum Master, Advanced Certified Scrum Master, and I'll most likely have the PMP this year, but nothing specifically product-focused. Undergrad GPA is terrible, grad school GPA is 4.0 so far. I also have three cybersecurity certs in my pipeline for this year, but as with my degree, nothing product-specific. Option 1: UIUC's MS. Management or MBA. The MSM degree stacks into the MBA if I wanted to add that next year. Business degree from a strong engineering school, great global alumni network (they have alumni meetups here in DC, alumni are engaged and available to chat with prospective students, everyone I've talked to has repeatedly mention the value of mentorship, job referrals, etc). Has an opportunity for an annual in-person alumni networking event that everyone raves about, plus in-person project groups at US and international locations once or twice a year. This is a general-purpose management degree. The global exposure and networks are of interest me as much of my career has been international, and I'm extremely interested in working internationally again in the future. Option 2: University of Maryland's Product Management Master's. Also a great engineering school. Uncertain how engaged or active the alumni network is for referrals, but here in the DMV where the next several years of my career will be, UMD grads are absolutely everywhere. Very good local reputation. I'm also just outside campus and on their shuttle route, so it'd be really nice to be back in an academic environment again, have access to student groups, have spaces to work or work out, and just be more engaged and out of my house, even though the program itself is entirely online. The professor who founded the program did an in-depth career call with me, was extremely well-prepared, and is someone I'd love to have as a mentor or in my network. I've attended a couple of their alumni presentations as well, and they're impressive people. This is a much more focused degree specifically on product management. Thoughts? Which of these would you consider the better learning opportunity?"
  },
  {
    "title": "Customer health dashboards lie, what early warning actually earns sprint time?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxg5o4/customer_health_dashboards_lie_what_early_warning/",
    "content": "Quick sanity check from the CS trenches. Ive been living in health-score dashboards with a bunch of CSMs, and were deep in data but still getting blindsided by churn. The patterns that are too consistent - Validation grind, testing every potential churn trigger one-by-one is a month-long process to get right. - Context black hole: a 30% usage drop might mean champion left or the feature is fully automated. data never tells the story. - Scaling wall: The \"just talk to customers\" isnt a strategy past a certain number of accounts. All these make it incredibly challenging to give the product clear, actionable signals on what to focus on to prevent churn proactively. What signal has earned a spot on your roadmap and beat a shiny new feature in prioritization? How do you convince your leadership? Have my own thoughts from the CS side, but I'm here to learn yours first. What worked?"
  },
  {
    "title": "How to better retain things you read?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxmh8u/how_to_better_retain_things_you_read/",
    "content": "Hi All, As a product manager. You always have to keep learning. However, I always find myself reading lot of stuff but not able to retain them. I will forget articles or books days or after a month. I try keeping notes and flashcards but I find myself not visiting them again. I am curious to know how others retain stuff they read / learn."
  },
  {
    "title": "Getting a product designed, anyone worked with a product development team like Product Innov?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxef6m/getting_a_product_designed_anyone_worked_with_a/",
    "content": "I am in the early stages of developing a new product and recently reached out to a local design agency. They had a solid portfolio and seemed genuinely excited about the idea, but the quote they gave me was much higher than I expected. I have also tried going the freelancer route online before, but the experience was not great. Communication was patchy and the final design did not really match what I envisioned. Now I am exploring options like Product Innov, where the team can handle the whole process from design through prototyping. For anyone who has gone that route, did you find working with a dedicated product development team worth the cost compared to piecing it together with different contractors? Did you work locally so you could meet in person, or was remote collaboration just as effective?"
  },
  {
    "title": "Thoughts on making a PM run PI planning?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mx8spw/thoughts_on_making_a_pm_run_pi_planning/",
    "content": "I'm looking for some other opinions here about my post title. TLDR: Our engineering lead has been running PI planning each quarter, I (PM) manage bringing our product teams together during PI planning and create our main PM deliverables that the engineering team uses to create their plans for the quarter. Our engineering lead wants me to run it. Personally, I hate PI planning, partly because the things I manage are on a 9-12 month release cycle and quarterly rituals don't always have any impact/change.. Part of why I don't want to lead is I feel like I already do a lot of work during the process. I manage bringing the product groups together to capture and ensure we have detailed requirements where needed. This ends up being a 10-15 page word doc with links and resources that the engineers use for their part. Frankly, I don't want to have to manage everything. We are 100% remote and the process covers 2-3 weeks of hour long meetings so it is a drag and not just knocked out at once. When I have looked around about who fills this role, I saw the \"standard\" is that there's an engineer who focuses on facilitating collaboration across the groups. I'm curious if other PMs have been made to run the process or if its reasonable to push back and have someone else help out."
  },
  {
    "title": "PMs @ founder-mode companies: what’s it like?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwq8mx/pms_foundermode_companies_whats_it_like/",
    "content": "I just finished watching Lennys interview with the intercom CEO, Eoghan McGabe. Its a pretty insightful watch to hear about how a 14 year old company is transforming their product from a legacy to AI-first system. He was honest about the changes he felt needed to happen because it was existential, even though it was painful for all involved. One thing I learned was that he had returned to the company as CEO and now considers Intercom as founder-led (aka in founder mode). For PMs that are working or has worked at a company that are in founder mode, whats the experience like as a PM in that environment? Eoghan described Intercom went from gentle democracy to top down decision-making in this transition. Im curious whats that looks like in terms of the level of autonomy PMs get. https://youtu.be/0_opWSfmN8M?si=uDk8tdw95SLIN88c"
  },
  {
    "title": "If you were building or evaluating a Digital Twin, where would you put the emphasis",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mxehrm/if_you_were_building_or_evaluating_a_digital_twin/",
    "content": "Digital Twin is one of those product categories where the definition feels fuzzy. Some see it as visualization and monitoring, others push for AI-driven insights and optimization. If you were building or evaluating a product in this space, where would you put the emphasis? Accessibility and ease of adoption? Deep customization for specific industries? Or positioning around security, data ownership, and pricing model as the differentiators?"
  },
  {
    "title": "Startup help",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwtyt3/startup_help/",
    "content": "Company is less than 5 years old and has a team of two full time engineers that include the technical cofounder. Leadership has decided we need product management and Im leading the charge. I feel overwhelmed going through the backlog in jira trying to rate and scope feature requests while bugs just pour in. We have such limited technical resources that prioritization is so important. What frameworks should I be using? How far out is reasonable to plan? What should I be thinking about that Im not!? For further context, leadership all just agreed on what our ICP is about a month ago."
  },
  {
    "title": "Smartsheet and SLA timelines",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mx1w0e/smartsheet_and_sla_timelines/",
    "content": "Can anyone help tutor me on making a Smartsheet fowllowin SLA practices? And help me understand Stan"
  },
  {
    "title": "Friday Show and Tell",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwykia/friday_show_and_tell/",
    "content": "There are a lot of people here working on projects of some sort - side projects, startups, podcasts, blogs, etc. If you've got something you'd like to show off or get feedback, this is the place to do it. Standards still need to remain high, so there are a few guidelines: Don't just drop a link in here. Give some context This should be some sort of creative product that would be of interest to a community that is focused on product management There should be some sort of free version of whatever it is for people to check out This is a tricky one, but I don't want it to be filled with a bunch of spam. If you have a blog or podcast, and also happen to do some coaching for a fee, you're probably okay. If all you want to do is drop a link to your coaching services, that's not alright"
  },
  {
    "title": "Is Everything Fine with Jira?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwqlrv/is_everything_fine_with_jira/",
    "content": "Hi, Im looking to learn more about Jiras ticketing system. Heard that keeping Jira aligned with the actual roadmap is a challenge; however, Im not sure how true this is. Some people claim they dont get the toxicity around Jira, while others are pulling their hair out. My question is: what is the problem with Jira? Is it that youre losing context that doesnt make it to Jira? (I dont have a product to pitchnot much came up that directly answered my question upon searching Reddit multiple times)"
  },
  {
    "title": "Your thoughts about Product people who are regular on Social Media?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwf13f/your_thoughts_about_product_people_who_are/",
    "content": "I think this sub believes Marty Cagan's views work in an ideal organisation where the CEO is bought in, and that there are people who are doing real product work but not posting about it on social media. But keeping those aside, what are your thoughts about these (or other) product managers and what they write/say/do? And who is the better of the lot? Marty Cagan, Aakash Gupta, John Cutler, Teresa Torres, Shreyas Doshi, Sachin Rekhi, Janna Bastow, Jason Fried, Julie Zhuo, Chloe Shih, Scott Belsky, Diego Granados, Melissa Perri, Mahesh Yadav, Hiten Shah, Ryan Hoover, etc"
  },
  {
    "title": "Who actually takes care of your transactional emails?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwgbb8/who_actually_takes_care_of_your_transactional/",
    "content": "Weve been discussing this in our team recently and realized were not even sure how other companies handle it. Im not talking about the usual marketing emails or password resets, but the in-product notification emails  the ones triggered by real events in the product (process done, process failed, new comment, confirmation, etc.). Who in your company actually owns those?  Engineers?  Product managers?  Ops/Support?  Or no one really? And how are they usually managed? Do you have a proper workflow/tool for editing them, or is it more of a just update the template in the codebase when someone screams? Were curious because these emails are super important for users, but it feels like they often fall into a grey area where no one clearly takes responsibility. Would love to hear how your team deals with it"
  },
  {
    "title": "Need help: is my firm Fintech or Wealth Management and are they product or sales driven?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mx8oj1/need_help_is_my_firm_fintech_or_wealth_management/",
    "content": "I wont say the name of my firm as I want it to remain unknown, partially for privacy and partially because I feel many companys may have a similar identity issue. The company I work at is an independent broker dealer. The primary metrics which drives the stock prices are Assets Under Management AUM and the number of advisors at the firm (both growth and attrition). This leads me to believe we are a through and through sales driven org. Where I get confused is, leadership calls us a fintech company (our tech is pretty crummy). If it was only communicated externally as market I would be okay with it, but its not. The tech and product org truly believe we are a fintech product driven org. It creates a lot of confusion between business, product, design, and tech. As Im one of the few people that see the misalignment, I feel I have a clear and powerful opportunity to align myself to sales leadership and be one of the few product people driving the sales led vision. My only worry is this will annoy tech and product leadership. Anyone else work in a sales driven org where tech and product think its product driven?"
  },
  {
    "title": "How to approach multi-year Roadmapping and prioritization?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwq2oi/how_to_approach_multiyear_roadmapping_and/",
    "content": "Im looking to improve how I approach roadmapping and make sure I dont have blind spots. Id love to hear how others think about building product roadmaps. My product domain spans 3 verticals. When I stepped into the role, each vertical had its own roadmap but no shared vision or alignment to company goals. I reset things by creating a long-term vision for each vertical, building product strategies, and then combining them into one roadmap that balanced customer needs, technical feasibility, and company strategy. Heres how I approached it: Partnered with sales and customer success to understand and develop conviction for real customer problems . Conducted competitor analysis and stakeholder interviews to find gaps and opportunities. For each vertical, set a long-term vision and broke it into phased roadmaps, sequencing initiatives by customer value and feasibility. Rolled these into a unified roadmap by: Identifying cross-team dependencies, prioritizing by user value and strategic alignment, and using theme-based planning and buffer zones instead of rigid deadlines. Curious on how would you approach building roadmaps for your product domains?"
  },
  {
    "title": "PM vs SPM expectations",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mw61go/pm_vs_spm_expectations/",
    "content": "I'm a product manager with 3 years experience as PM (20 in total YOE). I'm building a new product now and is expected to build at least 3 more new products. I'm in B2B SAAS for dev tools. I asked to be evaluated for a senior PM role but I've been told I'm not ready yet. Somehow I'm expected to do the entire strategy and lifecycle from scratch several times. Is this a reasonable expectation for a product manager? If you are a senior product manager, what are the additional expectations for you?"
  },
  {
    "title": "Head of Product: drowning in Linear + Slack + Figma + HubSpot… how do you keep a single thread of truth?",
    "link": "https://www.reddit.com/r/ProductManagement/comments/1mwirag/head_of_product_drowning_in_linear_slack_figma/",
    "content": "Im HoP at a startup (early but funded). Our context is atomized: Linear for eng (source of truth in theory) Slack for cross-team decisions/drive-bys Figma for design comments + approvals Attio/HubSpot for sales asks where design/product gets pulled in (design as sales) Result.... important decisions and next steps are scattered. I lose latency between signal  decision  follow-through. Half my day is did I miss something critical? What has actually worked for you to centralize context without introducing yet another inbox? Examples Id love to copy: opinionated Slack conventions (e.g., #project-x-decisions with required message format) Linear issue templates/automations that hoover up Slack/Figma links Zapier/Make routes that turn specific Slack reactions into Linear updates Weekly state of decision log ritual that isnt busywork Happy to share back anything that sticks. Just need something that reduces coordination tax, not adds more."
  },
  {
    "title": "I made $6.7k in 2 months from a Mac app I built for fun",
    "link": "https://www.reddit.com/r/SideProject/comments/1myytvu/i_made_67k_in_2_months_from_a_mac_app_i_built_for/",
    "content": "A couple of months ago, I released Wallper . Its a native live wallpaper app for macOS. At first it was just something I wanted for myself because I couldnt find anything on Mac that felt right. Either the apps were ugly, or slow, or locked behind subscriptions. I thought it would stay a small side project but it grew way faster than I imagined. Heres where things are right now  8,367 active users  742 paying customers  $6,761 in revenue  33,000 visitors and 62,000 page views on the site I spent nothing on ads. All the growth came from Reddit, a couple of posts going semi-viral, and people sharing it around. At one point it even got picked up by 3 Telegram channels with over 2M subscribers , which brought a huge wave of new users. Some takeaways so far  Free plan matters more than you think. People want to try without limits before committing.  Subscriptions are a dealbreaker for something like wallpapers. One-time payment works much better.  Distribution beats everything. You can have the nicest product but unless you share it in the right spots, no one finds it. This is still very early but Im curious how far I can push it. I didnt expect a project I made in my room to turn into thousands in revenue in such a short time. Makes me think the ceiling is way higher than I thought."
  },
  {
    "title": "I am a lazyfck so i am building this",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz5lg6/i_am_a_lazyfck_so_i_am_building_this/",
    "content": "I keep downloading fitness apps and never using them. tried everything - myfitnesspal, nike training, all of them. download, use twice, delete. so im building something different. app tracks your actual workouts using your phone camera (works offline, no cloud bs). when you skip workouts it roasts you. when you try to open instagram or tiktok it makes you do pushups first. ( i have integrated like 28 exercises) still early but the camera tracking works pretty well. reps get counted automatically and it knows if you are cheating, will also detect bad posture etc. Curios to see your comments, roasting etc. If you want to get involved in this project, please dm me."
  },
  {
    "title": "Just launched my first SaaS (Supereddit) – completely free 🚀",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz4ebz/just_launched_my_first_saas_supereddit_completely/",
    "content": "Supereddit is an all-in-one Reddit OS for founders & marketers. It helps you: Auto-post & schedule content Discover subreddits with an AI recommender Track keywords & brand mentions across Reddit Manage everything from a single dashboard Its free for everyone right now. Would love feedback from this community .... what features would make this more useful for you?"
  },
  {
    "title": "Took me 2 months but got the collaboration feature done!",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz1fx0/took_me_2_months_but_got_the_collaboration/",
    "content": "Hey guys so I've made this free app where you can store your websites, social media posts and online content together in one space, rather than keeping all your bookmarks on like 10 different platforms. And I've just got the collaboration feature with live updates done, so you can now store and share everything with your friends too! So you can use it as a shared information hub to store Tweets, youtube videos, websites, Instagram posts, tiktoks, blogs etc, to plan together for a trip or just to keep content organised together across platforms. Again, free to use, and if interested, here's a demo on how the collaboration feature works, and here's the App Store , Play Store and web app links too if you want to check it out!"
  },
  {
    "title": "After 20 Years as a Developer, Here’s What AI Taught Me While Building My Projects",
    "link": "https://www.reddit.com/r/SideProject/comments/1mysjix/after_20_years_as_a_developer_heres_what_ai/",
    "content": "Ive been coding for about 20 years, and for the past year Ive been building most of my projects with AI. Honestly, AI has given me a massive productivity boost, taught me tons of new things, and yeah sometimes its been a real headache too  I thought Id share some lessons from my own experience. Maybe theyll save you some time (and stress) if youre starting to build with AI.  Early Lessons Dont ask for too much at once. One of my biggest mistakes: dumping a giant list of tasks into a single prompt. The output is usually messy and inconsistent. Break it down into small steps and validate each one. You still have to lead. AI is creative, but youre the developer. Use your experience to guide the direction. Ask for a spec first. Instead of just code it, I often start by having AI write a short feature spec. Saves a lot of mistakes later.  Code & File Management The same file in multiple windows = can be painful. Ive lost hours because I had the same file open in different editors, restored something, and overwrote changes. Commit and push often. Watch for giant files. AI loves to dump everything into one 2000+ line file. Every now and then, tell it to split things up, create new classes in new files and keep responsibilities small. Use variables for names/domains. If you hardcode your app name or domain everywhere, youll regret it when you need to change them. Put them in a config from the start.  Working with Chats Going back to old chats is risky. If you reopen a conversation from a few days ago and add new requests, sometimes it wipes out the context (or overwrites everything done since then). For new topics, start a new chat. Long chats get sluggish. As threads grow, responses slow down and errors creep in. I ask for a quick summary of changes so far, copy that, and continue fresh in a new chat. Much faster. Try different models. Sometimes one model stalls on a problem, and another handles it instantly. Dont lock yourself to a single tool.  Safety & Databases Never just run it. A careless SQL command can accidentally delete all your data. Always review before execution. Show AI your DB schema. Download your structure and let AI suggest improvements or highlight redundant tables. Sometimes I even paste a single tables CREATE statement at the bottom of my prompt as a little P.S. , surprisingly effective. Backups are life-saving. Regular backups saved me more than once. Code goes to GitHub; DB I back up with my own scripts or manual exports. Ask for security/optimization checks. Every so often, Ill say do a quick security + performance review. Its caught things I missed.  When Youre Stuck When I hit a wall, Ill ask AI to list possible steps. I dont just follow blindly, but it gives me a clear map to make the final call myself. And if things really start going sideways, dont wait too long, restart from scratch, get the small steps right first, and then move forward.  Wrap-up For me, AI has been the biggest accelerator Ive seen in 20 years of development. But its also something you need to handle carefully. I like to think of it as a super-fast medior developer : insanely productive, but if you dont keep an eye on it, it can still cause problems  Curious what others have learned too :) EDIT  A couple more things I forgot earlier:  If Im starting a bigger project , I sometimes kick it off with a system like Lovable, Rork, or Bolt to get the structure in place, then continue on GitHub with Cursor AI. This workflow has worked well for me so far , less cost, faster iteration, and minimal setup.  Sometimes I even ask AI : If I had to make you redo what you just did, what exact prompt would you want from me? Then I restart fresh with that   In Cursor I also upload extra context when needed , a screenshot, a code snippet, or even a JSON file. It really helps guide the AI and speeds things up. And if something still cant be solved in Cursor, I restart in Max Mode. It often produces smarter and more comprehensive solutions. Then of course I switch back to Auto Mode so I dont burn through all my tokens  Every now and then I ask the AI to  explain the whole system to me from scratch . It works as a memory refresh both for myself and for the AI. I sometimes copy-paste this summary at the beginning of new chats and continue from there.  One of the most effective ways to spot errors and keep track of the system is simple console log tracking . Just copy-paste the errors you see into the chat , even without extra explanation, AI understands and immediately starts working on a fix."
  },
  {
    "title": "I just crossed $500 MRR and it feels like everything just changed",
    "link": "https://www.reddit.com/r/SideProject/comments/1mykb9d/i_just_crossed_500_mrr_and_it_feels_like/",
    "content": "For the past 2 years Ive been building in silence for a while now. Watching others launch, scroll-building late into the night, dreaming but not shipping. 2 months ago, I finally launched my tool. Its called Tydal( https://www.tydal.co ) and its a Reddit marketing tool that helps people get customers. I expected crickets. But something happened that has blown my mind. Heres what happened in the past 2 months: 670 total signups 29 paid users 13.5K website visitors Total revenue: $714 Its not life-changing money. But to me, its proof. Proof that strangers care.Proof that something I made can bring in real users.Proof that Im not wasting my time. Still early. Still messy. Still learning.But Im not stopping. Current goal: $1000 MRRLets see how far this goes."
  },
  {
    "title": "My website just crossed 600+ active users this week!",
    "link": "https://www.reddit.com/r/SideProject/comments/1myt5dx/my_website_just_crossed_600_active_users_this_week/",
    "content": "Happy to share: My website just crossed 600+ active users this week! Grateful for all the support and excited to keep growing."
  },
  {
    "title": "How do you actually FINISH your side projects? I keep jumping to the next shiny thing.",
    "link": "https://www.reddit.com/r/SideProject/comments/1myvz35/how_do_you_actually_finish_your_side_projects_i/",
    "content": "I have the worst habit of starting a project, getting halfway through, and then switching to something new that seems more exciting. I love the start of a project but never get to the finish line. Looking for any practical tips that actually work."
  },
  {
    "title": "I made an app to preview social media assets",
    "link": "https://www.reddit.com/r/SideProject/comments/1myxwb4/i_made_an_app_to_preview_social_media_assets/",
    "content": "Hello! I made an app that helps you preview social media assets. Originally I made one for Linkedin only to help my partner serve her clients at her ghostwriting agency. And few months later I hired a designer for one of my clients and noticed that we have no way to preview assets before actually publishing them, something the designer brought up so I decided to facebook and instagram. I would appreciate some feedback. It's free for now: https://sopree.app/ Thanks!"
  },
  {
    "title": "Can't be more proud, 7 new users in just one day ❤️",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz6zpy/cant_be_more_proud_7_new_users_in_just_one_day/",
    "content": "Well I'm very happy, BeeNet the open source perplexity alternative just got released yesterday and there's 7 users using it. BeeNet built on top of Langgraph and Copilotkit \"For bidirectional state updates\", BeeNet can plan, search and it's very powerful to understand and get results with the possible minimum credits. BeeNet allow you to use your own preferred model, easy installation and doesn't require any investment to run it locally. BeeNet is now still in testing, you can use it totally for free on https://bee4chat.online/ If you got any features in mind just DM me and I will make sure to add them, the repo will be available on GitHub soon, thank you again you really made my day"
  },
  {
    "title": "I finished my first project: the adrenaline of seeing a thought turn into reality.",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz3kmm/i_finished_my_first_project_the_adrenaline_of/",
    "content": "About a year ago, after a close friend moved away, I got back into letter writing as a simple but meaningful way to stay in touch. That gave me the idea to build a service where people can exchange letters with strangers around the world. The system matches users randomly and anonymously, so you can share thoughts, stories, or just whats on your mind without the pressure of instant replies. Its a slower, more personal way to connect. I built the project in my spare time, and now it feels ready to share with others who might enjoy it too: it's called Silent Ink"
  },
  {
    "title": "It's really not much...but I made a game in a weekend and published it to Android. Happy to just \"finish\" something.",
    "link": "https://www.reddit.com/r/SideProject/comments/1myzu59/its_really_not_muchbut_i_made_a_game_in_a_weekend/",
    "content": ""
  },
  {
    "title": "Today my platform hit 100k users!🥳 (after 1 year of launch)",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz3ad0/today_my_platform_hit_100k_users_after_1_year_of/",
    "content": "it's a place where people team up around startup ideas."
  },
  {
    "title": "I’m thinking I will name a keyboard design after ‘Mantis’ in my on going Smart iPhone keyboard project!",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz2xto/im_thinking_i_will_name_a_keyboard_design_after/",
    "content": "I dont know where it came from but its been hours since its all over my Mac screen"
  },
  {
    "title": "I am building a command hub for Windows — run and control everything from the keyboard",
    "link": "https://www.reddit.com/r/SideProject/comments/1myxlwx/i_am_building_a_command_hub_for_windows_run_and/",
    "content": "Needed something like this to do everything quickly just by using the keyboard. So I am building a small tool that acts like a command hub with powerful(programmable) shortcuts, fast search, and simple controls all in one place. With it, I can: Launch apps, files, or websites instantly Create workflows (open multiple things with a single hotkey) Control general system actions (Mic, audioSources, volume, brightness, shutdown, etc.) A better and more rapid search Stay fully in keyboard mode without reaching for the mouse Its free and made to just get out of your way. Still Building it but soon it will be the daily driver. Would love to hear your thoughts and advice If youd like to try it early or help shape the direction, Ive put up a waitlist here: [getriser.app] r/SideProject"
  },
  {
    "title": "My offline receipt scanner app just hit 19K downloads in 3 days and made its first $275",
    "link": "https://www.reddit.com/r/SideProject/comments/1myfym9/my_offline_receipt_scanner_app_just_hit_19k/",
    "content": "Hey folks, I launched a simple receipt scanning app called Receipto back in May  it was a chill weekend build, meant to work completely offline. No cloud, no fancy AI, just scan and organize receipts locally. I honestly forgot about it for a few months while focusing on another project. A while ago, I posted about Receipto here on Reddit, even though the app wasnt in the best shape back then. But I got some super helpful and constructive feedback from the community, which motivated me to improve it and push a much better version. Fast forward to last week: I won a free promo spot on Indie App Santa (shoutout to them), and as I was prepping for the launch, I dropped the price to free for a few hours. Somehow, AppRaven (and maybe AppAdvice, too?) picked it up. In just 3 days , Receipto hit 19,000 downloads , mostly from Asia. The promo ended, the price went back up, and people actually started subscribing. It made $275 , which is more than what my main app did recently  That gave me the push to properly update it  I added AI-powered scanning (OpenAI & Gemini), optional cloud sync, export/import, recurring transactions, and fixed a bunch of bugs. If youre building something and feel its not perfect yet  just ship it. Talk about it. Reddit helped me a lot.  Try it and give me your feedback : https://apps.apple.com/us/app/smart-receipt-app-receipto/id6745450337 Happy to answer any questions about what worked, what didnt, or anything related to the tech side."
  },
  {
    "title": "I built a tool to make picking a movie faster and would love feedback",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz0cps/i_built_a_tool_to_make_picking_a_movie_faster_and/",
    "content": "I realized that every movie night with my friends or family turned into half an hour of endless scrolling through Netflix, Disney, Prime and others. We would go back and forth between posters and lists and by the time we finally decided most of us were not in the mood anymore. That frustration made me build a tool called MovieLoop. Instead of browsing posters or long trailers you swipe through very short clips until you find a film that matches the vibe you want. Here is the link if you want to try it: https://movieloop.eu I would love to hear your thoughts from a startup perspective. Do you see this solving a real pain point or is it just a nice to have?"
  },
  {
    "title": "built this for my kids (and yours)",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz5w3y/built_this_for_my_kids_and_yours/",
    "content": "Built this because my 11yo kid was missing effective ways to practise for her exams. I made her flashcards and quizzes by hand like it was 1995. She sure learnt that way too, but that got me thinking that not every kid have parent with that much free time on their hands. So I started building what I wished existed: kid takes picture of geology notes about plate margins, gets immediate practise that expose gaps in understanding. The photo constraint isn't just better UX, it's the only way to get usable output from that age group. They don't understand prompting. They'd type \"make quiz plz\" and get confused when it asks for context. So point phone, get quiz. The app takes 44 steps (AI prompting, context explanation, output formatting) and makes it one step (point camera). Consistent format, calibrated difficulty, no hallucinated facts. Kids 10-15 get the worst deal in edtech, even when this is the age when learning habits actually form. They are too advanced for baby apps, too young for adult tools. They get gamification theater instead: points, streaks, engagement mechanics that feel good but teach nothing. I stripped all that out. Photo determines content, AI determines difficulty, testing reveals gaps. No escape routes. Also, no ads, no trackers, no data selling. Photos stay on device. Making money from subscriptions, not from kids. Lexie is available on iOS lexielearn.com/app if you or your kids or your friends kids wanna test it out. Would really appreciate the feedback!"
  },
  {
    "title": "My friend and I created this",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz1ayk/my_friend_and_i_created_this/",
    "content": "Me and my friend created this new side project over the last couple weeks. Finally got a domain and released it today. It sort of works, a long way from done, but would appreciate any thoughts/feeback!"
  },
  {
    "title": "Title: Day 8 Build Update - Rheia",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz4jg0/title_day_8_build_update_rheia/",
    "content": "Quick update on Rheia, the AI agent builder Im building in public: Today we shipped Realtime. Runs now: Update status, output, errors, and timestamps instantly Stay reliable with dual redundancy (event bus + direct channels) Show polished UX with spinner, disabled button, retry flow Support Cmd/Ctrl + Enter shortcut for quick runs Deliverable: a fully polished realtime run experience. Next up: Supabase logs so Rheia remembers everything your agents do. Would you prefer logs inline in the run detail view, or a separate activity history tab?"
  },
  {
    "title": "I'm Building a Beautiful, Aesthetic, Free and Open-source Platform for Learning Japanese",
    "link": "https://www.reddit.com/r/SideProject/comments/1my60lw/im_building_a_beautiful_aesthetic_free_and/",
    "content": "The idea is actually quite simple. As a Japanese learner and a coder, I've always wanted there to be an open-source, 100% free for learning Japanese, similar to Monkeytype in the typing community. Unfortunately, pretty much all language learning apps are closed-sourced and paid these days, and the ones that *are* free have unfortunately been abandoned. But of course, just creating yet another language learning app was not enough - there has to be a unique selling point. And then I thought? Why not make it crazy and do what no other language learning app *ever* did - add a gazillion different color themes and fonts, to really hit it home and honor the app's original inspiration, Monkeytype? And so I did. Now, I'm looking to find contributors and testers for the early stages of the app. Why? Because weebs and otakus deserve to have a 100% free, beautiful, quality language learning app too"
  },
  {
    "title": "I made Flagsy 🎌 – an offline world geography quiz game for iOS",
    "link": "https://www.reddit.com/r/SideProject/comments/1myvivh/i_made_flagsy_an_offline_world_geography_quiz/",
    "content": "Hi all  I built Flagsy , a world geography quiz app for iOS. The idea came from wanting something fun (and useful!) to play when traveling without internet.  Quiz modes for flags, countries, and capitals  100% offline  play anywhere, even on a plane   Keeps track of your progress so you can challenge yourself  A quick, fun way to brush up on geography Its on the App Store - https://apps.apple.com/us/app/flagsy-world-geography-quiz/id6737687944 Id love to hear your thoughts, and if you spot any bugs please let me know"
  },
  {
    "title": "Q: How to get 12 Android testers?",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz2llw/q_how_to_get_12_android_testers/",
    "content": "Hi everyone, I've been a webseveloper for the past 10 years, and am trying some new things (now AI can help out). I wanted to build a 100% offline localfirst (only actually) mobile app. I decided to go with Ionic Capacitor, Biometric Authenticagion, SQlite and Vue 3. It became a sophisticated habitat tracker app which is in internal testing phase and I'm quite happy with it (some improvments still need to be done). Now comes the bummer.. I just discovered I need 12 different testers testing my app for 14 consecutive days! Omg. How do others get them? I'm I solo dev and find it sort of awkward to ask close ones  Like to hear what others do to get this part done!"
  },
  {
    "title": "Permutify – free tool to create all accumulator/parlay combos from your match picks",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz24yp/permutify_free_tool_to_create_all/",
    "content": "I built Permutify, a free tool that enumerates all possible accumulator/parlay combinations from your match picks (win/draw/lose, BTTS, over/under, combos). You can try it here: https://permutify.com . l'd love your feedback and suggestions."
  },
  {
    "title": "My New Project that lets you create stunning AI-Powered custom invitations and story books in Minutes!",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz20t0/my_new_project_that_lets_you_create_stunning/",
    "content": "Hey everyone! I wanted to share a cool platform Ive been working with  CharmReads . Its an AI-powered invitation creator that lets you design wedding, birthday, corporate, and family event invites quickly and effortlessly. Just in starting stage. No designers, no waiting  just upload a photo or logo , and our AI crafts a beautiful, personalized invitation in minutes. Perfect for personal celebrations or professional events! Check out some examples and get inspired here: Instagram"
  },
  {
    "title": "I'm Rob, failed at 5 SaaS attempts in 2 years, then built my 6th in stealth for 6 months. Added $1k MRR in 24 hours on launch day. Currently at $3.5k MRR (AMA)",
    "link": "https://www.reddit.com/r/SaaS/comments/1mq3pt1/im_rob_failed_at_5_saas_attempts_in_2_years_then/",
    "content": "Hello fellow SaaS builders. My names Rob & I just added $1k MRR in 24 hours after 5 failed attempts. A couple weeks ago was launch day for my 6th SaaS attempt. After building in stealth for 6 months, I went from $1,600 to $2,500+ MRR in a single day. I started my SaaS journey 2 years ago. Failed 5 times. Lost money, time, and almost my sanity. But with attempt #6 I did a few things differently. First off, I faced the pain-point myself. Every SaaS \"guru\" preaches build in public, launch fast, get feedback. But launching broken products never worked for me. Too much noise, too many opinions, too much damage to first impressions. So I tried something different. My secrets to a successful launch day: Building in Stealth: I still posted publicly, but kept the product private until it was ready. Posted screenshots asking \"who wants to try this?\" - no product links DMed interested people to join private beta Got 30 paying users before anyone knew what I was building Their brutal feedback made the product 10x better Built hype so launch day went that much better Launch Day Momentum: When you finally launch, ride the wave HARD. Posted a curry selfie celebrating 26 trials  50,000 views Screenshot PostHog analytics  20,000 views Screenshot Lemon Squeezy dashboard  10,000 views Every win becomes content that drives more wins Why Photos Matter: Text gets lost in the AI slop on X. But by showing you are a real human being with a real story, you stop and grab peoples attention. People root for underdogs (probably you) Authenticity beats polished marketing (especially in AI era) The Numbers Game: 70 free trials in 24 hours 50% trial conversion rate (industry average is 15-20%) 200,000+ views on X in 24hrs 95% of traffic from organic X posts Over 6 months of private beta, I built to $1,600 MRR. Then added $1,000 more in 24 hours. A couple weeks on, Im at $4,500+ MRR with another 150 trials pending. Ask me anything about: Failing 5 times and what I learned Building in \"stealth\" while still posting publicly Getting 30 people to pay for a private beta Launch day execution Why posting a picture of me eating a curry converted more users than anything else Goal is $10k MRR well before the end of the year. After 5 failures, it finally feels possible. Happy to share specific tactics, screenshots, or just commiserate about the SaaS grind :) Let's gooo! (I'll be sticking around most of the day to answer questions. And I'll try my best to answer any asked even after today, so don't hesitate to leave your question!) EDIT: This was a lot of fun, thanks so much for asking all of your questions - there were some really great ones! I'll have to bookmark this myself so I can come back and re-read my answers, since I dropped most of my brain in here today haha. Catch you all next time or on X (hopefully past $10k MRR)! :D"
  },
  {
    "title": "Weekly Feedback Post - SaaS Products, Ideas, Companies",
    "link": "https://www.reddit.com/r/SaaS/comments/1l8ppgx/weekly_feedback_post_saas_products_ideas_companies/",
    "content": "This is a weekly post where you're free to post your SaaS ideas, products, companies etc. that need feedback. Here, people who are willing to share feedback are going to join conversations. Posts asking for feedback outside this weekly one will be removed!  P.S: Check out The Usual SaaSpects, this subreddit's podcast!"
  },
  {
    "title": "A friend of mine closed a $72K deal… from a LinkedIn like 😳",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz0zok/a_friend_of_mine_closed_a_72k_deal_from_a/",
    "content": "A good friend of mine who's been in B2B sales for over 20 years recently shared something with me that completely shifted how I see prospecting and outreach. He didnt get a reply. He didnt have a meeting booked. There was no introduction or referral. Just a single like from a prospect on one of his LinkedIn posts. That was it. From that tiny moment of engagement, one that most salespeople would ignore, he ended up closing a $72,000 deal. What struck me wasnt just the outcome, but the way he explained the process. Hes no longer chasing people with cold DMs or relying on generic filters to build lists. Instead, hes paying attention to what he calls dynamic social signals. Little behaviors that indicate interest, curiosity, or intent, even if theyre subtle. He looks for signs like someone viewing his LinkedIn profile. Liking a competitors post. Following someone in his space. Commenting on a post related to the problem his product solves. Attending an event. Engaging in a niche discussion. To most people, those dont feel like leads. But to him, theyre the start of a conversation. When someone interacts with something even loosely related to his offer, he uses that as context to send a thoughtful message. Not a pitch. Not an automated sequence. Just a relevant piece of content, a short insight, or a question tailored to what the prospect showed interest in. He told me about a VP who viewed his profile after reading a post about ROI in telecom. Instead of pitching right away, he connected with that person and then 3 days later dropped a short message with a case study on how his product increased ROI for a similar client. The VP replied the same day. In another case, a director liked a post by an influencer talking about a problem his product solves. He followed up with a simple value-first message offering help, no strings attached. That turned into a call the same week. This method gives him four times more replies, four times more acceptance, and over 90 percent of people who respond are actually qualified. Its a simple formula. High intent plus perfect timing equals real conversations that convert. This kind of sales isnt loud. Its not spammy, based on listening, not chasing. And it works ! Good luck. Romn (building gojiberry.ai )"
  },
  {
    "title": "\"Listen to your users\" is terrible advice, and it's killing your product.",
    "link": "https://www.reddit.com/r/SaaS/comments/1myv0mx/listen_to_your_users_is_terrible_advice_and_its/",
    "content": "Ive built enough SaaS products for clients to know that this is probably the most misunderstood piece of advice in the entire industry. It sounds right. It feels right. And it leads more teams down the wrong path than almost anything else. I know, it sounds like heresy. But let me explain. Every client I work with has a backlog full of feature requests straight from their users. \"We need a dark mode.\" \"Can you add a CSV export button?\" \"We want more dashboard widgets.\" The impulse is always the same: \"Our users are asking for this, so we have to build it.\" And so they do. They build the dark mode, the export button, the extra widgets. And nothing changes. Engagement doesn't go up. Churn doesn't go down. The product just gets more bloated and harder to maintain. Here's the problem nobody talks about: Users are experts at their problems, but they are terrible at designing solutions. When a user asks for a feature, what they're really doing is describing a symptom and guessing at the cure. Your job isn't to be a short-order cook and build whatever they ask for. Your job is to be a doctor and diagnose the underlying disease. I had a client whose users were constantly asking for a \"better way to export data.\" They were convinced they needed more formats, more options, more filters. We spent weeks going back and forth on the design. Finally, I got on the phone with five of those users and asked a simple question: \"What do you do with the data right after you export it?\" Four of them said they manually clean it up and import it into QuickBooks. The problem wasn't the export feature. The problem was they couldn't get their financial data into their accounting software. The real solution wasn't a better export button; it was a native QuickBooks integration. We built that instead, and it became their single biggest driver of upgrades. Here's the framework I use now that saves my clients from themselves: Treat every feature request as a starting point, not an endpoint. The request is the beginning of your investigation, not the conclusion. Always ask \"why\" five times. \"Why do you need a CSV export?\" \"So I can get my data out.\" \"Why do you need to get your data out?\" \"So I can put it in another system.\" \"Why do you need it in that system?\" You get the idea. Watch what they do, not just what they say. Session recordings are gold. You'll often see users struggling with a workflow they can't even articulate properly. Solve the problem, not the request. A user asking for a faster horse doesn't actually want a faster horse. They want to get from point A to point B more quickly. The solution might be a car. I'm not saying you should ignore your users. You absolutely should listen to their problems, their frustrations, and their goals. But the moment you start letting them design your product roadmap, you've already lost. You're the product expert. They're the user expert. Your job is to translate their pain into an elegant solution. Stop taking orders and start diagnosing. Your product will be a thousand times better for it. End of rant. Edit: Damn, this post blew up! If you're struggling with feature bloat or need help building an MVP that actually solves real problems, I'm taking on new clients. Hit me up if you want to cut through the noise and build something people actually need."
  },
  {
    "title": "AI is destroying the SaaS industry",
    "link": "https://www.reddit.com/r/SaaS/comments/1myyw39/ai_is_destroying_the_saas_industry/",
    "content": "Every single day I see more proof that AI is completely changing how fast products get built. A friend told me about someone who took an existing SaaS product and rebuilt most of the core features in just one weekend using AI tools. I read about another guy who launched a Chrome extension in 24 hours, and it actually made it to the front page of Product Hunt. There are stories about small teams cloning full YC startup products just for practice, sometimes even adding a little twist and putting it live the same week. This used to sound impossible. Before AI you needed months of planning, a dev team, and funding just to get something usable. Now one person with no budget can sit down, use AI to generate code, use another AI for UI design, and have a working product in less than a week. Hosting is free, domains are cheap, and marketing is just posting online. The cost of failure is basically zero so people do not even care if an idea fails anymore. They just try again and again until something sticks. The scary part is not just speed. It is that ideas no longer feel safe. If I can make something today, there is nothing stopping ten other people from rebuilding the same thing tomorrow, polishing it a little more, and pushing it with better marketing. Even established companies with money and teams can clone and launch something at insane speed. Execution speed is becoming more important than originality itself. To see how real this is I decided to test it myself. In just 2 days I built an MVP with AI guidance. It is live right now. It reduces heavy manual compliance work for firms and anonymizes data before AI processes it so privacy stays protected. I did this with zero budget, just AI and free hosting, and it actually works. This made me stop and think. If an MVP like this can be built in 2 days, what is the point of spending months building something from scratch. Are products even safe anymore when AI has lowered the barrier this much. Maybe the real challenge is not building but getting attention fast enough before someone else copies the idea. I do not know the answer but it feels like we have entered a new era where speed and distribution beat almost everything else."
  },
  {
    "title": "Enough is enough – it’s time to quit (my honest opinion)",
    "link": "https://www.reddit.com/r/SaaS/comments/1myrowj/enough_is_enough_its_time_to_quit_my_honest/",
    "content": "Absolutely zero moderation! Today Ive read the last massively exaggerated fake post that I can bear. $0 to $12k in 2 Weeks was a personal favourite BS tale that I trudged through recently. Its getting absurd! The issue is that as a founder, I really love SaaS as a subject. The intricacies of the business model are one of my favourite things to discuss and unfortunately theyre not exactly subjects to discuss socially at a party. Which is why this Sub is important! But recently, this Sub has just eroded into a flood of absurd stories - one after another - with zero evidence that it is going to slow down! Clearly the hustle bros have worked out that the narrative of vibe coding + TikTok can be turned into a semi-believable story that can hook a SaaS newbie in. The problem is that anyone who is  in it  or  has done it  knows exactly how difficult SaaS actually is and as a result - sees straight through this garbage. Not every problem requires a just market more - bro answer. - MVP types - Pricing strategies - Product market fit - Sales - Retention mechanisms - Design - Scaling systems Etc etc, all of these are roadblocks that founders deal with on a DAILY basis and it is clear that the only place that these problems can be discussed communally (here) is (and has been) failing for a while now. So this morning I made this community for anyone that is as passionate about this subject as I am. This community only costs me $9 to host every month - which is a BARGAIN if it means that I can chat freely with people that prefer actual discussion instead of having to spend half-an-hour - sifting through posts for sneaky sales tactics every day. Feel free to join if you feel the same way as I do! :) It will always be free and for the purposes of community / discussion ONLY ! (No self promotion / fake story BS will be tolerated) If you disagree and think that what I am saying is incorrect and that this sub is suitable for mainstream SaaS discussion - please let me know below! I'd like to hear your argument because I just can't see it."
  },
  {
    "title": "Emegence of VaaS & MCP",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz4vos/emegence_of_vaas_mcp/",
    "content": "We just launch a new IaaS to help builders playing with AI agent to have an agentic way to change their IP. We call it VaaS . VPN as a Service. It's free and opensource."
  },
  {
    "title": "I’ve Spent 4 Years Doing SEO for Clients - Here’s a Free Directory List and Checklist for Fellow SaaS Founders",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz3jh7/ive_spent_4_years_doing_seo_for_clients_heres_a/",
    "content": "When I launched my first SaaS, I thought content marketing would solve all my problems. I wrote 10 blog posts and waited, but nothing happened. It wasn't until I started submitting my site to directories and launchpads that I saw real progress. In just three weeks, my Domain Rating (DR) increased from 0 to 6, and I attracted over 1,000 targeted visitors all before writing a single blog post. Frustrated but determined, I compiled all my client SEO notes into a Notion document that includes:  A list of the Top 100 Directories (covering SaaS, Tech, AI, and B2B)  My exact submission checklist  Common mistakes that can ruin your submissions  A few niche-specific bonus sites I discovered buried in backlink reports These are the same strategies I used for clients who paid $1,500+ per month. This isnt just generic advice; its actionable tactics that helped early-stage SaaS companies gain visibility without having to wait six months. If youre struggling to get any traffic or youre tired of doing SEO the hard way, this could be just what you need. Drop a comment with \"directory\" or \"SEO list,\" and Ill send you the full Notion document."
  },
  {
    "title": "The LinkedIn Client Acquisition Method That Actually Works (17 demos in 5 days)",
    "link": "https://www.reddit.com/r/SaaS/comments/1myvfd2/the_linkedin_client_acquisition_method_that/",
    "content": "Hello everyone I just completed a LinkedIn outreach experiment for my SAAS that yielded impressive results: 50%+ acceptance rate and 60% response rate from connections. Here's exactly how I did it. Step 1: Find Your Ideal Prospects Target people who would genuinely benefit from your service. For example, lets say youre aiming at marketers, but this works across industries. The LinkedIn Events strategy: Go to LinkedIn search and type your target industry (marketing) Click on the Events tab Find large events with 10k+ attendees Click Attend Browse the attendee list to identify potential prospects Pro filtering tips : Prioritize younger professionals, who are often more open to trying new tools Step 2: Send Strategic Connection Requests Always use desktop. It lets you add a personalized note, which improves acceptance rates. Keep the message short and simple. Example: Hey [Name], saw we were both in the [industry] space, would love to connect. Best, [Your Name] Step 3: Build Rapport Before Pitching Dont pitch right after someone accepts. Wait. Sometimes theyll even reply first. The next day: Check if they posted recently Like their post and leave a thoughtful comment Make it meaningful (avoid Great post) Step 4: Craft Your Outreach Message Use the problem-first approach. Structure it like this: Greet and reference the connection Mention your app briefly with 1-2 features Ask about their daily challenges Offer value, such as early access, free trial, or a discount Example: Hi [Name], thanks for connecting! Im working on [brief app description]. Im always looking to make it more valuable for [their role]. Whats something you struggle with day-to-day that you wish there was a better solution for? Your insights would be very helpful, and Id love to offer early access if it could help. Step 5: Handle Responses Perfect match: Theyre interested, and your app fits their need Feature opportunity: Theyre not a fit now, but their feedback gives you valuable insights No response/not interested: It happens. This approach still outperforms most others Bonus: Optimize Your Profile Use a clear, professional-looking photo (doesnt need a studio shoot) Write a strong headline and About section that explain what you do Make it easy for prospects to understand your expertise and story Have a website in your bio so prospects can book calls without talking to you Key Takeaways : Quality over quantity: Target the right people Build relationships first: Engage before pitching Focus on problems: Lead with their challenges, not your features Be patient: Genuine outreach takes time Stay authentic: People respond better to real conversations than to polished scripts This system has consistently delivered better results than any other outreach method Ive tried. While no approach works 100% of the time, focusing on relationships and problem-solving creates connections that often turn into long-term business. You can do this 100% manually or automate it at scale. Good luck ! Romn from gojiberry.AI"
  },
  {
    "title": "The best explainer video I’ve seen this year did 3 things differently.",
    "link": "https://www.reddit.com/r/SaaS/comments/1myzdrg/the_best_explainer_video_ive_seen_this_year_did_3/",
    "content": "We recently made a SaaS explainer video that outperformed every previous one on metrics: 2.4x longer average watch time 30% higher conversions from landing page What changed? We showed real product UI , not just illustrations The script started with a relatable pain point , not a feature dump The pacing was tight and clear  under 90 seconds Ive made 1000+ videos for SaaS and tech companies, and these 3 levers consistently outperform everything else. If youre working on your own explainer or landing video, Im happy to review it or break down what might work best for your niche. Drop a link or comment what you're building  Ill reply with real feedback Lets make your product pitch unforgettable."
  },
  {
    "title": "Looking for beta testers for Reddit AI agent for SaaS projects",
    "link": "https://www.reddit.com/r/SaaS/comments/1mypc4g/looking_for_beta_testers_for_reddit_ai_agent_for/",
    "content": "Ive been working on an agent that might be useful if youre in the early stages of building. Its called the AI & SaaS Leads Reddit Hunter, basically an automated market research analyst that scans key Reddit communities and pulls out real business opportunities from live conversations. How it works: You describe a problem area youre interested in  the agent scans curated subreddits  it runs a two-stage AI analysis (pain points  strategic synthesis)  then delivers an actionable report in Markdown + Google Sheets, complete with trends, pain points, and opportunity mapping. Currently opening free beta testing. If youre actively working on SaaS projects and want early access codes, drop a comment below and Ill send them your way. Would love to get feedback from the community before launch."
  },
  {
    "title": "Your competitors are stealing customers",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz61x3/your_competitors_are_stealing_customers/",
    "content": "Last week I found a thread where someone was asking about alternatives to our product. Three competitors had already commented helpful responses. The person chose one of them. This happens constantly. People are online right now asking for exactly what you sell. And if you're not there to answer, your competitors are. I started tracking this. We miss 5-10 posts per day where people mention problems we solve. Most already have competitor responses within 2 hours. These aren't cold leads. These are people literally asking what tool they should use. They have budget. They have the problem. They're ready to buy today. But they'll never find you because you weren't in the conversation. Your competitors know this. The smart ones have systems to monitor and respond fast. They're not necessarily better than you. They're just present when it matters. You can have the best product and perfect pricing. None of it matters if you're not there when someone's asking for you. I'm curious how others handle this problem. Do you have alerts set up or just randomly check communities when you have time."
  },
  {
    "title": "What Are You Building Currently?",
    "link": "https://www.reddit.com/r/SaaS/comments/1myx731/what_are_you_building_currently/",
    "content": "Im currently working on automation tool and would love to hear what others are building as well. Let's connect together. Twitter/X Automatic Posting Tool Go to my site  Login via X  Write once (Any topic posts you want to expand on your Twitter)  Start auto-post  My tool will generate tweets based on your Input (Easy right?)  Timer runs (towards zero)  Tweet posts on X (automatically)  Cycle repeats (automatically)  Posts on X grow non-stop while you are busy vacationing or sleeping. If youre interested, feel free to DM me and I will send out early invites to join as one of the f irst beta testers. FYI : You can check content on @ MoodTalesAI for the non-stop posting."
  },
  {
    "title": "Buy a domain in early stage?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz720b/buy_a_domain_in_early_stage/",
    "content": "Guys, I need your opinion: Would you blow $10-$20 on a custom domain in the beginning, when you only have a landing page, or would you stick to the free one in vercel for example? Because of your startup falls or you lose interest you would lose those $10-$20 Whats your opinion?"
  },
  {
    "title": "Just launched my first SaaS (SupeReddit) – FREE",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz44fu/just_launched_my_first_saas_supereddit_free/",
    "content": "Ive been building something to make Reddit a proper growth channel for founders & marketers, and I just launched it today. Its called SupeReddit  an all-in-one Reddit OS. Heres what it does: Auto-posting & scheduling AI subreddit recommender Client dashboards & analytics Its 100% free . If you use Reddit for growth, Id love your feedback and ideas on how to make this even better."
  },
  {
    "title": "I officially have an MVP!",
    "link": "https://www.reddit.com/r/SaaS/comments/1mywngy/i_officially_have_an_mvp/",
    "content": "It took a month from concept to launching next week. Im just so happy I wanted to share. I work in retail full time so its been challenging finding time to learn this and make it a reality. After weeks of late night grinding I can final say I did it! Just wanted to share the joy"
  },
  {
    "title": "What are you building this sunday? Get feedback.",
    "link": "https://www.reddit.com/r/SaaS/comments/1mysw6s/what_are_you_building_this_sunday_get_feedback/",
    "content": "What are you building this sunday? I'll go through the comments and give feedback. Here's mine - Earn $2000+ a month training AI agents and selling specialised datasets to AI companies, for extremely rare specialised datasets (like medical field expertise) you could earn tens of thousands and get lifetime royalties. Here's a link for the waitlist - https://quantumverse.cloud"
  },
  {
    "title": "What are you building😏😏😏",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz1zvl/what_are_you_building/",
    "content": "An AI Growth Engine that helps your community before you even ask with daily challenges that boost engagement, retention, reactivation and revenue up to 5x."
  },
  {
    "title": "If someone gave you $10k today, what crazy project would you try?”",
    "link": "https://www.reddit.com/r/SaaS/comments/1mys3qo/if_someone_gave_you_10k_today_what_crazy_project/",
    "content": "Serious question: if $10,000 landed in your lap todayno strings attachedwhat wild business or side project would you throw it into? Would you try flipping something online? Open a tiny coffee cart? Build an app? Or just YOLO into crypto and hope for the moon?  Im curious what people would actually risk it on. Drop your ideas below  and upvote the most creative ones. Who knows maybe someone here will actually make it happen."
  },
  {
    "title": "How you guys are validating your idea before starting??",
    "link": "https://www.reddit.com/r/SaaS/comments/1myyw4m/how_you_guys_are_validating_your_idea_before/",
    "content": "I read lot of posts here in reddit and I'm a new user here.every post tells I built this and that and I got interested about sass and business but nobody tells how they validated their ideas.i sometimes think i got idea and when I check Ai platforms like chatgpt,Perplexity and grok.it says your idea is good and you have similar ideas in market and all.do everyone validating you ideas like that ??.I want honest opinion"
  },
  {
    "title": "every “vibe-coded” app that I’ve seen make real money has almost always been rebuilt with software engineers writing actual code.. prove me wrong",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz4cci/every_vibecoded_app_that_ive_seen_make_real_money/",
    "content": ""
  },
  {
    "title": "Sorry to break it to you… but building isn’t the big thing. Marketing is.",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz0rop/sorry_to_break_it_to_you_but_building_isnt_the/",
    "content": "Everyones busy chasing the perfect product. Truth is, building isnt the hard part. Marketing is. Heres the proof: I saw a guy launch a simple site where you add text behind an image. Thats it. Nothing new. Free versions already exist everywhere. But he slapped a new name on it, shared it smartly, and built a brand around it. - Made $250 in his first month - Picked up 8K followers on X Meanwhile, dozens of better free tools are out there collecting dust. People rarely dig deeper. They go with whats marketed well and easy to find. So heres the real lesson: dont just build. Market the hell out of it. If youre stuck on that part, I can help. Just a DM away."
  },
  {
    "title": "One-time payment or monthly subscription – which would you choose as a user?",
    "link": "https://www.reddit.com/r/SaaS/comments/1myy2of/onetime_payment_or_monthly_subscription_which/",
    "content": "While experimenting with pricing for my AI platform, I realized most people dont want yet another monthly subscription. ChatGPT costs $20/month (thats $240/year). I decided to offer a $59 lifetime plan  unlimited access, all future upgrades included, and ChatGPT 5 will be live soon. My question to the community: as a user, what gives you more confidence  paying monthly with the risk of price increases, or paying once and knowing youre covered forever?"
  },
  {
    "title": "You are all saying different things",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz3327/you_are_all_saying_different_things/",
    "content": "Someone is saying validate first someone else is saying don't. Someone is saying certain way is bad someone else is saying good. It all makes me think about free will and stuff. We all read what everyone else is saying but we do what we would do anyways as if we did not read at all. So maybe we are all programmed to follow what we know is the best. Anyways, Let's just keep doing what we do, because what else would we do?"
  },
  {
    "title": "Experiences using Gumroad for Micro-SaaS?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz28a2/experiences_using_gumroad_for_microsaas/",
    "content": "Hey everyone, Im currently building a small micro-SaaS project and considering using Gumroad as my payment provider instead of Stripe or Paddle. I like the idea of handling one-time payments or subscriptions without setting up a complex backend. Im curious:  Has anyone used Gumroad for a micro-SaaS long-term?  How well does it handle subscriptions (cancellations, renewals, reminder emails, etc.)?  How do fees and payouts compare to Stripe/Paddle?  Any issues with refunds, taxes, or support?  Would you still recommend Gumroad in 2025, or go straight for something more professional? Id love to hear honest experiences, lessons learned, or things youd do differently when starting out. Thanks in advance!"
  },
  {
    "title": "Launched my 1st SaaS Ytorganize.com",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz265q/launched_my_1st_saas_ytorganizecom/",
    "content": "After a lot of ups & downs, Im finally launching ytorganize.com  https://ytorganize.com/ Tired of saving YouTube videos to Watch Later & never finding them? With YTorganize you can: 1.Add notes & timestamps under the video 2.Set reminders 3.Import your playlists from YT in 1 click & more!"
  },
  {
    "title": "Building a Self-Hosted CRM – One-Time Investment, No 3rd Party, Full Data Ownership",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz22hb/building_a_selfhosted_crm_onetime_investment_no/",
    "content": "Hey everyone, Im working on building a self-hosted CRM solution designed for organizations that want: Full control of their data (no third-party platforms involved) No recurring per-user costs (just a one-time setup/investment) Secure, private, and tailored to your organizations needs Scalable for teams without paying extra memberships for every new user The goal is to let companies keep their CRM data within their own infrastructure , without depending on external SaaS platforms that lock you into subscriptions. Id love to connect with people who are interested in: Exploring a one-time cost CRM alternative Avoiding vendor lock-in and hidden costs Having peace of mind about data privacy and security If this sounds interesting to you (or your organization), drop a comment or DM me  Id love to chat and share more details!"
  },
  {
    "title": "What do you do as a Solopreneur?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz6csd/what_do_you_do_as_a_solopreneur/",
    "content": "There are various types of solopreneur / self employed. What do you do? Is it consulting/ one person small business / YouTuber? I am a w2 worker & itching to work for myself. Thanks"
  },
  {
    "title": "I just realised that this subreddit was started in 2014, what was it like to be a solopreneur in 2014?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myt4fb/i_just_realised_that_this_subreddit_was_started/",
    "content": "A lot must have changed, what are the biggest differences? Could you share your story in 2-3 sentences? Would love to see interesting stories, and I will share mine first. Used to be a VC backed founder with near $10m funding, business didn't take off, and the team went down to just myself forcing me to do most things on my own. Then I launched a few software and e-commerce projects in the past 6 months, and about to reach the point that the profits cover my expenses. What is your story? and what are the differences between now and then?"
  },
  {
    "title": "why no one knowing you is your biggest advantage (for small businesses and creators)",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myyy4s/why_no_one_knowing_you_is_your_biggest_advantage/",
    "content": "You might think you need more experience, better brand recognition, and more trust in your business to succeed. These big businesses seem to own a monopoly and have complete control over the market. What do you have, as an underdog no one knows, that can beat these bigger and better businesses? Underdogs have freedom to experiment - You arent big enough for people to care about you. This means you can test and fail in the shadows while these businesses are stuck in the spotlight. Underdogs move fast - Big businesses have teams, meetings, and budgets to approve. However, you can test, change, and implement your ideas within hours. Underdogs are authentic - There isnt a team of managers and employees working under you. Its just you. And you can give a personalized experience to your customers unlike your competitors who think of them as just a number. Underdogs are never satisfied - They work harder to build their business and support their customers. People love underdogs so frame your business as an underdog working harder than other big and lifeless corporations. By embracing your disadvantages, you seem like a trustworthy brand, and it emphasizes your strengths that the big competitors don't have. If you liked this post, check out my email newsletter for more actionable advice like this on business mindset and entrepreneurship."
  },
  {
    "title": "The Best Free Tools for Mockups & Wireframes in 2025 – Essential Picks for Every Designer",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz7482/the_best_free_tools_for_mockups_wireframes_in/",
    "content": "Why are mockups and wireframes important? They offer clear visual communication for your ideas, making it easy to collaborate with stakeholders. These tools facilitate user experience testing and early feedback, letting you refine designs before development starts. They save time and resources by enabling quick adjustments during the planning stage. What features should you look for? Ease of use: An intuitive interface lets you design quickly. Collaboration: Tools that allow team sharing and co-editing are vital. Pre-built templates: These save time and spark inspiration. Export options: Look for tools that allow exporting in various formats (PNG, PDF, etc.). Integration: Seamless connection to other project management or design tools is a plus. Here are the top free options in 2025: Figma Web-based, vector editing, and real-time collaboration. Extensive plugin library & responsive design. Easy for individuals and small teams (free tier); some advanced features are paid. Wireframe.cc Minimalistic, drag and drop focus with limited color palette for distraction free wireframes. Super user friendly, no signup required. Fewer features than full scale tools, great for quick sketches. Moqups Comprehensive template/component library, collaboration, and integrates with Google Drive/Slack. Basic free plan, modern interface. Limited export options on the free tier. Balsamiq Wireframes Low fidelity, sketch style interface with drag and drop components. Great for rapid prototyping and easy team feedback. Free version is a trial; limited features. InVision Freehand Online whiteboard for collaborative brainstorming with infinite canvas. Free with unlimited boards; integrates with other InVision tools. Focused more on freeform ideation than structured wireframing. Sketch (Free Trial) MacOS only, offers professional mockups with vector editing and plugin support. Free trial (limited period); powerful but not available on Windows/Linux. Each tool serves different needs, whether you're prioritizing collaboration, simplicity, or full-featured design. Try them out to see which one fits your workflow best streamlining your design process, communicating better with stakeholders, and saving valuable development time. Full article and details here: https://blog.mvplaunchpad.agency/the-best-free-tools-for-mockups-wireframes/"
  },
  {
    "title": "Building alone is making me question if I'm an introvert or just really bad at asking for help (probably both)",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz5sww/building_alone_is_making_me_question_if_im_an/",
    "content": "Ok so this is gonna sound weird but building TuBoost solo for 18 days has made me realize I might not actually be an introvert... I might just be terrible at asking people for help lol Like I'll spend 6 hours debugging something that probably has a 2-minute solution if I just asked someone who's done it before. But instead of reaching out I'm googling random Stack Overflow posts from 2015 and hoping they apply to my specific edge case  The solo founder thing is so contradictory too... like you need to be comfortable working alone but also constantly networking and talking to users. Some days I love the independence, other days I'm staring at my laptop wondering if I'm slowly going insane from lack of human interaction. Had this moment yesterday where I was stuck on a payment processing bug and spent HOURS trying different solutions. Finally posted in a Discord server and got the answer in 10 minutes. Made me realize how much time I waste being stubborn about figuring everything out myself. But also asking for help feels vulnerable? Like admitting you don't know something means admitting you might not be qualified to build this thing. Impostor syndrome but make it entrepreneurial lol. The building in public thing helps because at least I feel connected to other builders even if we're all struggling separately. But it's still weird to share progress with strangers online while avoiding asking friends and family for actual advice. Customer support has been the biggest eye-opener though... like I'll spend days building features I think people want instead of just asking my existing 35 users what they actually need. Social anxiety disguised as product development strategy  Anyone else deal with this? Like being comfortable with the technical challenges but weird about the human parts of building a business? The networking advice everyone gives feels impossible when you're naturally conflict-avoidant and overthink every interaction. \"Just reach out to potential customers!\" Ok but what if they think I'm annoying?? Weirdest part is I'm fine posting vulnerable updates on Reddit but terrified to send a cold email to someone who might actually use my product. The internet makes no sense. How do you push through the social discomfort of entrepreneurship when your natural instinct is to hide behind your computer and hope customers find you organically? Also is it normal to feel lonely while simultaneously avoiding opportunities to connect with people? Because that's definitely my current vibe and it seems counterproductive lol. The solo thing is both my biggest strength and weakness... love the independence but maybe I'd be further along if I actually talked to humans more often"
  },
  {
    "title": "Everyone's adding AI to everything and I'm over here trying to make basic features that don't crash (feeling like I'm missing something obvious)",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myzfc3/everyones_adding_ai_to_everything_and_im_over/",
    "content": "Duuude the AI hype is making me feel like I'm living in a different universe... everyone's building \"AI-powered this\" and \"machine learning that\" while I'm over here celebrating that my file upload form works in Safari lmao Like I see posts about \"AI revolutionizing X industry\" and \"GPT wrapper makes $100k MRR\" and I'm just trying to build TuBoost.io without the payment processing breaking when someone uses an apostrophe in their name  Don't get me wrong, my app uses AI for video processing and it's genuinely useful. But 90% of my work is boring shit like database optimization, error handling, and figuring out why the mobile UI looks like garbage on older phones. Meanwhile everyone's raising millions for \"AI agents that do your laundry\" or whatever and I'm wondering if I'm completely missing the boat by focusing on... actually making stuff work? The pressure to be \"AI-first\" is insane though. Like I'll describe TuBoost as \"video processing tool\" and people are like \"cool story bro\" but if I say \"AI-powered content optimization platform\" suddenly everyone's interested. Same exact product, different buzzwords. Had this conversation with another founder who was like \"you should add ChatGPT integration to everything\" and I'm thinking... my users just want their videos to process without errors, they don't need AI to write their video descriptions lol But also what if I'm wrong? What if I should be building chatbots and AI assistants instead of solving actual workflow problems? The FOMO is real and I keep second-guessing whether I'm building the right thing. The funny part is most \"AI startups\" I've seen are just regular software with GPT API calls sprinkled on top. Like we're all using the same OpenAI models but some people are better at marketing it as revolutionary. Anyone else feeling this pressure to AI-ify everything even when it doesn't make sense? Or am I just being stubborn by focusing on core functionality over trendy features? Honestly starting to think the real skill isn't building AI, it's knowing when NOT to use AI and just solve problems with boring reliable technology. But also maybe I'm just coping because I don't understand transformers and everyone else is secretly building AGI while I'm here debugging form validation  What's your take? Are we in an AI bubble or am I missing something fundamental about where software is heading?"
  },
  {
    "title": "Built something to simplify client management. Just curious what tools you're using to stay sane",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myvq4h/built_something_to_simplify_client_management/",
    "content": "Hi all, so in reality, I used to feel trapped in admin hell: juggling client messages, invoices, proposals, and project deadlines, every single tool felt like it added more confusion, not less. It felt endless. So, I started building Retainr.io , a lightweight platform that helps you package your services, onboard clients with a single link, and automate recurring tasks, all under your own white-label portal. Im most proud of how it helped me regain control over my time and actually deliver work without drowning in notifications. What tools or workflows help you stay sane while managing clients solo? Whats saved your mental energy lately?"
  },
  {
    "title": "Show me your SaaS - I’ll actually try it & give real feedback!",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz0lv0/show_me_your_saas_ill_actually_try_it_give_real/",
    "content": ""
  },
  {
    "title": "Do you charge clients by the hour?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myzv56/do_you_charge_clients_by_the_hour/",
    "content": "I use to keep track of how many hours I worked for people by using my iPhone app or excel sheets I tried the apps that were out there. Toggl was pretty solid but when I started the timer, I would forget to stop it, if I did remember, I would forget later what and who the timer was for - it got messy, So I created my own little app, added a picture in picture window for the timer, added a long running timer warning and some other small things that you almost cant go wrong with I then added in everything I do daily so I dont need to jump around to other apps. Its awesome and neat now What solution did you create to help an actual issue you had?"
  },
  {
    "title": "For those trying AI or no-code tools — what’s been the most frustrating part?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myu72b/for_those_trying_ai_or_nocode_tools_whats_been/",
    "content": ""
  },
  {
    "title": "Just wanted to know how much u r willing to pay for 30 post creation a month? I am planning something similar kind of business so asking for knowledge",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mywgwv/just_wanted_to_know_how_much_u_r_willing_to_pay/",
    "content": ""
  },
  {
    "title": "From $0, Burnout & Quitting Job… to $1M MRR (Real Timeline) no fluff",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myp77n/from_0_burnout_quitting_job_to_1m_mrr_real/",
    "content": ""
  },
  {
    "title": "Most people should NOT start a business",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1my2418/most_people_should_not_start_a_business/",
    "content": "I know this wont be a popular take, but hear me out. Not everyone is built for running their own business. Its full of uncertainty. Its lonely. And you will be tested in ways you couldnt imagine. Youll have to figure out how to create a good product. Youll have to figure out sales and marketing. Youll have to figure out how to manage finances and all the legal stuff. And much more. Honestly, its a brutal way to make a living. To pull through, you have to be obsessed with either creating a great product or making a lot of money, ideally both. But for the few that are ready for the challenge, I have good news. Overcoming the difficulties of running your own business will give you a lot of freedom and make you very capable. Its hands down the best training ground for self improvement. I went all in on this path 1.5 years ago and its been the most rewarding thing in my life. I have my SaaS now that is about to hit $10k/mo and Ive learned so much. So for most people: keep your job and just build projects on the side. You probably dont want all the stress. For the few that are ready for it, youre in for a hell of an adventure."
  },
  {
    "title": "A little burnt out and could use some perspective...",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myl3wv/a_little_burnt_out_and_could_use_some_perspective/",
    "content": "Alright, can we talk for a second group? I've been grinding for weeks, creating a suite of digital products that I am genuinely proud of. I know they solve real problems. But I'm stuck in the new business loop: I need those first few sales to get reviews and build trust... but I need trust to get the first few sales. Honestly, the temptation to just rage quit is very real today. So I wanted to ask the founders in here who have successfully pushed through this phase: How did you break that cycle? What was the breakthrough that got you your very first sale and that first crucial testimonial? Not looking for a magic bullet, just some perspective from those who have been on the other side of this... Thanks for letting me vent."
  },
  {
    "title": "What topics would you love to see covered in a blog for solopreneur?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myp0r1/what_topics_would_you_love_to_see_covered_in_a/",
    "content": "Hey everyone! Im starting a blog focused on the solopreneur journey. Before I go too far, Id love to hear from this community: What challenges, stories, or resources would you be most interested in reading about? Whats missing from existing content out there? Your input would help shape the blog so its actually useful for solo founders like us. Thanks!"
  },
  {
    "title": "Paid offer launch",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mymepq/paid_offer_launch/",
    "content": ""
  },
  {
    "title": "Marketing as an introvert is literal hell: how I went from hiding behind my laptop to getting 35 signups (and still wanting to disappear)",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1my0jc6/marketing_as_an_introvert_is_literal_hell_how_i/",
    "content": "Duuude the marketing side of building my saas is absolutely destroying my soul and I need to vent somewhere... Like I can code all day no problem. Building features? Love it. Fixing bugs? Sure. But then I have to actually TELL people about what I built and suddenly I want to crawl into a hole and disappear forever The stuff that's been working (barely): Reddit comments where I actually help people then casually mention my tool Twitter building in public (posting daily even when I feel stupid) Cold emails to YouTubers (95% ignore rate but the 5% who respond are gold) The stuff that makes me want to die: TikTok videos (I look and sound like a robot) \"Networking\" on LinkedIn (feels so fake and gross) Promoting in Discord servers (always worried I'm being spammy) What's weird is when I force myself to be vulnerable and share struggles, people actually respond? Like my posts about failing and being confused get way more engagement than polished \"look at my cool feature\" content. But every single post feels like performing in a play where I don't know my lines. I'll write something, delete it, rewrite it 5 times, then post it and immediately regret it lol. The crazy part is it's actually working though? 35 signups, $700 revenue, 5 people interested in sponsor program. All from forcing myself to be uncomfortably public about everything. Still feels like I'm cosplaying as an entrepreneur while having constant anxiety about whether people think I'm annoying or fake. Anyone else deal with this? Like how do you market your stuff when self-promotion makes you physically uncomfortable? The whole \"just put yourself out there\" advice is useless when \"out there\" feels like standing naked in Times Square lol. What's the least painful marketing strategy you've found? Because I'm running out of ways to procrastinate on promotion"
  },
  {
    "title": "10 Low-Budget Ways to Market Your App",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myd3pv/10_lowbudget_ways_to_market_your_app/",
    "content": "Share regular updates and valuable content on Facebook, Instagram, Twitter, and LinkedIn. ( no social media is right or wrong, use everything, post everywhere initially) Build a Landing Page Create a dedicated landing page that clearly explains your apps value, showcases screenshots or demo videos, and features a strong call-to-action (CTA) App Store Optimization (ASO) Boost visibility by including researched keywords in your app title and description. Write a compelling description, and add high-quality visuals, attractive app icons and screenshots make a huge difference. Reach a broader audience by collaborating with niche influencers. Provide them free access to your app for honest reviews or set up engaging giveaways to attract attention. Establish authority and build your audience with blog posts, video tutorials highlighting app features, and shareable infographics that explain what sets your app apart. Grow your email list by offering incentives such as free eBooks or exclusive content. Segment your audience to tailor your messages, and send regular updates on app features, tips, and news. Join relevant subreddits, Facebook Groups, Quora, and niche forums. Engage in discussions, answer questions, and share your expertise to organically promote your app. Start small with Google Ads or Facebook Ads, targeting specific demographics. Submit your app to various app review sites for additional exposure. Showcase your app with live demos or webinars. Pick topics that resonate with your audience, promote the event through social media and email, and interact with attendees via Q&A sessions. Prompt users for feedback after positive experiences, set up referral programs with incentives, and always respond to user reviews to build trust and loyalty. Start implementing these tactics and watch your app soar! Read the full article for more details: https://blog.mvplaunchpad.agency/10-low-budget-ways-to-market-your-app/"
  },
  {
    "title": "How do I learn the non technical side of building a SaaS?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mybtl0/how_do_i_learn_the_non_technical_side_of_building/",
    "content": ""
  },
  {
    "title": "Canny prices are skyrocketing and I am thinking to leave it for a cost saving alternative",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mxz00p/canny_prices_are_skyrocketing_and_i_am_thinking/",
    "content": "Hi folks, Quick question for all you product owners, indie devs and startups out there: Would you be down to try a tool for gathering and managing product feedback thats basically like Canny (you know, the one with voting boards, roadmaps, user segmentation, integrations, etc.) but 70% cheaper? I know there some alternatives of canny in the market, but still they are charging only 5-10% less than Canny. Im talking serious savings without skimping on the core features that make feedback loops actually useful. Ive been using Canny for my side project and love it, but damn, the pricing adds up quick. If something popped up thats got 70% of the bells and whistles at a fraction of the cost, Id jump on it in a heartbeat. What about you? Would price be the deal-breaker, or are there specific features youd need that might make you stick with the big names? Curious to hear your thoughts, upvote if this sounds intriguing, and drop a comment if youve got recs or experiences! Thanks"
  },
  {
    "title": "From daily posting to $20K/month 📈",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1myc9es/from_daily_posting_to_20kmonth/",
    "content": "The journey was simple: post, repeat, adjust, and post again. This solo creator focused on short-form videos with trending sounds and niche topics. It wasnt glamorous  but stacking small wins turned into something big. As the audience grew, brands saw value in long-term deals. What started as a side hustle slowly became a $20K/month business.  Behind the scenes, many rely on tools like Crescitaly to support that consistency."
  },
  {
    "title": "How many Americans run businesses with zero employees",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mxc0zr/how_many_americans_run_businesses_with_zero/",
    "content": "The latest data I could find says that 27 million Americans are essentially solopreneurs. That's about 80% of all small business in the country. That's a pretty new phenomenon in the grand scheme of things. From 2000 to 2021, the number of solopreneurs increased by 72%. People say this is for all kinds of reasons, like the rise of the gig economy, remote work, and a growing desire for flexible work arrangements. I've got more stats, but I'm really just interested to hear from you all about whether you feel like this is real on the ground."
  },
  {
    "title": "A perplexity alternative but open source",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mxudf7/a_perplexity_alternative_but_open_source/",
    "content": "Hi everyone, I was one of perplexity users for a while and to be honest at the beginning it was just perfect, but in the last few months they started to charge more for just integrating new models where tbh I see that they have the same performance. So I decided to see an alternative, searching probably for an open source on github but I didn't find anything so that's why I have decided to build an open source one so if you're interested leave a comment I will share it with you"
  },
  {
    "title": "Building a GIF Maker app in solo in 6 months.",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mxeois/building_a_gif_maker_app_in_solo_in_6_months/",
    "content": "As the title says, I'm building a GIF Maker app solo in 6 months. Documenting the journey here."
  },
  {
    "title": "What's your GTM tech stack?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mx5bad/whats_your_gtm_tech_stack/",
    "content": "Mapping out my GTM is overwhelming in itself, but throw in all the tech choices available and I feel like I'm in crazy town! Since I'm bootstrapping, I want to be scrappy, and I'm curious to see what other founders are using. What are you using for prospecting and lead acquisition? For nurturing and automation? CRM and deal pipeline? Attribution and onboarding? Cold outreach and sales dashboard? Bonus if you're also building a subscription-based SaaS."
  },
  {
    "title": "[4.99$ to FREE for 48H] PDFForge - PDF Scanner & Edit",
    "link": "https://www.reddit.com/r/apps/comments/1mzdl6p/499_to_free_for_48h_pdfforge_pdf_scanner_edit/",
    "content": "Hello! Just updated, 10 additional languages added, let me know hows the localization. I built this app as a solo indie dev to give people a powerful yet simple way to scan, edit, and manage PDFs  without subscriptions, clutter, or data tracking. To celebrate the bigger update, Im running a promo  grab the Pro version for FREE for the next 2 days!  Why PDFForge?  High-Quality Scans  Capture sharp documents with smart edge detection  Bulk Scanning  Scan multiple pages at once  perfect for notes, receipts, or multi-page files  Full Editing Toolkit  Reorder, rotate, duplicate, or delete pages with ease  Annotations & Signatures  Highlight, underline, add text, or sign directly in the app  Smart OCR Recognition  Convert scans into editable, searchable text instantly  iCloud Sync  Keep your PDFs accessible and updated across all your Apple devices  Privacy First  Clean interface & zero data tracking What Im Looking For: Feedback on usability, design, or missing features Suggestions for improvements or pain points Thoughts on how it compares to other PDF apps  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Every bit of feedback means the world to me as a solo indie dev  thanks for helping me improve PDFForge !"
  },
  {
    "title": "Apps like the AI Personality Discovery app Dimensional?",
    "link": "https://www.reddit.com/r/apps/comments/1mzcjr2/apps_like_the_ai_personality_discovery_app/",
    "content": "I downloaded dimensional a few weeks ago and I LOVE the personality tests and learning things about myself, but 70% of the content and tests are locked under a yearly 59.99 subscription"
  },
  {
    "title": "I built an app to help your pet to live longer - and it’s totally free 🐾",
    "link": "https://www.reddit.com/r/apps/comments/1mzbmx7/i_built_an_app_to_help_your_pet_to_live_longer/",
    "content": "Ive always believed that pets arent just animals. Theyre family. But caring for them can get overwhelming  vet visits, meds, vaccines, weight tracking, and more. So I built Fidos Bark, a free iOS app to keep your pets health organized in one beautifully simple app. Features include:  Track meds, vet visits, and appointments  Share updates with pet sitters, family, or the vet  Add notes and photos  Track multiple pets in one place The app is free and live now if youd like to try it: https://apps.apple.com/app/id6744088514 If you try it out and have recommendations for features youd like to see please let me know. Thanks in advance!"
  },
  {
    "title": "Focus/habit tracker app",
    "link": "https://www.reddit.com/r/apps/comments/1mz8der/focushabit_tracker_app/",
    "content": "Do you know apps accessible on ios that help you track habits? An app that shows a circle diagram, and has a function to record time and not just count down time. Preferably aesthetic and easy to use. And an app thats free, if possible The closest I got to these criteria are YPT and iHour. However, YPT does not include a circular diagram displaying time spent, while iHour doesn't have a time record option. I really wanna use an app to keep track of things and to yk see how im spending time. I've tried tons of apps but most often they weren't free or could only keep track of around 5 habits. I'd love to find an app where I dont feel like checking in as a chore. Because thats what most often happens and I either end up not doing anything (just to not open the app and search through the options then start the timer, etc) or I just dont use the app"
  },
  {
    "title": "Any app that lets you bulk create reels where a title and video changes but it has the same end screen?",
    "link": "https://www.reddit.com/r/apps/comments/1mz81n7/any_app_that_lets_you_bulk_create_reels_where_a/",
    "content": "I tried using canvas bulk create feature which could have been great but it doesnt work with different videos just images so any ideas where i can rapidly do this? For now im using capcut but is very time consuming when i have to edit more than 20 reels Thanks"
  },
  {
    "title": "PSA: Wix is absolutely terrible and I'm losing my mind",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzbhmj/psa_wix_is_absolutely_terrible_and_im_losing_my/",
    "content": "Okay so... I genuinely hate Wix so much. Like, I know I haven't used many website editors and I get that this is supposed to be for beginners but holy shit this has been the most frustrating thing I've ever had to do. I genuinely wish I never started this. Like if I had to make a website builder, this would literally be my perfect example of what NOT to do. Nothing is consistent!! It'll constantly make random changes - like cropping my logo differently every single time for no reason?? And stuff just isn't where it would make logical sense to put it. The editor is just... it's so poor. And then - AND THEN - all they do is try to get you to use their premium bullshit. I'm trying to do something simple and they're constantly trying to sell me these \"premium services\" that their website can supposedly provide. It's absolutely mind-boggling. Look, I haven't used any other website builders, but if I hadn't already spent so much time trying to push through this nightmare, I would tell everyone: DO NOT use Wix. Do literally anything else. I genuinely just came here to post this because I've spent the last WEEK trying to get this website to look halfway decent and I'm just losing my mind. Like why is everything so inconsistent?? Why does it keep changing things I already set up??? Anyway... needed to vent. If anyone has better alternatives please let me know because I'm about ready to throw my computer out the window."
  },
  {
    "title": "After 2 years of solo development, my product is ready to launch. Now I'm completely frozen with anxiety and doubt.",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz7qca/after_2_years_of_solo_development_my_product_is/",
    "content": "Hey everyone, I've been a long-time lurker here, and now I'm finally at a point where I could post... but I'm honestly struggling to even hit the submit button. For the last two years, every single day, I've been working on creating a massive, detailed OSCE (Objective Structured Clinical Examination) course for medical/healthcare students. We're talking hundreds of hours, countless cases, detailed mark schemes  the works. It's been my entire life. The website is built. The content is uploaded. The payment gateway is set up. It's literally ready to go. I planned the launch for this week. And now... I'm completely frozen. It's like all the motivation and drive I had has vanished and been replaced with sheer terror. -What if no one buys it? -What if it's not as good as I thought it was? -What if I get negative reviews? -What if I've just wasted two years of my life? My anxiety is through the roof, and I'm cycling between feeling numb and feeling a deep sense of depression. The self-doubt is overwhelming. The thought of actually promoting it makes me feel physically ill. I guess I'm just looking to see if any other solo founders or entrepreneurs have hit this exact wall right at the finish line. How did you get past the paralysis and just hit \"go\"? Any advice or even just some solidarity would mean the world right now. Thanks for listening."
  },
  {
    "title": "Where to get the money to acquire inventory for big purchase order?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzdsqx/where_to_get_the_money_to_acquire_inventory_for/",
    "content": "Maybe I have forgotten something somewhere along the way. Let's say that a large brick and mortar takes interest in carrying my products. Let's say they want 50,000 units. That could be like $200k just to get those units to the retailer.... What is a financial institution going to want to see to give a loan for that much??? I hear that a retailer probably won't pay for the actual purchase order for 3-4 months after getting the product. I wouldn't have $200k even in a 401k to use on a loan or such. Can I tell the retailer that I won't sell 50,000 units to them and I need them to start with like 10,000 units or something? I'm just an average income guy right now working a job and doing my business stuff on the side. What method did some of you all use when a large purchase order came along? Thanks8"
  },
  {
    "title": "forfeit a customer’s deposit if they never proceed",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mz8m3o/forfeit_a_customers_deposit_if_they_never_proceed/",
    "content": "Hi all, I run a small custom jersey business for almost 2 years. I will ask customers pay an amount for deposit to see the design before confirming their order. If they proceed, The amount is deducted from the final bill. If they dont, its supposed to be non-refundable. Heres the situation: Some customers pay the deposit but then disappearred without confirming their order. I don't feel like the deposits hanging in my records forever, because it looks like an unpaid liability. My initial thought forfeit the deposit after a period. But is it proper (and reasonable) to forfeit the deposit after a period of no action? For other small business owners: how do you handle this? Do you forfeit deposits after a time limit, or let them stay valid forever?"
  },
  {
    "title": "If you had a software engineer, what would you get them to build for your business",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzg1or/if_you_had_a_software_engineer_what_would_you_get/",
    "content": "Curious to see how people would use them. I have a friend who wants to help me but I dont know how he could help"
  },
  {
    "title": "Social media/ reels",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzf1qp/social_media_reels/",
    "content": "I honestly hate social media but Im a small business looking to grow & I know I just need to do it & figure it out. I have no aesthetic & thats the ultimate problem, I dont know how to make my page look cohesive & cute. Any tips that can be offered on how to do this? Maybe an online course? An app to make reels? Idk Im open to all the help I can get."
  },
  {
    "title": "Urgently need advice on how to decide shipping prices upfront",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzejre/urgently_need_advice_on_how_to_decide_shipping/",
    "content": "Hey everyone, I just launched my spices business and am getting orders from banglore, Mumbai, Delhi, etc. Its getting really hectic as I dont have a proper shipping in place and I'm relying on shiprocket. The issue is how do I decide shipping prices? It keeps varying according to states, (understandable), but how do I tell the customer upfront? Right now I'm literally manually entering the to and from address and trying to find out the rates and I then inform the customer. Help me out guys, Im in a desperate need of advice. This question might be a little dumb but I've never done anything like this so I'm anxious af lol. I also lost 2 customers because of SHIPPING issues, makes me wanna cry so pls help guys!"
  },
  {
    "title": "Anonymous Payments",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzehd6/anonymous_payments/",
    "content": "Im starting a completely legal business, but one in which discretion is necessary. Does anyone have any opinions on which payment methods are the best/easiest, but wont let them see my person info, or let me see theirs? Thanks!"
  },
  {
    "title": "We’re trying to take over with an app that brings a new excitement to this sport",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mze5pg/were_trying_to_take_over_with_an_app_that_brings/",
    "content": "Pickleball has always had this your uncle in New Balances plays it kind of reputation but the truth is, its exploding. Courts are packed, waitlists at clubs are insane, and people who swore theyd never touch a paddle are sneaking in games before work. Us 3 brothers thought: what if we made an app that actually makes pickleball feel cool ? Track your matches & see your rating move up/down Earn badges & bragging rights for how much youre playing. Build your crew and follow friends to see where theyre playing next. Earn money or rewards for playing. book courts This is how we will integrate with different products and businesses that we want to integrate this app with We just launched PKL and want honest feedback from people who dont already see themselves as pickleball die-hards. And be brutal  if it feels cringe, tell me. Can you track your matches easily What type of integrations does it need immediately What would get you to actually download & play with your friends? Were trying to take a sport that looks like a backyard hobby and flip it into a culture takeover. If you want to test it out and maybe roast it in the process  heres the link: PKL"
  },
  {
    "title": "How hard is it to start a solo consulting business with no consulting background?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzce9p/how_hard_is_it_to_start_a_solo_consulting/",
    "content": "Basically the title. I come from a very non traditional background and am working a job doing growth strategy for a restaurant chain. The job is good but I want to make some extra income on the side and also stay tapped into the startup ecosystem. I recently graduated from my MBA and gained many skills related to the field plus Ive done a lot of what a consultant does without actually working in a consulting role due to my past experience in startups. I want to know how difficult it would be to get clients for small consulting projects and what services are on demand right now to improve my chances of success in this. I understand this may be a somewhat vague post so Im happy to answer any questions but in short. Is finding solo consulting work with no consulting background feasible? I know this sub is more about small businesses but I thought this could be a good place to get advice on starting this side hustle which is a small business in itself and trying to work with other small or growing businesses"
  },
  {
    "title": "Trouble opening a business bank account",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzcbc5/trouble_opening_a_business_bank_account/",
    "content": "Hi everyone! I registered my llc through northwest and also opted for the non P.O. Box mail forwarding service they provide for $20/mo. I got my EIN a few weeks ago using the address northwest provided (filed myself bc they wanted to charge $50 to fill in three lines of text a total scam if you ask me) and am now trying to open a checking account with Amex. I know local credit unions are better but my local credit union has a really bad rep and I also didnt want to use any finance apps like Mercury over a BANK bank if that makes sense. While filling out the application online it asks for the business address but says note you cannot use a P.O. Box, a commercial mail receiving agency (CMRA) or a registered agent. I understand the no P.O. Box thing but I dont understand why the other two arent allowed, is it just so they arent responsible if the CMRA company doesnt do their part and your mail gets lost it covers them legally or if I use the northwest mailing service address they will be within their rights to close my account down the line if they so choose? I dont need to lend any money I only need an account to keep the expenses separate for taxes and other stuff Im also not even getting any revenue and wont be for a while Im still working on a draft with a patent attorney for my future product. I was planning on just doing a capital contribution and use that money to buy stuff for prototypes because its made in house I need the materials and tools to make it Thank you for reading apologies for grammar"
  },
  {
    "title": "A Challenge Every Small Business Faces",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzbzzh/a_challenge_every_small_business_faces/",
    "content": "Hey everyone, I've been researching why small businesses struggle to get consistent customer reviews, and I discovered something interesting: timing is everything. Studies show that customer satisfaction peaks within the first 3 days after a service experience, but that's exactly when most businesses go silent. I'm developing a software to solve this timing gap. Instead of hoping customers remember to leave reviews weeks later, it automatically reaches out during that optimal window when they're most engaged and willing to share feedback. Some valuable insights I've uncovered that might help any business owners here: 72% of customers will leave a review if asked at the right time vs. only 15% who do it spontaneously Automated follow-up increases review volume by 200-300% on average The 3-7 day window has 4x higher response rates than requests sent after 2+ weeks Businesses with consistent review flow see 23% more foot traffic (according to BrightLocal's 2024 study) Quick validation question for business owners: What's your biggest challenge with getting customer feedback - is it timing, knowing who to ask, or something else entirely? I'm looking for a few business owners who'd be open to sharing their current review process challenges. Happy to share more research findings that might be helpful regardless of whether you're interested in the solution. Thanks for any insights you can share!"
  },
  {
    "title": "Starting a business through Jim’s franchises",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mzb7ej/starting_a_business_through_jims_franchises/",
    "content": "Hi, my partner and I want to start a small business together (each currently earn 55-68,000 annually, mortgage payment of $700 per fortnight). What are peoples thoughts/experiences on Jims Laundry and Jims Test and Tag?"
  },
  {
    "title": "How do I scale my staffing agency business?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mza9k6/how_do_i_scale_my_staffing_agency_business/",
    "content": "My biggest customer got bankrupt and took a whole lot of our profits. Now we either get more clients or close down and we are at a loss due to not getting paid by previous customer and now we are in over our head."
  },
  {
    "title": "How can I monetize my Facebook group",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mza2r7/how_can_i_monetize_my_facebook_group/",
    "content": "Hey folks, I run a Facebook group with about 8,500 members all focused on hair loss discussions . The group is pretty active, people share tips, treatments, products theyve tried, etc. Now Im wondering how do I actually monetize this?  Has anyone here successfully monetized a niche Facebook group? Whats the best strategy that keeps members engaged but also generates income? Would love to hear real experiences."
  },
  {
    "title": "I made a lift-the-flap book for adults.. yep.",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz9u4c/i_made_a_lifttheflap_book_for_adults_yep/",
    "content": ""
  },
  {
    "title": "The comments never help when I ask what movie a clip is from…so I built this",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzevl8/the_comments_never_help_when_i_ask_what_movie_a/",
    "content": "Movie clips online are tuff, but when I ask what movie a clip is from, the comments are full of trolls. Ive been building an app that identifies movies from short-form content in seconds. Built with Expo + Whisper.cpp via the Expo Modules API. Not finished yet, but aiming for TestFlight in ~2 weeks. DM me if youd like to try. Would love feedback on the idea or features!"
  },
  {
    "title": "I made a journal app that asks you one question a day for 30 days and shows you how you answered that same question previously to see how you've grown",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzazhc/i_made_a_journal_app_that_asks_you_one_question_a/",
    "content": "Hey guys, Ive been working on this app for a while now. I wanted to make something a little different from the usual journaling apps, instead of just giving you a blank page, I thought it would be better to ask the user 30 questions, one question everyday of the month. After the 30 days, the same questions repeat, but you get to see how you answered last time, allowing you to see how you've grown as a person over time. It's been fun building this and I think it makes journaling a lot more fun and a lot more meaningful. I would love to get some feedback on it so here it is"
  },
  {
    "title": "Starting a Business? Let Me Help for Free",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzcker/starting_a_business_let_me_help_for_free/",
    "content": "Ive spent over 10+ years in digital marketing and managed more than $10+ million in ad campaigns for top brands. Now Im working on my own, and I want to use my skills to help others get started. Heres what Im offering for free:  A custom WordPress website built just for you  Facebook and Google Ads setup and optimization  A marketing strategy to help you launch with confidence If youre a startup or small business trying to get off the ground and need expert support with zero upfront cost, Im here to help. Drop a comment or send me a DM if youre ready to start."
  },
  {
    "title": "Finally launched and got my 1st Paid Customer🥳🥳",
    "link": "https://www.reddit.com/r/SideProject/comments/1mze5hf/finally_launched_and_got_my_1st_paid_customer/",
    "content": "Just made $7.5, but Soon will reach $100M"
  },
  {
    "title": "I built the wrong thing, and I'm glad I did",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzd382/i_built_the_wrong_thing_and_im_glad_i_did/",
    "content": "When I started this project, I thought the pain point was simple: friends send me Spotify links, Im on Apple Music, and I cant play them. So I built a quick fix for single-song links. But after posting yesterday and reading replies, I realized something bigger: people care way more about converting entire playlists. That was eye-opening. Lesson learned: even if you solve your own problem, listen closely to how others respond. Sometimes the real opportunity shows up after you launch, not before. Im now working on playlist conversion (while my tool songhop.to handles single songs today). For anyone else building in public: dont get too attached to your first idea of the main problem. Let your users pull you in the right direction. Not the other way around."
  },
  {
    "title": "i built a chatbot agent builder that can be trained in seconds, cheap and fast",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzcdw1/i_built_a_chatbot_agent_builder_that_can_be/",
    "content": "https://asistbase.com - basically a cheap alternative in this niche, there's also a free plan if anyone wants to try. Very easy to setup on your business page, dm me if you need help with that!"
  },
  {
    "title": "I open-sourced my 100% free background remover (no limits, no signup) — full code + step-by-step guide",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzaipo/i_opensourced_my_100_free_background_remover_no/",
    "content": "Hey everyone! A little while ago I shared I made a 100% free tool to remove image backgrounds  no limits, no signup required! and a bunch of you liked the results. So I went ahead and wrote up everything, including the full code, in a detailed guide on Medium. Link to the guide: https://medium.com/@aziz_11785/how-to-remove-a-background-from-any-image-for-free-1c14e9ca2b8f Whats inside: Full Python code using U2Net (ONNX) + onnxruntime FastAPI endpoint that returns a transparent PNG Step-by-step setup (pip install, run, and test with curl/Postman) Tips for best results and ideas for integrating it into your workflow It runs locally, is totally free, and theres no signup or limits. If it helps you, an applause on Medium and a quick comment would mean a lot and helps more people find it. Also, Im open to feedback and feature ideasbatch processing, a simple web UI, etc. Thanks!"
  },
  {
    "title": "Quick update on the real-time voice changer",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzgdr6/quick_update_on_the_realtime_voice_changer/",
    "content": "Hey folks, Been a minute since the last post! My buddy and I got most of the core features done, but hit a pretty annoying roadblock. We trained a few voice models, data quality seems decent, but the output still sounds kinda raspy and the pitch wobbles. Lowkey driving us nuts ngl... we even double checked our gear wondering if somethings wrong with it  Turns out this is way more work than I thought (classic side project story lol). But were learning a ton, fix one thing, break another, repeat. Really hoping it all comes together in the end. Hoping to have something out soon! If anyones down to test an early build (Mac only right now) and share some feedback, just drop a comment or DM. Cheers! https://preview.redd.it/6nlfxwms83lf1.png?width=1394&format=png&auto=webp&s=5ea9dcdfa78d76ddd4d93b206587cf44b0387f7e"
  },
  {
    "title": "I built a tool that turns your website + FAQ into an on-site chat agent (embed-ready). Looking for feedback.",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz8jq1/i_built_a_tool_that_turns_your_website_faq_into/",
    "content": "Ive been building SiteAI Agent  point it at your site/FAQ, it trains in minutes, and you drop one JS snippet to embed. Im not sure about: Are answers good enough before adding more capabilities? What would stop you from trying it today? Demo: Chat Agent  Ill set up 3 free pilots this week and share results back here. If you want in, comment your site URL (or DM me if youd rather keep it private)."
  },
  {
    "title": "Working on a side project that I want to look technically better.",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzg6g4/working_on_a_side_project_that_i_want_to_look/",
    "content": "Hey, I'm RepublicDefender78 and I'm sort doing this thing. Years ago I had a job as a content creator but before Youtube. Back then I could only write copy. Since then I've gone pro in something else but have found myself really enjoying playing with stuff like clipchamp and obs. I also stumbled upon a game called Helldivers 2. As I have combined all this hobbies coupled with my concerns for my fellow man in general, I kind of grew a thing. I call it a podcast but it is exclusively on Youtube. I fancy it as my attempt at coming to terms with hiding in my house playing Helldivers when I'm not hiding in my house working. But, just like building a model I still want it to look like what I imagine. So I've been working with ChatGPT do make this informational webseries that doesn't hide that it's struggling to entertain and inform earnestly because no one asked. I could use some feedback. The most recent episode is a pretty significant change over previous episodes. Any thoughts would be greatly appreciated."
  },
  {
    "title": "Feedback on My First C++ Application",
    "link": "https://www.reddit.com/r/SideProject/comments/1mzg6a3/feedback_on_my_first_c_application/",
    "content": "https://preview.redd.it/t96mp0zo53lf1.png?width=1214&format=png&auto=webp&s=ecd0d3b8c0f881bfd5039cf0a80545a54be5f096 I recently started programming and was thinking about what kind of useful project I could build in C++. I decided to create a lightweight and efficient text editor, and I've been working on it. So far, it only has a few basic features and some of them are still buggy, but I finally managed to get it to compile successfully. Is this a good project for someone at my beginner level? Should I continue developing this text editor, or would it be better to move on to other projects? I have built the entire app with my own code and no outside libraries."
  },
  {
    "title": "any feedback on this ui/ux design? :)",
    "link": "https://www.reddit.com/r/SideProject/comments/1mz85il/any_feedback_on_this_uiux_design/",
    "content": "hi ya'll :) this is a mental health app i'm making - my only goal is to give users the most magical experience ever. i think it can re-shape and re-wire negative thoughts and really improve millions of peoples lives. every feature im building is based on years of research that i've personally read. the audience is really anyone that wants their thoughts to be 1% better. how does the ui/ux look? any things i may not be noticing that i should improve? any mainstream ux principles im breaking? all feedback is good feedback, pls share your thoughts :)"
  },
  {
    "title": "My solo project has 1900+ users in 2 weeks, but it's NSFW and I have a 3-month runway. What would you do?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz3hdj/my_solo_project_has_1900_users_in_2_weeks_but_its/",
    "content": "Hey everyone, I'm in a bit of a wild situation and could really use some perspective. I'm a regular 9-5 employee, and for the last 9 months, I've poured all my free time into building a SaaS project I'm passionate about. I launched two weeks ago, and it's grown way faster than I ever imagined  over 1900 users and even a few paying customers already. The problem is, the user activity is so high that my server costs are scaling just as fast. At this rate, I can only afford to keep it running for another 2-3 months. Heres the main challenge: its an NSFW SaaS-based product. I know this can be a major hurdle for traditional funding, and I have no idea how to approach paid marketing. I'm just trying to figure out the best path forward to keep this alive and growing without going broke. Has anyone here navigated the challenges of a fast-growing, bootstrapped project in a 'controversial' niche? I'm open to any and all suggestions on what one usually does here."
  },
  {
    "title": "How did you start building your first app?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzfsc8/how_did_you_start_building_your_first_app/",
    "content": ""
  },
  {
    "title": "We built “Fiverr for AI tools” people sign up but don’t use it. Why? (Feedback needed 🙏)",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzg33s/we_built_fiverr_for_ai_tools_people_sign_up_but/",
    "content": "Hey guys!  I just launched Quokkai.cloud . Were getting traffic and organic signups but so far, 0 conversions . Ive tested the registration flow multiple times (desktop + mobile) everything works: Register with Google Register with email + password Or email + magic link People do register, but then stop there . They dont try any of the AI gigs, even though free credits are available. So Id love your feedback: Is it unclear what Quokkai actually does? Do you find the platform difficult to use? Was it confusing what to do right after registering?  What is Quokkai? Think of it as Fiverr, but for AI models . Instead of learning prompts or switching between platforms, you just pick an AI Gig (image, video, audio, writing, marketing, etc.), adjust a few options, and get results. No subscriptions  pay only for what you use No learning curve  AI gigs are pre-prompted to deliver exactly whats shown Credits never expire  Which AI models are inside? Weve integrated 200+ AI gigs across: Visuals: Photon, BigColor, ImageGen4/3 (Google), Recraft, Flux, Quokkai Video: Kling, Seedance, Runway, Minimax, Luma (soon) Audio: Quokkai, Minimax (soon), Meta (soon), Sakemin (soon) Writing: Claude, Deepseek, OpenAI, Grok Marketing: Claude, Quokkai  Who is Quokkai for? Content creators & influencers who need assets fast Freelancers boosting productivity in design, writing, or marketing Startups & small businesses needing affordable, on-demand content Marketing teams who want easy access to multiple AI models without technical skills  How does pricing work? 1 USD = 1 credit Gigs range from $0.10  $30 Top-up packages: $10  $1,000 (with bonus credits starting $600+) No expiration  credits last until used New users get 12 free credits via the Welcome Gift Checklist  So, my main question: Why do you think people stop after signing up? Is it positioning? Onboarding? Or maybe the value prop isnt clear enough? Any feedback would really help"
  },
  {
    "title": "What was the first red flag of failure of your startup?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mz802u/what_was_the_first_red_flag_of_failure_of_your/",
    "content": "I'm wondering about how do you understood that your startup gonna fail? What was that point when you got your first signs of failure and did you did something to keep it alive? How it's been and what was wrong which led your startup to fail? Cause I think mine will..."
  },
  {
    "title": "Protecting a Unique SaaS Idea with Patents",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzcu36/protecting_a_unique_saas_idea_with_patents/",
    "content": "I am building a SaaS product with a mobile-first approach. I believe I am using a unique method for collecting user input and presenting data based on that input. I am considering filing a patent to prevent so-called two-day AI developers from cloning my idea. What type of patent would provide the right protection? Could you also share your experience with doing something similar?"
  },
  {
    "title": "Should I rely on AI to build a SaaS, or just hire a developer?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzeyhd/should_i_rely_on_ai_to_build_a_saas_or_just_hire/",
    "content": "Hey guys, Nowadays it feels like people can build almost anything with AI, just type a few prompts and boom, youve got an app or website/platform. But Ive also seen quite a few downsides of using AI to build SaaS products: things like spaghetti code, unoptimized performance, hidden bugs, and the fact that you cant fully rely on AI if youre thinking long-term. So Im wondering is it better to just hire a developer? For context: my coding knowledge is very minimal (basically just if/else and file directories which I get to learn it in uni, since I studied electrical engineering, not software). I dont know much about tech stacks. Ive heard people say that AI can be great for quickly building an MVP before getting a proper developer involved, or even using AI to do 90% of the work and then paying a developer to polish and complete it. What do you guys think? Should I stick with AI as a starter tool, or is it smarter to bring in a developer from the start?"
  },
  {
    "title": "i built a barebone chatbase alternative in 6 days, deploy AI agents with knowledge in 1 minute",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzdk1g/i_built_a_barebone_chatbase_alternative_in_6_days/",
    "content": "so i wanted to challenge myself and I bult a simple chatbase alternative Features so far: - knowledge based agent creation - scrape and crawl websites for knowledge - add files for knowledge - customization - playground testing - rate limits - domain lock so it works only on desired domains - custom agent instructions If anyone wants to try it out, it's cheaper than most also decent free plan if you're a small business https://asistbase.com Any feedback is appreciated"
  },
  {
    "title": "AI developer with skills, no ideas. What's a tedious task or daily frustration you wish an app could solve?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzdjxj/ai_developer_with_skills_no_ideas_whats_a_tedious/",
    "content": "Hey guys, I'm a software developer who builds apps using AI, and I'm looking for a new project that actually helps people. Instead of guessing what to build, I want to ask you directly: What's a recurring frustration, a tedious task, or a minor inconvenience you face all the time? For example A repetitive, mind-numbing task you wish you could automate. An information-overload problem (e.g., \"I wish I could summarize all these articles/emails/reports\"). A creative block you're struggling with. Something that just feels inefficient or clunky in your workflow. No idea is too small or too weird. What's a real-world problem you'd love to see solved by a smart app?"
  },
  {
    "title": "YoutubeScribe.com my latest tool",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzbuxh/youtubescribecom_my_latest_tool/",
    "content": "Thrilled to launch YouTubeScribe.com! Built with pure vibe coding flow  lightning-fast UI on Vercel v0  + powerful backend using Claude Sonnet 4 . Crazy how easy it was to go from idea  launch in no time. Youtube to text for FREE  If you liked it, do share with others. And if need any other feature use the feature request. VibeCoding #NewRelease #AItools #StartupLaunch #IndieDev http://youtubescribe.com"
  },
  {
    "title": "Looking for a developer to build a website and integrate AI",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzb5hq/looking_for_a_developer_to_build_a_website_and/",
    "content": "Hello everyone I am building a project to launch a website for selling automation scripts for business processes. The key idea is that the website should be fully self-sustaining without manual content management. What needs to be implemented 1. A system where scripts are automatically generated by AI and published directly on the website 2. An order system that collects client requests and preferences automatically 3. An AI assistant that identifies client needs and guides them before purchase 4. A developer and manager team is already in place to support clients and handle advanced requests 5. I am looking for an AI and web development expert who can integrate backend logic AI generation and marketplace functionality into a single system Think of it as AppSumo for scripts but with 80 percent of the process handled by AI including content creation and product listings If you have experience in AI SaaS web automation or building self-updating platforms comment below or send me a message If you have worked on marketplaces or AI assistants before you are also welcome I am not only looking for freelancers but also potential long term partners Reach out if this project matches your expertise"
  },
  {
    "title": "Is an inbound or outbound sales strategy better for launching an ERP as SaaS?",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzff1p/is_an_inbound_or_outbound_sales_strategy_better/",
    "content": "In outbound, I got 150 test users in one month with a $0 budget, and in inbound, 1 with a $1,600 budget. I'd like to get it right with inbound, but I haven't figured out the right steps."
  },
  {
    "title": "How are you currently building your SaaS",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzfcl8/how_are_you_currently_building_your_saas/",
    "content": "Hi, would love to know you you are currently building your app View Poll"
  },
  {
    "title": "NEED a differentiator! Adding job board straight on my wwebsite",
    "link": "https://www.reddit.com/r/SaaS/comments/1mzex8g/need_a_differentiator_adding_job_board_straight/",
    "content": "My vision is to help job seekers not just with resumes, but with relevant job postings in one place, almost like Skyscanner for jobs. To do this, Im exploring scraping job data from large sites to display curated postings. But as I dig deeper, I realize this is a legal and ethical minefield. Has anyone here tried navigating this? What practices (if any) make scraping jobs less risky, or should I look at partnerships/APIs instead? Would love honest thoughts from other founders, solo makers, or anyone with firsthand legal/tech experience. I have skimmed through some github projects which scrape job postings and I really loved this project: https://github.com/speedyapply/JobSpy , I have integrated it and works pretty neat.. Any suggestions are apprecitated."
  },
  {
    "title": "After nearly a decade as a software engineer, I finally launched my personal site!",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz7p1u/after_nearly_a_decade_as_a_software_engineer_i/",
    "content": "I've been a professional software engineer for the better part of a decade. I've worked on front-end and back-end production software at small non-profits and in Big Tech. I've been losing my creative spark from my professional work and decided to rekindle my curiosity by building side-projects and sharing them openly. I finally took the first step by building and deploying my personal project website. It is built from scratch. Just 1 HTML file, an Ubuntu VPS, and NGINX. No frameworks and no technical complexity (yet). It's a bit of a manifesto and represents my commitment to build in public. At this point, I still lack a clear business plan, but this still represents a huge step in actually building something and sharing it with the world. I'd love feedback from those that have gone down similar paths, or are considering it."
  },
  {
    "title": "I review digital product and Etsy shops every week for my subscribers.",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mzcbu0/i_review_digital_product_and_etsy_shops_every/",
    "content": "These are the most common mistakes I see. Products made for the seller, not the buyer. You might love it, but if nobodys searching for it, it wont sell. Weak or dated presentation. Poor design, filler content, or AI slop that nobody wants. Zero trust signals. Forget testimonials, theres no branding, no shop policies, nothing that says safe to buy from. Traffic wont fix these. The shops making consistent sales have all three dialed in: demand, quality, and trust. It's easy to create & publish digital products. Once you take care of these 3 things, selling them becomes much easier too."
  },
  {
    "title": "Did PPC worked for your SaaS?",
    "link": "https://www.reddit.com/r/Solopreneur/comments/1mz8kha/did_ppc_worked_for_your_saas/",
    "content": ""
  }
]