[
  {
    "title": "Audio-to-Text Software",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm looking for a completely free software that could capture live audio from a webpage and translate it in real time into text. Nothing fancy, simple GUI and easy to use (I don't want to code anything, you should click on an exe and that's it). It should run in Windows, it has to be software for a desktop PC, not a cell phone app.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Redditurro_\"> /u/Redditurro_ </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "looking for a software to simplify the process of capturing live audio from a webpage and translating it into text"
    }
  },
  {
    "title": "ITunes equivalent for pc/andoid",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone.</p> <p>I dont want to use any sort of streaming service since I have already bought all my digital music over the years. </p> <p>I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/UnlikelyLeague8589\"> /u/UnlikelyLeague8589 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is looking for an alternative to existing music management software"
    }
  },
  {
    "title": "Bluetooth hub/bridge/switch for car",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Our car, which I share with my wife, is new enough that it has Bluetooth to connect to the audio system, steering wheel controls, etc. but old enough that it only allows a single device to be stored in its memory. It's impractical to delete and store a new device every time we swap over between the two of us so our solution has been that my wife has the Bluetooth slot while I have a Bluetooth adapter that transmits to an FM channel that I use when I am driving. </p> <p>This is a suboptimal solution because the audio quality is bad, there is regularly interference from random radio stations on long journeys, and I can't use the steering wheel controls to answer calls, change tracks, etc. </p> <p>What I am looking for is a Bluetooth bridge device. Something that stays connected to the car, and which we both can pair to easily. Something that would relay the audio from our phone to the car and signals from the steering wheel controls to our phones. But it seems like a really niche thing. Do you think it might exist?</p> <p>Looking around I can find plenty of Bluetooth FM transmitter devices, or devices that operate either on TX or RX mode, but nothing that fills this two way passthrough function that I want. </p> <p>I should add that I'm not looking to have both our phones connected at the same time necessarily. Just something that is easy to pair with. It may be that we could find something that we can both connect to and then easily flip between which device is connected to the car, a bit like an HDMI switch. </p> <p>Any ideas?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/scramlington\"> /u/scramlington </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The user is looking for an improved solution to their current Bluetooth setup in the car"
    }
  },
  {
    "title": "Silent plug in timer switch with simple interface, temporary override function, and no hidden state",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm in the UK. I'm looking for something I can use to turn a bedroom light on to help me wake up.</p> <p>There are lots of lots of plug in timers but a lot of them seem like they'd be complicated to use - I'd be able read the instructions and use them while I remember but then I'd forget, and having to keep the instructions around and re-read them repeatedly would get really annoying. I think I may not great at learning things like that, and also a lot of products are just badly designed and cheaply made.</p> <p>Something like this would be pretty much perfect: <a href=\"https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr#\">https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr#</a> - it uses an electromechanical mechanical timer and pins in holes to tell the mechanism when to turn off or on. I particularly like that there's no &quot;hidden state&quot; - if you want to know how the device is set you just have to look at it, you don't have to press buttons or anything to find out what settings are stored on internal memory. But as its mechanical I expect it will be audible, which I don't really want next to my bed. (I don't mind an audible sound when it turns the power on and off, I just don't want a constant noise)</p> <p>I also want the feature that you can turn the power on or off with the switch on the bottom left corner and it doesn't change any permanent setting - the timer continues to work and sets the output to what its programmed for at the next pin position. Effectively for each time position in the circle there are three options - turn power on, turn power off, and maintain current state. Lots of other alternatives have little switches instead of pins but those all seem to only have two positions available, on and off, instead of the three that I want.</p> <p>Something like this <a href=\"https://www.argos.co.uk/product/9822911?clickPR=plp:2:3\">https://www.argos.co.uk/product/9822911?clickPR=plp:2:3</a> looks like it will be too hard to use. I see one reviewer wrote &quot;<em>It was initially a bit complicated to set up but once I got the hang of it, it was no problem at all</em>&quot; and I fear I would get the hang of it and then forget and have to go through the process of learning multiple times, which means keeping the manual around, especially since the buttons don't have full words on them. I have no idea what &quot;CD&quot; means in that context. Another reviewer said &quot;<em>I managed to throw away the instructions before programming these and have found it impossible to do so despite looking at you tube etc.</em>&quot; It also clearly has lots of hidden state, so I wouldn't be able to make a habit of glancing at it to check what time its set to go on in the morning before I sleep.</p> <p>I think my ideal would be something like the one I linked at tradesparky, except instead of an electromechanical clock and rotating rings it would have a silent electronic clock, either with hands or an LCD display to show the time, and a microprocessor programmed so that every 15 minutes it checks whether there's a pin in the relevant hole and turns the power on, off, or maintains the set position as appropriate. The current on/off position should be visible, ideally also feel-able like in the one I linked but it could be a display on the LCD with a button to flip it.</p> <p>Options to stay permanently on or off are probably unnecessary, since I can make the device always off using the switch on the device, and I can make it always on by plugging it in to a different socket.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/BarneyLaurance\"> /u/BarneyLaurance </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The user is looking for an improved version of a plug-in timer switch with specific features and design preferences."
    }
  },
  {
    "title": "Kitchen scale dishware.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I did a light Google search and didn't find what I was looking for so I'm asking here. </p> <p>Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. </p> <p>I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. </p> <p>My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. </p> <p>Does this exist? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/OhNaurLaNaur\"> /u/OhNaurLaNaur </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The user is looking for a simpler solution to track food consumption and calories, suggesting an improvement to their current workflow."
    }
  },
  {
    "title": "Library website/app that allows friends to share and borrow books",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone created an app or website that would allow you to create an account, connect with friends, upload a list of the books you own, and see your friends' books. You could search for a book you want to read, see who in your community has it, ask to borrow it, and track through the app who you've lent books to and whose books you have borrowed.<br /> Basically a library for friends groups or communities who want to connect and share books.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/pasakadives\"> /u/pasakadives </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The post is asking for an improved software/tool compared to what the user currently uses."
    }
  },
  {
    "title": "A quality desktop wallpaper site that doesn't allow AI, and doesn't have haphazardly upscaled or downscaled pictures",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>In my experience, wallpaper websites tend to be sketchy and filled with poorly upscaled or downscaled images. AI images are everywhere these days too, and it wouldn't surprise me if these sites were filled with them.</p> <p>I'm wondering if there's a high quality wallpaper site that isn't filled with scaled images or AI junk.</p> <p>EDIT: I'm not here to debate the merits of AI image generation. If you're here to promote it, go away.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/mr_bigmouth_502\"> /u/mr_bigmouth_502 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is looking for a specific type of software or tool to improve their experience"
    }
  }
]