[
  {
    "title": "Audio-to-Text Software",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm looking for a completely free software that could capture live audio from a webpage and translate it in real time into text. Nothing fancy, simple GUI and easy to use (I don't want to code anything, you should click on an exe and that's it). It should run in Windows, it has to be software for a desktop PC, not a cell phone app.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Redditurro_\"> /u/Redditurro_ </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mq7l8j/audiototext_software/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a free software with simple GUI and easy to use"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "ITunes equivalent for pc/andoid",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone.</p> <p>I dont want to use any sort of streaming service since I have already bought all my digital music over the years. </p> <p>I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/UnlikelyLeague8589\"> /u/UnlikelyLeague8589 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mqba0y/itunes_equivalent_for_pcandoid/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking an alternative to existing software"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Bluetooth hub/bridge/switch for car",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Our car, which I share with my wife, is new enough that it has Bluetooth to connect to the audio system, steering wheel controls, etc. but old enough that it only allows a single device to be stored in its memory. It's impractical to delete and store a new device every time we swap over between the two of us so our solution has been that my wife has the Bluetooth slot while I have a Bluetooth adapter that transmits to an FM channel that I use when I am driving. </p> <p>This is a suboptimal solution because the audio quality is bad, there is regularly interference from random radio stations on long journeys, and I can't use the steering wheel controls to answer calls, change tracks, etc. </p> <p>What I am looking for is a Bluetooth bridge device. Something that stays connected to the car, and which we both can pair to easily. Something that would relay the audio from our phone to the car and signals from the steering wheel controls to our phones. But it seems like a really niche thing. Do you think it might exist?</p> <p>Looking around I can find plenty of Bluetooth FM transmitter devices, or devices that operate either on TX or RX mode, but nothing that fills this two way passthrough function that I want. </p> <p>I should add that I'm not looking to have both our phones connected at the same time necessarily. Just something that is easy to pair with. It may be that we could find something that we can both connect to and then easily flip between which device is connected to the car, a bit like an HDMI switch. </p> <p>Any ideas?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/scramlington\"> /u/scramlington </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnlzg9/bluetooth_hubbridgeswitch_for_car/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking an improvement on existing Bluetooth solution"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Silent plug in timer switch with simple interface, temporary override function, and no hidden state",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm in the UK. I'm looking for something I can use to turn a bedroom light on to help me wake up.</p> <p>There are lots of lots of plug in timers but a lot of them seem like they'd be complicated to use - I'd be able read the instructions and use them while I remember but then I'd forget, and having to keep the instructions around and re-read them repeatedly would get really annoying. I think I may not great at learning things like that, and also a lot of products are just badly designed and cheaply made.</p> <p>Something like this would be pretty much perfect: <a href=\"https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr#\">https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr#</a> - it uses an electromechanical mechanical timer and pins in holes to tell the mechanism when to turn off or on. I particularly like that there's no &quot;hidden state&quot; - if you want to know how the device is set you just have to look at it, you don't have to press buttons or anything to find out what settings are stored on internal memory. But as its mechanical I expect it will be audible, which I don't really want next to my bed. (I don't mind an audible sound when it turns the power on and off, I just don't want a constant noise)</p> <p>I also want the feature that you can turn the power on or off with the switch on the bottom left corner and it doesn't change any permanent setting - the timer continues to work and sets the output to what its programmed for at the next pin position. Effectively for each time position in the circle there are three options - turn power on, turn power off, and maintain current state. Lots of other alternatives have little switches instead of pins but those all seem to only have two positions available, on and off, instead of the three that I want.</p> <p>Something like this <a href=\"https://www.argos.co.uk/product/9822911?clickPR=plp:2:3\">https://www.argos.co.uk/product/9822911?clickPR=plp:2:3</a> looks like it will be too hard to use. I see one reviewer wrote &quot;<em>It was initially a bit complicated to set up but once I got the hang of it, it was no problem at all</em>&quot; and I fear I would get the hang of it and then forget and have to go through the process of learning multiple times, which means keeping the manual around, especially since the buttons don't have full words on them. I have no idea what &quot;CD&quot; means in that context. Another reviewer said &quot;<em>I managed to throw away the instructions before programming these and have found it impossible to do so despite looking at you tube etc.</em>&quot; It also clearly has lots of hidden state, so I wouldn't be able to make a habit of glancing at it to check what time its set to go on in the morning before I sleep.</p> <p>I think my ideal would be something like the one I linked at tradesparky, except instead of an electromechanical clock and rotating rings it would have a silent electronic clock, either with hands or an LCD display to show the time, and a microprocessor programmed so that every 15 minutes it checks whether there's a pin in the relevant hole and turns the power on, off, or maintains the set position as appropriate. The current on/off position should be visible, ideally also feel-able like in the one I linked but it could be a display on the LCD with a button to flip it.</p> <p>Options to stay permanently on or off are probably unnecessary, since I can make the device always off using the switch on the device, and I can make it always on by plugging it in to a different socket.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/BarneyLaurance\"> /u/BarneyLaurance </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mnclxm/silent_plug_in_timer_switch_with_simple_interface/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is asking for an improved version of a product they like but have issues with"
    },
    "comments_checked": 3,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "A website like aggie.io but for music",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mlywhb/a_website_like_aggieio_but_for_music/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello! I'm looking to see if there's a website where you can collaborate with multiple peiple on something online like aggie.io but for music ! </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Original-Brief-4735\"> /u/Original-Brief-4735 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mlywhb/a_website_like_aggieio_but_for_music/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mlywhb/a_website_like_aggieio_but_for_music/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a website with similar functionality to aggie.io for music collaboration"
    },
    "comments_checked": 0
  },
  {
    "title": "Small pair of devices that beep when separated more than a few feet from each other.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mbmgqx/small_pair_of_devices_that_beep_when_separated/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm looking for something with a hair trigger and not smart phone based. 2 &quot;things&quot; that just beep immediately when more than 5 feet apart. They're only paired to each other and nothing else, and the key feature is the immediacy of their reaction to being separated. You might describe this as a &quot;wireless tether&quot;.</p> <p>All of the the trackers and tag systems seem to be built around bluetooth and phone apps as the anchor. They're more geared towards finding something after it's allowed to separate in the first place; they don't immediately notify you within seconds of separation from the phone.</p> <p>I'm wondering if this exists, but perhaps built for a different purpose than what I intend (put one on a phone and one on a wallet)? Maybe an industrial solution exists?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Stratedge\"> /u/Stratedge </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mbmgqx/small_pair_of_devices_that_beep_when_separated/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mbmgqx/small_pair_of_devices_that_beep_when_separated/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking an alternative to existing Bluetooth-based solutions with a hair trigger and immediacy of reaction"
    },
    "comments_checked": 31,
    "comment_analysis": {
      "result": {
        "found": [
          "Prox PRD",
          "ESP32 can measure WiFi signal strength"
        ]
      }
    }
  },
  {
    "title": "Kitchen scale dishware.",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I did a light Google search and didn't find what I was looking for so I'm asking here. </p> <p>Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. </p> <p>I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. </p> <p>My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. </p> <p>Does this exist? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/OhNaurLaNaur\"> /u/OhNaurLaNaur </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m9b8ul/kitchen_scale_dishware/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Library website/app that allows friends to share and borrow books",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone created an app or website that would allow you to create an account, connect with friends, upload a list of the books you own, and see your friends' books. You could search for a book you want to read, see who in your community has it, ask to borrow it, and track through the app who you've lent books to and whose books you have borrowed.<br /> Basically a library for friends groups or communities who want to connect and share books.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/pasakadives\"> /u/pasakadives </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m80lcr/library_websiteapp_that_allows_friends_to_share/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "A quality desktop wallpaper site that doesn't allow AI, and doesn't have haphazardly upscaled or downscaled pictures",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>In my experience, wallpaper websites tend to be sketchy and filled with poorly upscaled or downscaled images. AI images are everywhere these days too, and it wouldn't surprise me if these sites were filled with them.</p> <p>I'm wondering if there's a high quality wallpaper site that isn't filled with scaled images or AI junk.</p> <p>EDIT: I'm not here to debate the merits of AI image generation. If you're here to promote it, go away.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/mr_bigmouth_502\"> /u/mr_bigmouth_502 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1m2xugg/a_quality_desktop_wallpaper_site_that_doesnt/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a better alternative to existing wallpaper websites"
    },
    "comments_checked": 9,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "I’m looking for an app where I can replace the lyrics / vocals on a popular song with different lyrics",
    "link": "https://www.reddit.com/r/apps/comments/1mu3uoi/im_looking_for_an_app_where_i_can_replace_the/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/gifgyfs\"> /u/gifgyfs </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mu3uoi/im_looking_for_an_app_where_i_can_replace_the/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mu3uoi/im_looking_for_an_app_where_i_can_replace_the/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking an alternative to replace lyrics/vocals on popular songs"
    },
    "comments_checked": 0
  },
  {
    "title": "Panel Translation App For Japanese Panel",
    "link": "https://www.reddit.com/r/apps/comments/1mtuutw/panel_translation_app_for_japanese_panel/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p> <p>I will be going to Japan next month and I'll be at an event that will really all be in Japanese. I'm wondering if there is an app, payed even, that would translate just a live panel Q and A just for me. Like using audio from the panel it could translate as close as possible, live? I've seen a few, but it doesn't keep going. They all stop after a bit. </p> <p>I know they have those translation ear buds, but do those work and will they work for my needs?</p> <p>I also don't mind paying for it, or paying for a subscription while I'm there. </p> <p>Any help would be much appreciated. Thanks!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/DylanCorona\"> /u/DylanCorona </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mtuutw/panel_translation_app_for_japanese_panel/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mtuutw/panel_translation_app_for_japanese_panel/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The poster is looking for an improved software/tool to translate live panel Q&A in Japanese."
    },
    "comments_checked": 0
  },
  {
    "title": "Quickest way to make branded assets for a pitch when you’re out of time?",
    "link": "https://www.reddit.com/r/apps/comments/1mtt0ml/quickest_way_to_make_branded_assets_for_a_pitch/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm only in the beginning stages of putting my business out there. I run a small travel software agency and we’ve got a pitch in two days. I need slides, a one-pager, and a couple of mockups, but we don’t have an in-house designer. Any tools or hacks for this?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Dismal_Career_7681\"> /u/Dismal_Career_7681 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mtt0ml/quickest_way_to_make_branded_assets_for_a_pitch/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mtt0ml/quickest_way_to_make_branded_assets_for_a_pitch/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "The user is looking for a solution to create branded assets quickly, which can be achieved with software or tools."
    },
    "comments_checked": 0
  },
  {
    "title": "I built an app called Synchro...",
    "link": "https://www.reddit.com/r/apps/comments/1mt6qa3/i_built_an_app_called_synchro/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://preview.redd.it/vul2fvhb4ojf1.png?width=1500&amp;format=png&amp;auto=webp&amp;s=a3e23794b055e5892ec19c8b7f124a459590160d\">https://preview.redd.it/vul2fvhb4ojf1.png?width=1500&amp;format=png&amp;auto=webp&amp;s=a3e23794b055e5892ec19c8b7f124a459590160d</a></p> <p>I’ve been working on a new app called <strong>Synchro</strong>, and I’d love to share it with you all and get some feedback.</p> <p>Synchro is designed to <strong>record your voice and quickly transcribe it into text</strong>. You can also play it back with <strong>line-by-line highlights (like karaoke)</strong>, which makes it super easy to follow along.</p> <p>If the built-in engine has trouble with certain words or phrases, Synchro gives you the option to <strong>re-transcribe using AI</strong>, which greatly improves accuracy. My goal was to keep it <strong>simple, fast, and actually useful in daily life</strong>, without all the clutter that similar apps usually come with.</p> <p>✨ <strong>A few key features:</strong></p> <ul> <li>🔄 Voice to Text</li> <li>📱 Dual engine transcription (built-in + AI for higher accuracy)</li> <li>☁️ Sync to your iCloud</li> <li>🎨 Clean, minimal UI designed for ease of use</li> </ul> <p>I’d really love to hear your thoughts — what you like, what could be improved, or any features you think would make it more useful.</p> <p>Thanks for checking it out! 🙏 </p> <p><a href=\"https://apps.apple.com/us/app/synchro-smart-transcriber/id6749406016\">https://apps.apple.com/us/app/synchro-smart-transcriber/id6749406016</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Rebelution23\"> /u/Rebelution23 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mt6qa3/i_built_an_app_called_synchro/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mt6qa3/i_built_an_app_called_synchro/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The user is seeking feedback and suggestions for improvement on their app Synchro"
    },
    "comments_checked": 8,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "[4.99$ to FREE for 48H] StepZen – Pedometer Counter",
    "link": "https://www.reddit.com/r/apps/comments/1mt61vh/499_to_free_for_48h_stepzen_pedometer_counter/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hey Reddit!<br /> I just released <strong>StepZen – Pedometer Counter</strong>, a clean and minimalist step tracking app for iOS.</p> <p>No clutter, no unnecessary features – just an elegant way to track your daily movement:<br /> 👣 Step, distance, and floor tracking<br /> 📊 Daily/weekly progress + monthly calendar with bar charts<br /> 🎯 Personal goals with smart notifications when you hit them<br /> ✨ Lightweight, distraction-free design<br /> 💵 One-time purchase – no subscriptions, no hidden fees</p> <p>StepZen is built for people who want to stay active and motivated without the overwhelm of bloated fitness apps. Whether you’re walking for fitness, health, or mindfulness, it’s designed to keep things simple and focused.</p> <p><strong>What I’d love from you:</strong></p> <ul> <li>Feedback on the design and usability</li> <li>Suggestions for improvements or missing features</li> <li>General thoughts on the “minimalist tracker” approach</li> </ul> <p>📲 <a href=\"https://apps.apple.com/us/app/stepzen-pedometer-counter/id6749229395\"><strong>Download on the App Store</strong></a><br /> Regular price: <strong>FREE</strong><br /> <strong>IAP - 4.99$ Pro version</strong> now its <strong>FREE for 2 DAYS</strong></p> <p>Would really appreciate any feedback, bug reports, or ideas – and if you try it out, let me know how it fits into your daily routine! 🚶</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/MefjuEditor\"> /u/MefjuEditor </a> <br /> <span><a href=\"https://i.redd.it/7a2jroi3znjf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mt61vh/499_to_free_for_48h_stepzen_pedometer_counter/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "user is seeking feedback and suggestions for improvements on their existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "shot in the dark for party",
    "link": "https://www.reddit.com/r/apps/comments/1mt06ko/shot_in_the_dark_for_party/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>so for context, i have a party tonight that im bartending. nothing but friends, i have my bartending license but i will be drinking myself, very casual sort of thing. i was wondering if there was an app, sort of like a bar POS system where they could send in orders of drinks they want, and i could just call they're name when the drink is ready. ive been looking for a bit but all ive been able to find is legit restaurant POSs, and i wanted something they could easily download and use. is there anything youd recommend?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/TheMadness152\"> /u/TheMadness152 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mt06ko/shot_in_the_dark_for_party/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mt06ko/shot_in_the_dark_for_party/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "the user is looking for a specific type of software to improve their bartending experience"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "inventory manager app",
    "link": "https://www.reddit.com/r/apps/comments/1msw28x/inventory_manager_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>i built an inventory app called <strong>Inventory Nest</strong> mainly for tracking stuff in storage, tools, gear, whatever you have really. you can organize things by location (rooms, shelves, boxes), add pics, group items into kits, track maintenance, loan stuff out, and it works offline,instant website generation of the products coming soon.</p> <p>i'm looking for <strong>people</strong> to test it out and tell me what need adjustments and give feedback and<br /> i'll give you <strong>3 months of pro mode</strong> for free to try it out</p> <p>android only for now. dm me your google email that you use on playstore to add you into the testers list</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/rlcontent\"> /u/rlcontent </a> <br /> <span><a href=\"https://www.reddit.com/gallery/1msw28x\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1msw28x/inventory_manager_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The user is seeking feedback and improvements for their existing software."
    },
    "comments_checked": 0
  },
  {
    "title": "I made an app that builds your perfect trip in 60 sec!",
    "link": "https://www.reddit.com/r/apps/comments/1mrzqv5/i_made_an_app_that_builds_your_perfect_trip_in_60/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://preview.redd.it/koiu83x0pejf1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=a00e57828e7448d7e231acbda44a9f2b8c70d3fb\">https://preview.redd.it/koiu83x0pejf1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=a00e57828e7448d7e231acbda44a9f2b8c70d3fb</a></p> <p>SwipeCity is a new, simple and fun way to plan a trip.</p> <p>You answer a quick quiz, swipe (like Tinder) through places you like — restaurants, bars, hotels, museums, and more — then see them on your map and in favorites to plan your dream vacation stress-free.</p> <p>This is my first app, so I’d love to hear your feedback!</p> <p>P.S. The app is free to try, but if you want to use the Pro version, DM me and I’ll share a referral code.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Ok-Dog-9960\"> /u/Ok-Dog-9960 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mrzqv5/i_made_an_app_that_builds_your_perfect_trip_in_60/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mrzqv5/i_made_an_app_that_builds_your_perfect_trip_in_60/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The user is seeking feedback on their new app and asking for users to try it out."
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "I'm on a mission to fight the loneliness & depression epidemic. I spent a lot of time building an AI companion to make sure no one has to feel completely alone. I’d be honored if you tried it.",
    "link": "https://www.reddit.com/r/apps/comments/1mrrs38/im_on_a_mission_to_fight_the_loneliness/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hey Community Members,</p> <p>This is a bit personal, but it’s the reason I’m here. Like many of you, I've seen the devastating impact of depression and loneliness on people I care about. That feeling of being alone with your thoughts at 3 AM, with no one to talk to, is something I believe no one should have to endure.</p> <p>The statistics on suicide and mental health are terrifying, and I got tired of feeling helpless. I decided I had to do <em>something</em>.</p> <p>So, I poured everything I had into building <strong>ThunDroid</strong>.</p> <p>It's an AI mental health companion for iOS. My goal wasn't to replace therapists, but to create a safe, non-judgmental space that's available 24/7. It’s for those moments when you need to talk, vent, or just get out of your own head, but don't have anywhere else to turn.</p> <p>I focused on the things I believe matter most:</p> <ul> <li><strong>A Real Conversation:</strong> The AI is trained in proven therapeutic methods (CBT, DBT, ACT). It doesn't just give robotic answers; it understands context, adapts to your mood, and learns from you. You can talk to it without any limits.</li> <li><strong>Absolute Privacy:</strong> This was non-negotiable for me. All your conversations and journal entries are secured with military-grade encryption and <strong>never leave your device</strong>. I can't see them, and no one else can either. Your privacy is yours alone.</li> <li><strong>Tools That Actually Work:</strong> Beyond the chat, I included things that genuinely help, like a smart journaling system to help you spot patterns in your anxiety, and 13 different professional breathing exercises (including the Navy SEAL Box Breathing technique) for when you feel overwhelmed.</li> </ul> <p>I know the idea of an &quot;AI therapist&quot; can sound weird, and I want to be crystal clear: <strong>ThunDroid is a tool to complement, not replace, professional mental health care.</strong> It's a companion for the journey.</p> <p>My mission is to get this into the hands of millions and make a real dent in the suffering caused by mental health struggles. But I can't do it alone. I’m turning to you, the Reddit community, for help.</p> <p>There's a <strong>3-day free trial</strong> with full access to everything. I would be incredibly grateful if you would download it, try it out, and give me your honest feedback. Tell me what you love, what you hate, and what's missing. Your insights will be invaluable in helping me improve it for others.</p> <p>My dream is that one day, someone, somewhere, feeling at their absolute lowest, will open this app instead of giving up. If I can achieve that even once, all of this will have been worth it.</p> <p>Thank you for reading.</p> <p><strong>App Store Link:</strong> <a href=\"https://apps.apple.com/app/thundroid-ai/id6746182736\">https://apps.apple.com/app/thundroid-ai/id6746182736</a></p> <p><strong>TL;DR:</strong> I built a highly secure, AI-powered mental health companion app to fight loneliness and depression. It offers unlimited AI chat, smart journaling, and breathing exercises. My mission is to make mental support accessible 24/7. I'd be honored if you'd try the 3-day free trial and give me feedback.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/ThunDroid1\"> /u/ThunDroid1 </a> <br /> <span><a href=\"https://apps.apple.com/app/thundroid-ai/id6746182736\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mrrs38/im_on_a_mission_to_fight_the_loneliness/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The user is asking for feedback and improvement suggestions to enhance the AI mental health companion app."
    },
    "comments_checked": 0
  },
  {
    "title": "🎁 Giving Away 300 Premium Codes for My UV Tracking App - Don't Get Burned This Summer!",
    "link": "https://www.reddit.com/r/apps/comments/1mru9ld/giving_away_300_premium_codes_for_my_uv_tracking/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><strong>Hey Reddit!</strong></p> <p>I'm the developer of <strong>UV Guardian</strong> and I'm giving away <strong>300 PREMIUM CODES</strong> to celebrate our launch!</p> <p>🔥 <strong>What Makes This App Special:</strong></p> <ul> <li><strong>Real-time UV tracking</strong> - Know exactly when it's dangerous</li> <li><strong>AI-powered skin analysis</strong> - Personalized recommendations for YOUR skin type</li> <li><strong>Smart notifications</strong> - Never get caught off guard by UV spikes</li> <li><strong>100% PRIVACY FOCUSED</strong> - Your skin data stays on your device</li> <li><strong>Family profiles</strong> - Protect your loved ones too</li> <li><strong>Offline mode</strong> - Works without internet connection</li> <li><strong>Zero ads, zero tracking</strong> - Clean experience forever</li> <li><strong>Global UV data</strong> - Accurate anywhere in the world</li> </ul> <p>📱 <strong>Perfect For:</strong> ✓ People with fair/sensitive skin ✓ Outdoor workers &amp; athletes ✓ Parents protecting their children ✓ Anyone wanting to prevent skin damage ✓ Travelers visiting sunny destinations ✓ Vitamin D optimization (safe sun exposure)</p> <p>🎁 <strong>What You Get:</strong></p> <ul> <li><strong>100 codes:</strong> 6 months Premium (worth $29.99)</li> <li><strong>100 codes:</strong> 3 months Premium (worth $19.99)</li> <li><strong>100 codes:</strong> 1 month Premium (worth $9.99)</li> <li>All current features included</li> <li>Priority support</li> <li>Family profiles (up to 6 members)</li> </ul> <p>📲 <strong>App Store Link:</strong> <a href=\"https://apps.apple.com/app/id6749812045\">https://apps.apple.com/app/id6749812045</a></p> <p>⚡ <strong>How to Get Your Code:</strong> Send me a DM saying <strong>&quot;UV Guardian Premium Code Please&quot;</strong> First 300 people get a code! (distributed randomly)</p> <p>⏰ <strong>HURRY!</strong> Only 300 codes available. Once they're gone, they're gone!</p> <p>💬 <strong>UPDATE:</strong> Will respond to DMs within 1-2 hours. Check your messages!</p> <p><strong>P.S.</strong> If you love the app, a quick App Store review would mean the world to me as an indie developer! 🚀</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Repulsive_Care_390\"> /u/Repulsive_Care_390 </a> <br /> <span><a href=\"https://apps.apple.com/app/id6749812045\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mru9ld/giving_away_300_premium_codes_for_my_uv_tracking/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The user is giving away premium codes to celebrate the launch of their app and asking for reviews, indicating they want to improve their app's visibility."
    },
    "comments_checked": 0
  },
  {
    "title": "Any suggestions on copacking?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mu89tg/any_suggestions_on_copacking/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’m building a coffee syrup brand with single-serve stick packs. Flavors are testing well, but I’m struggling to find a co-packer.</p> <p>Most places I’ve reached out to either don’t handle liquids, aren’t set up for small stick packs, or require MOQs that are too high for me at the moment.</p> <p>Anyone have advice, connections, or recommendations for facilities that can handle liquid single-serve products or how to go about finding a copacker?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/rzp424\"> /u/rzp424 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mu89tg/any_suggestions_on_copacking/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mu89tg/any_suggestions_on_copacking/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "pain",
      "reason": "Business pain point related to finding a co-packer for liquid single-serve products"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Preferred financial spreadsheets",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mu5ceq/preferred_financial_spreadsheets/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I am looking to find a google sheets spreadsheet template for my companies financials and hoping to save the time (and learning) of making one. I see there are tons of templates you can purchase but want to see if I can get some recommendations before buying 10 and hating them all lol. </p> <p>Basically just have a home page with all the big picture financials, then have sheets for the jobs we do and equipment we used to track costs of jobs, as well as payments we have received. I’d assume this is basic but honestly idk. </p> <p>We are a solar company, so we’d like to be able to track a lot of different equiptment separately (same sized job can have way different equiptment requirements), and be able to see profit margin, and all that other stuff. </p> <p>If anyone has some recommendations on ones they have purchased, or if it’d actually better to bit the bullet and make it myself, I’d greatly appreciate it! </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Real_Eagle_1408\"> /u/Real_Eagle_1408 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mu5ceq/preferred_financial_spreadsheets/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mu5ceq/preferred_financial_spreadsheets/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is looking for a template or recommendations to improve their current financial spreadsheet process"
    },
    "comments_checked": 3,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Real-time Mortage Countdown App",
    "link": "https://www.reddit.com/r/apps/comments/1muo2lj/realtime_mortage_countdown_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>A friend of mine is an avid iPhone user and due to being both deaf and blind, cannot always access the store to search for apps the way I can. I, however, am a die hard Samsung user as my apple ID has been locked out since moses as in Egypt. But I figured y'all seem smart so maybe you can help me find something. </p> <p>She is looking for an app that will allow you to input you original mortage amount, the interest, the min monthly payment, the remaining amount, and then what you actually pay and it will countdown to your final payment. So like if I put $300k was my original, and I have a 6% APR, I have $173k a $1500 a month payment, and I pay $2000 instead, you will have your mortage paid off by April 2036. All these numbers and figures are made up, obviously, so...</p> <p>She can't find something like that and in looking in the play store, nothing seems right either. Does anyone know of anything that does that? She'd also like for the chance to change the figure every once in a while. Like &quot;Oh, you paid $50 more this month? You now shaved xyz time off your mortage.&quot; Even the option to 'What if' it too. Like &quot;What if I paid $50 more for the next year? Oh, that'd save you 2 months and your mortage would be paid off by 123 of 2036 insead.&quot;</p> <p>I have access to an iPad if I need to download and verify, but it's my son's and he hates letting others use it (wonky screen). But if I can get enough ideas, I'm sure letting me use it for a bulk and then not need to bug him again can be arranged.</p> <p>I also have <em>some</em> coding ability so making one might be an option. </p> <p>Thoughts? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/eGrant03\"> /u/eGrant03 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1muo2lj/realtime_mortage_countdown_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muo2lj/realtime_mortage_countdown_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software solution"
    },
    "comments_checked": 0
  },
  {
    "title": "I’m looking for an app that allows me to geo-tag and timestamp my photos and videos directly from my camera roll (IOS & Android)",
    "link": "https://www.reddit.com/r/apps/comments/1mubjut/im_looking_for_an_app_that_allows_me_to_geotag/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>It doesn’t really have to be an app. It could be a website, software, etc. I prefer stuff that is open source too for privacy reasons.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Livid_Split3589\"> /u/Livid_Split3589 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mubjut/im_looking_for_an_app_that_allows_me_to_geotag/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mubjut/im_looking_for_an_app_that_allows_me_to_geotag/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking an app improvement for existing functionality"
    },
    "comments_checked": 3,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Android TTS app with rich voice library and an API",
    "link": "https://www.reddit.com/r/apps/comments/1mtrn2p/android_tts_app_with_rich_voice_library_and_an_api/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone!</p> <p>Would appreciate any recommendations for an app that meets these fairly tight specifications. </p> <p>I have always wanted to be able to store some of the AI runs that I do in a place that I can access at my own leisure and retain for later - splitting up the prompting and running and reading processes into separate elements. </p> <p>I've managed to build out some nice workflows in N8N for doing precisely this: For capturing prompts with voice I use Voice Notes; run that into an agent and then &quot;put&quot; it in places (a database for posterity, email (for some), and a notebook).</p> <p>As much as I enjoy reading some outputs however I also would like to be able to listen to them using TTS,</p> <p>What I'm looking for therefore is an app that meets these criteria for Android:</p> <p>- You can create notes or save text programmatically, hence the API endpoint that I can integrate into my n8n workflows</p> <p>- On-device TTS with a good variety of natural sounding voices </p> <p>- The ability to play through your saved notes in chronological order and in a seamless process that would emulate a podcast with automatic skipping from one saved note to the next. </p> <p>Anything that does this? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/danielrosehill\"> /u/danielrosehill </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mtrn2p/android_tts_app_with_rich_voice_library_and_an_api/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mtrn2p/android_tts_app_with_rich_voice_library_and_an_api/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": true,
      "example": "https://play.google.com/store/apps/details?id=com.tuapp.aivoicecloner"
    }
  },
  {
    "title": "Novo Banking is not a safe place for your small business funds!",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1muvmwg/novo_banking_is_not_a_safe_place_for_your_small/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>All of my small business deposits have gone through Novo until my account was hacked 3 weeks ago. They bypassed multi factor authentication and came in as an untrusted device. $2500 of fraudulent transactions were taken from my account, leaving me with zero dollars. I changed my email address (which is also the username) and the password too. They managed to login again and change the email address! The security features on Novo suck immensely! There is no way to view or kick out suspicious devices like you can with other banks. Also the username is your email address, which is public information, easy to find out. If you call the fraud department they authenticate you by asking very simple questions like your name, email and business name. No security questions, pins or one time passwords. Way too easy to bypass security messages by simply calling. I didn’t get hacked or phished so I do not know how else they gained access other than using Novo’s lax security. I got my money back but seeing as they are not a bank technically, I consider myself fortunate.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/filmbuff1971\"> /u/filmbuff1971 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1muvmwg/novo_banking_is_not_a_safe_place_for_your_small/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1muvmwg/novo_banking_is_not_a_safe_place_for_your_small/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Anyone else losing business just because of reception/front desk issues?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mv361p/anyone_else_losing_business_just_because_of/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I run a small business and have been talking with a few owners lately. What surprised me: a lot of their worst reviews weren’t about the doctor at all—it was the first touch. Stuff like “great service, but nobody called me back” or “phone rang forever.” </p> <p>It made me look at my own setup and wonder how many leads I fumble just because I’m slow to reply or juggling too much. </p> <p>For those running salons/spas/contracting/clinics—how do you keep calls/messages from slipping through the cracks? Hire more staff? Rotate duties? Something else that actually works? </p> <p>I’m building software to deal with this, and I’m testing it with a few other SMBs. Happy to open it up free for a few more if anyone’s curious and is willing to give blunt feedback. Mostly curious how you’re handling it, so I don’t over-engineer the wrong thing.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/chavdeem\"> /u/chavdeem </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv361p/anyone_else_losing_business_just_because_of/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv361p/anyone_else_losing_business_just_because_of/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a software solution to improve existing business processes"
    },
    "comments_checked": 4,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "What are the ins and outs of having a small business that does fantasy art?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mv2t01/what_are_the_ins_and_outs_of_having_a_small/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I have my own website and I have shops that make the products and sell them, and I want to sell on my own website, but I’m at a loss? </p> <p>No matter how much research I put into this, I feel like I can only understand the creative process and not the actual business process</p> <p>I know about conventions and art markets but haven’t been apart of any out of fear that my art doesn’t match the right vibes? I work with various mediums in traditional art, as well as digital art. Conventions usually have digital art (mostly fanart — which I have some, just not as much as my original art), whereas art markets have usually consisted of ceramics, clothing, and jewelry. </p> <p>I’d also like to be able to occasionally have more control over selling my art through my website/Ko-fi/Etsy because I think it’s nice whenever I receive art from other artists who include thank you notes and small freebies and business cards. But, I don’t really understand shipping and packaging, or sales tax, and even less when it comes to international delivery </p> <p>I’ve only made a handful of sales over the past few years, and social media became a detriment to my health and I’d prefer to not go back, not unless I feel confident that it won’t put me in a bad place again. But without that, there’s not much marketing I can do unless they’re in person</p> <p>That said, I have no clue how small business Anything works. </p> <p>When should I register as a small business? </p> <p>How do small business taxes work? </p> <p>What requirements do I need to meet? </p> <p>Should I be making a specific amount of revenue each month, or each year? </p> <p>Are there benefits to register as a small business if I don’t really make much sales? Or would it be better to hold off until I get more sales? Or am I required to have my small business registered before attending in-person events?</p> <p>What other paperwork should I expect?</p> <p>How do you motivate yourself to work on your small business when you already don’t have any money outside of survival money? </p> <p>I know I’m at the part where I just take the jump but I’m scared that I’ll end up losing more money than I can gain and I’m not in a position where I can risk that</p> <p>I’m sure there’s more questions that I’m missing, but I would highly appreciate anything and everything that can help me understand any/all of this better</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Accomplished-Lab4412\"> /u/Accomplished-Lab4412 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv2t01/what_are_the_ins_and_outs_of_having_a_small/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv2t01/what_are_the_ins_and_outs_of_having_a_small/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "request for guidance on improving existing business processes and understanding of small business operations"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Bank Account Balancing Apps",
    "link": "https://www.reddit.com/r/apps/comments/1mux4qu/bank_account_balancing_apps/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi all. I’ll make this short. I recently upgraded my iPhone. For years, I was using an app called Vault to keep track of my expenses and income. The app is no longer available on my upgraded phone. I liked the simplicity of the app, the fact that you could easily edit your balance, and it even had a calendar that would display your balance just before payday. It was really easy for me to look at and see when I could be frivolous. Just curious if anyone has recommendations for something similar. For reference, I uploaded a screen shot of the app that I was using. Thanks again </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/nattyrod13\"> /u/nattyrod13 </a> <br /> <span><a href=\"https://i.redd.it/gkg63d2vx1kf1.jpeg\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mux4qu/bank_account_balancing_apps/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 0
  },
  {
    "title": "Hire my first employee?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mv2hmt/hire_my_first_employee/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi. I have a boutique Pilates studio in brooklyn that’s been open for 3 years. It’s a 50/50 LLC with my business partner and until this point we’ve mostly just been seeing our own private clients in the space. We’re both caretakers (I have two kids &amp; she is taking care of her ailing mother) and are each only available 3 days out of the week and almost completely booked up. We have a few renters that utilize the space but for the most part the space (which is beautiful) is underutilized. One of our current renters wants to start seeing 8-10 clients a week and I can’t decide wether it would be in my best interest to keep her as a renter at $30 an hour and have her bring her own people or hire her as an independent contractor and have her schedule open in our books. Is it complicated to have an independent contractor? What do I need to be aware of? I’m not quite sure what she’s charging her clients now and what she takes home after paying me the rental fee. I want to offer a good rate and also want to grow my business. I think a lot about people looking for availability on our website only to find me and my partner’s very limited schedule. I want more people in the door and want the space to be used but am nervous about taking this plunge. Also, my partner isn’t really into the idea because she thinks it’ll be too much work. Help please!!!!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Lesleyg11\"> /u/Lesleyg11 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv2hmt/hire_my_first_employee/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv2hmt/hire_my_first_employee/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking advice on how to improve business operations and hire first employee"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Alarm clock with separate off button and no snooze",
    "link": "https://www.reddit.com/r/Doesthisexist/comments/1mmb9oi/alarm_clock_with_separate_off_button_and_no_snooze/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I have a really hard time waking up, like will turn off the alarm in my sleep, wake up exhausted, tried every app hard. Does anything like the title exist? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Unhappy_Reality_2695\"> /u/Unhappy_Reality_2695 </a> <br /> <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mmb9oi/alarm_clock_with_separate_off_button_and_no_snooze/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/Doesthisexist/comments/1mmb9oi/alarm_clock_with_separate_off_button_and_no_snooze/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 4,
    "comment_analysis": {
      "found": true,
      "example": "Alarm Clock Xtreme has a gentle alarm mode with bird sounds and customizable radio stations"
    }
  },
  {
    "title": "Been cooking up something simple but meaningful",
    "link": "https://www.reddit.com/r/apps/comments/1mv1tvk/been_cooking_up_something_simple_but_meaningful/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I recently built <strong>Habstick</strong> — a very minimal habit tracker. The idea was simple: most habit apps today feel like social media platforms. Too many ads, logins, data collection, leaderboards, and endless distractions.</p> <p>I just wanted a <strong>clean space to track habits and stay consistent</strong> — without giving away my privacy. So Habstick doesn’t need logins, doesn’t show ads, and doesn’t track your data.</p> <p>Google Play Link : <a href=\"https://play.google.com/store/apps/details?id=com.habit.habstick\">https://play.google.com/store/apps/details?id=com.habit.habstick</a><br /> Medium post about the journey : <a href=\"https://medium.com/@rishad2002/why-i-built-habstick-a-simple-habit-tracker-that-respects-your-privacy-72c1ef545e1a\">https://medium.com/@rishad2002/why-i-built-habstick-a-simple-habit-tracker-that-respects-your-privacy-72c1ef545e1a</a></p> <p>Would love some honest feedback from people here. If you’ve ever felt like habit apps were more about engagement metrics than actually helping you improve, this might resonate.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Rishad2002\"> /u/Rishad2002 </a> <br /> <span><a href=\"https://i.redd.it/lmmexzf4y2kf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv1tvk/been_cooking_up_something_simple_but_meaningful/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user is seeking feedback on an existing app to improve its functionality and user experience"
    },
    "comments_checked": 11,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "[Lifetime $9.99 -> $1.99] I built an app that counts basic workouts and has a Pomodoro timer",
    "link": "https://www.reddit.com/r/apps/comments/1mv3mmk/lifetime_999_199_i_built_an_app_that_counts_basic/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I built this app to solve my own problems — being overweight and struggling with focus. It combines a Pomodoro timer with a counter for basic workouts. A special twist is that if you leave the app while the Pomodoro is running, you’ll face an exercise penalty when you come back.</p> <p>I decided to lower the lifetime plan price for a short time so more people can try it out.</p> <p>Hopefully, it can help solve your problems too.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Ok-Praline1660\"> /u/Ok-Praline1660 </a> <br /> <span><a href=\"https://i.redd.it/zwlk2f9mc3kf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv3mmk/lifetime_999_199_i_built_an_app_that_counts_basic/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a price reduction on an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "Could you recommend apps to make a quick 10-25 dollars",
    "link": "https://www.reddit.com/r/apps/comments/1muzogn/could_you_recommend_apps_to_make_a_quick_1025/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Embarrassed_Cap2553\"> /u/Embarrassed_Cap2553 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1muzogn/could_you_recommend_apps_to_make_a_quick_1025/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muzogn/could_you_recommend_apps_to_make_a_quick_1025/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a software solution to make money quickly"
    },
    "comments_checked": 8,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "for all app owners (ios & android)",
    "link": "https://www.reddit.com/r/apps/comments/1mulu92/for_all_app_owners_ios_android/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hey (;</p> <p>Built a tool for small and medium app teams who don’t have time &amp; budget for ASO.</p> <p>You just paste your App Store or Google Play URL and it instantly gives you clear improvements for your keywords, titles, screenshots, and more. No need to spend 20+ hours researching ASO and playing with keywords.</p> <p>So far results have been insane with 3 beta tester apps (both on android &amp; ios). Need to fix a few things, once it's done I'm launching it to the public.</p> <p>Sign up here:</p> <p><a href=\"https://forms.gle/DgezmSzQ3qfe68SP9\">https://forms.gle/DgezmSzQ3qfe68SP9</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/appixir\"> /u/appixir </a> <br /> <span><a href=\"https://www.reddit.com/gallery/1mulu92\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mulu92/for_all_app_owners_ios_android/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking improvement on an existing ASO tool"
    },
    "comments_checked": 0
  },
  {
    "title": "Would anyone be interested in a Bump/Find My Friends app where you can also talk to them walkie talkie style (like Ten Ten). I was thinking of building one for a fun project",
    "link": "https://www.reddit.com/r/apps/comments/1muslhe/would_anyone_be_interested_in_a_bumpfind_my/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/reccehour\"> /u/reccehour </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1muslhe/would_anyone_be_interested_in_a_bumpfind_my/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muslhe/would_anyone_be_interested_in_a_bumpfind_my/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a new software solution"
    },
    "comments_checked": 0
  },
  {
    "title": "[Android] I built an HD compression and video auto-split app - offering three months free",
    "link": "https://www.reddit.com/r/apps/comments/1muipy1/android_i_built_an_hd_compression_and_video/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://preview.redd.it/wd1f2akbjzjf1.jpg?width=4746&amp;format=pjpg&amp;auto=webp&amp;s=7408c8b4853217f54b35fcd25010a1e468adb736\">Some new features in the app</a></p> <p>Hi everyone. </p> <p>I’m an indie Android developer, and I built <strong>All Status Saver</strong>, an easy-to-use app for HD compression and auto video splitting.</p> <p>If that sounds useful, I’d love for you to try it. I’m offering <strong>3 months of Pro for free</strong> (normally $2.97/month).</p> <p><strong>How to redeem</strong></p> <ol> <li>Download the app: 👉 <a href=\"https://play.google.com/store/apps/details?id=downloadstatussaver.saver.storydownloader.savewhatsappstory.whatsapp_story\">https://play.google.com/store/apps/details?id=downloadstatussaver.saver.storydownloader.savewhatsappstory.whatsapp_story</a></li> <li>Promo codes:👉 UAYJNHSHS1LGVPZMU9Z1LWD | 68DQE0G4A4HH0PE7S89EJL5 | PM2EUW538YU8NMRQ4YLKMD6 | ZKBDL4V7P9D36PP0ZBN9E0H</li> <li>If the above promo codes have all been redeemed, kindly let me know. </li> </ol> <p>A short review would mean a lot. I’m happy to answer questions or walk through features.</p> <p>Thanks!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Heavy-Imagination102\"> /u/Heavy-Imagination102 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1muipy1/android_i_built_an_hd_compression_and_video/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muipy1/android_i_built_an_hd_compression_and_video/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 0
  },
  {
    "title": "Hello there, neck pain warriors! CTRL-Neck App Is Released!",
    "link": "https://www.reddit.com/r/apps/comments/1mumfcc/hello_there_neck_pain_warriors_ctrlneck_app_is/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi! Just dropped Ctrl+Neck - a simple tracker for desk workers dealing with neck pain from too much screen time.</p> <p>4 recovery phases, daily exercises, posture reminders with personality (sarcastic, funny, chill, motivational). 100% offline because your neck shouldn't need WiFi to feel better.</p> <p>I've built it for developers, designers, gamers - anyone who knows the &quot;why does my neck hurt&quot; struggle. Personally, I'm doing some of those exercises regularly, because my neck is in pain. Feeling better.</p> <p>I'll update app with more features and bugfixes, as my tracker apps are finished I think. It is a fresh release, so, need to work on it. So, stay tuned for updates / fixes!</p> <p>iOS: <a href=\"https://apps.apple.com/us/app/ctrl-neck-fix-neck-pain/id6748936785\">https://apps.apple.com/us/app/ctrl-neck-fix-neck-pain/id6748936785</a><br /> Android: <a href=\"https://play.google.com/store/apps/details?id=com.trifoiltrailblazer.ctrl_neck\">https://play.google.com/store/apps/details?id=com.trifoiltrailblazer.ctrl_neck</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/JEulerius\"> /u/JEulerius </a> <br /> <span><a href=\"https://i.redd.it/97oaq46d00kf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mumfcc/hello_there_neck_pain_warriors_ctrlneck_app_is/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "requesting updates and bugfixes for an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "app",
    "link": "https://www.reddit.com/r/apps/comments/1mum6o8/app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Can you recommend a earning app that really pay a money. App that can pay in just one week just badly need it for my fur baby medicine.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Medical-Jackfruit61\"> /u/Medical-Jackfruit61 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mum6o8/app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mum6o8/app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a software solution to improve existing earning app experience"
    },
    "comments_checked": 0
  },
  {
    "title": "earning app",
    "link": "https://www.reddit.com/r/apps/comments/1mum4w6/earning_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Can you recommend a earning app that really pay a money. App that can pay in just one week just badly need it for my fur baby medicine.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Medical-Jackfruit61\"> /u/Medical-Jackfruit61 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mum4w6/earning_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mum4w6/earning_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a software solution to improve an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "Ultimate App for Making Beautiful Screenshots & Device Mockups",
    "link": "https://www.reddit.com/r/apps/comments/1muix8i/ultimate_app_for_making_beautiful_screenshots/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I made an app that makes it incredibly easy to create stunning mockups and screenshots - perfect for showing off your app, website, product designs, or social media posts.</p> <p>✨ <strong>Features</strong></p> <ul> <li><strong>Website Screenshots:</strong> Instantly grab a screenshot by entering any URL.</li> <li><strong>30+ Mockup Devices &amp; Browser Frames:</strong> Showcase your website/app on phones, tablets, laptops, desktop browsers, and more.</li> <li><strong>Fully Customizable:</strong> Change backgrounds, add overlay shadows, tweak layouts, apply 3D transforms, use multi-image templates, and a ton more.</li> <li><strong>Annotation Tool:</strong> Add text, stickers, arrows, highlights, steps, and other markup.</li> <li><strong>Social Media Screenshots:</strong> Capture and style posts from X - great for testimonials.</li> <li><strong>Chrome Extension:</strong> Snap selected areas, specific elements, or full-page screenshots right from your browser.</li> </ul> <p><strong>Try it out:</strong> Editor: <a href=\"https://postspark.app/\">https://postspark.app</a><br /> Extension: <a href=\"https://chromewebstore.google.com/detail/postspark-create-nice-scr/glpanohoedaffcnogfenhacnofnlggfc\">Chrome Web Store</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/world1dan\"> /u/world1dan </a> <br /> <span><a href=\"https://www.reddit.com/gallery/1muix8i\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muix8i/ultimate_app_for_making_beautiful_screenshots/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 0
  },
  {
    "title": "Intersta - Community based App",
    "link": "https://www.reddit.com/r/apps/comments/1muinlk/intersta_community_based_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’ve built a social media app that connects people who share similar interests through social clubs.</p> <p>Im testing the app and currently only on iOS Let me know what you think of the experience </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/GhassanJaber\"> /u/GhassanJaber </a> <br /> <span><a href=\"https://apps.apple.com/app/id6748322551\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1muinlk/intersta_community_based_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "asking for feedback on an existing app"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "I made the Duolingo of Travelling! Its called Travy. [$89.99 to FREE Lifetime for 48H]",
    "link": "https://www.reddit.com/r/apps/comments/1mue1iu/i_made_the_duolingo_of_travelling_its_called/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><strong>About Travy:</strong></p> <p>Just launched <strong>Travy,</strong> a one-of-a-kind travel app that instantly creates detailed itineraries based on your time frame and budget. Whether you want the cheapest option or a luxury experience, Travy finds flights, hotels, restaurants, car rentals, events, and more.</p> <p>Go through the paywall at the end, select the subscription, and it will show as <strong>$0</strong> for the next 48 hours. Lock in lifetime access while it’s free.</p> <p><strong>Looking for feedback 🙌</strong></p> <ul> <li>Any feedback on <strong>app usability, design, or anything that doesn’t feel quite right</strong>.</li> <li>Suggestions for <strong>new features or improvements</strong>.</li> <li>General thoughts on your <strong>experience using the app</strong>.</li> </ul> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Truffleboi25\"> /u/Truffleboi25 </a> <br /> <span><a href=\"https://apps.apple.com/us/app/travy-plan-trips-itinerary/id6748553357\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mue1iu/i_made_the_duolingo_of_travelling_its_called/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "seeking feedback and suggestions for new features or improvements on an existing app"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Special Free trial for MealSnap – AI-powered food logging app",
    "link": "https://www.reddit.com/r/apps/comments/1mucobh/special_free_trial_for_mealsnap_aipowered_food/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "&#32; submitted by &#32; <a href=\"https://www.reddit.com/user/phenrys\"> /u/phenrys </a> <br /> <span><a href=\"https://apps.apple.com/app/mealsnap-ai-food-log-tracker/id6475162854\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mucobh/special_free_trial_for_mealsnap_aipowered_food/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "requesting a free trial and feedback on an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "Announcing the release of Presently. It is completely free to use.",
    "link": "https://www.reddit.com/r/apps/comments/1mu3bqy/announcing_the_release_of_presently_it_is/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Build a compelling on‑screen experience by combining your media, timed segments, and music—then project it to an external display with beautifully scaled typography and smooth transitions.Bring order and energy to any session: welcome your audience, run slideshows, keep segments on time, and set the vibe with Apple Music—directly from your iPhone or iPad. (Download here)[<a href=\"https://apps.apple.com/app/id6748536230%5C\">https://apps.apple.com/app/id6748536230\\</a>]</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/KarrySodhi007\"> /u/KarrySodhi007 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mu3bqy/announcing_the_release_of_presently_it_is/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mu3bqy/announcing_the_release_of_presently_it_is/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 0
  },
  {
    "title": "I almost bought a one-way ticket back to Europe… then something wild happened in SF",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mud0mi/i_almost_bought_a_oneway_ticket_back_to_europe/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>When I was 25 I moved to San Francisco with 2 friends to build a startup.</p> <p>We had no money, no network, no nothing. At one point we were literally sleeping on the floor of a co-working space and waking up before the cleaning staff came in. (Yes… kinda shameful, but also kinda funny looking back).</p> <p>Our tiny accelerator gave us 50k. We stretched it for a year. At the end there was only $2k left in the company account. My cofounder and I met with our mentor and told him: “that’s it, we’re done.”</p> <p>He looked at us and said: “2k is enough for 2 plane tickets back to Europe. Or it’s enough to do something bold. Up to you.”</p> <p>I was 99% sure I was going home.</p> <p>The next day, out of nowhere, a top VC partner tweeted she was looking for “the TikTok of jobs.” That was exactly what we were building.</p> <p>Through a random intro, we got a meeting with her.</p> <p>We went to their office (first time in my life sitting across from people whose names I’d only seen in TechCrunch).</p> <p>The meeting went “meh.” No big fireworks. She gave us a copy of Ben Horowitz’s book and said the classic “we’ll be in touch.”</p> <p>Two days later I’m in an elevator and another VC casually says: “Congrats guys, heard the news.”</p> <p>I’m like… what news??</p> <p>He smiles: “you’ll see, check your email.”</p> <p>Turns out the big fund had scheduled us for a full partner meeting. Ten partners around the table. We even crossed paths with Marc Andreessen and Ben Horowitz in the hallway.</p> <p>We pitched. Crickets. Almost no questions.</p> <p>Next day: rejection.</p> <p>But here’s the wild thing: apparently when a huge fund like that meets a tiny unknown startup, every other VC in town finds out instantly.</p> <p>Even though we got a “no,” it created a FOMO wave. Suddenly doors opened everywhere. Within 6 months we raised $1.5M, and a bit later another $6M.</p> <p>Lesson: never give up until the very last minute. The “no” that crushes you today can be the domino that makes others say yes tomorrow.</p> <p>That experience bought me a few extra years in SF until COVID hit and I moved to NY.</p> <p>Fast forward to today: I’m building again. Different space this time. We help businesses get organic traffic for free and rank high on LLMs (think ChatGPT answers).</p> <p>It’s self-serve, B2B, and somehow in less than a year more than 1,000 companies are already using it. Multi-millions in revenue, growing crazy fast.</p> <p>Funny enough, I can now email those same VCs directly, and the convo is completely different. They don’t invest in tools like this anymore (“no defensible moat,” “distribution &gt; product,” etc.). Which I actually kinda agree with… but still ironic after everything.</p> <p>Anyway, just wanted to share because 25-year-old me almost gave up with $2k left and a plane ticket home.</p> <p>Sometimes the biggest turning point comes the day after you think it’s over.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/tiln7\"> /u/tiln7 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mud0mi/i_almost_bought_a_oneway_ticket_back_to_europe/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mud0mi/i_almost_bought_a_oneway_ticket_back_to_europe/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The post is asking for a software solution to help businesses get organic traffic and rank high on LLMs, improving upon the experience of the author's startup."
    },
    "comments_checked": 34,
    "comment_analysis": {
      "comments": [
        {
          "author": "username1",
          "text": "These posts aren't about advice, it's about promoting their current business."
        },
        {
          "author": "username2",
          "text": "If you're not willing to share details publicly, this story is just more noise."
        },
        {
          "author": "username3",
          "text": "Obviously the key question is what the outcome of this business was?"
        },
        {
          "author": "username4",
          "text": "Uh, you went from last $2k to six months later with a check. That diligence period is about right but either you shut down in the interim or you begged, borrowed, cheated for more money? Not sure bridge debt would've gotten you there if you were on your last week and at the very start of other meetings (not even diligence). So, which is it?"
        },
        {
          "author": "username5",
          "text": "Yup, small businesses are CONSTANTLY pitching VCs. It's clear you know your audience."
        },
        {
          "author": "username6",
          "text": "I think you confused Reddit with LinkedIn."
        },
        {
          "author": "username7",
          "text": "😂"
        },
        {
          "author": "username8",
          "text": "Ahahaha reading this is so funny, i have slept on the floor for the last 2 weeks, and had to wake up at 6 a clock not because i am an early person but because the cleaning lady came. Feel you"
        },
        {
          "author": "username9",
          "text": "it will all pay off!"
        },
        {
          "author": "username10",
          "text": "How do these accelerators find out about your startup? What did you have for them to invest 50k?"
        },
        {
          "author": "username11",
          "text": "I have a buddy who does this as a hobby/job. Knows all the big VCs."
        },
        {
          "author": "username12",
          "text": "He has built a ton of stuff, maybe he’s on his 10th pivot, it’s hard to know which of those things he built were actually successful."
        },
        {
          "author": "username13",
          "text": "For anyone else out there keep in mind that you can be successful without being successful. The big boys are willing to buy you just to kill competition before it gets off the ground."
        },
        {
          "author": "username14",
          "text": "They are willing to buy you just for the idea of a single useful feature that they implement in their own software, but they just want to IP so that no one else can do it. They will throw $5m at a project that only has a one in 1000 chance of being a unicorn, because the unicorn payoff is so big."
        },
        {
          "author": "username15",
          "text": "Pretty inspiring story, how much time did it take from the first rejection to the first profitable year?"
        },
        {
          "author": "username16",
          "text": "What is your new company?"
        },
        {
          "author": "username17",
          "text": "What is the name of your current company and website?"
        },
        {
          "author": "username18",
          "text": "DMed"
        },
        {
          "author": "username19",
          "text": "I know this story is not true, because I’ve slept in quite a few Silicon Valley offices, and the cleaners always come in at around 2am. So nobody here “got up before the cleaners”!"
        },
        {
          "author": "username20",
          "text": "Are/were you in the country without authorization?"
        },
        {
          "author": "username21",
          "text": "Want to hire me?"
        }
      ]
    }
  },
  {
    "title": "used a website for a logo but changed it up, do i still need to purchase copyright?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1muu9wg/used_a_website_for_a_logo_but_changed_it_up_do_i/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>hi guys, recently starting up my small business. im rlly worried abt trademarks and copyrights etc.. i had a logo <a href=\"http://design.com\">design.com</a> made. i didnt purchase anything regarding to ownership, i took the general idea of the logo and changed it up on my ipad (cut out certain things, added my own) does <a href=\"http://design.com\">design.com</a> still hold ownership to it? or since ive changed things is it an own original thing? thank u! </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Nervous_Bat8710\"> /u/Nervous_Bat8710 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1muu9wg/used_a_website_for_a_logo_but_changed_it_up_do_i/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1muu9wg/used_a_website_for_a_logo_but_changed_it_up_do_i/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 16,
    "comment_analysis": {
      "found": [
        {
          "found": true,
          "example": "<a href=\"https://www.design.com/maker/legals/termsofuse#:%7E:text=8%20Intellectual%20Property%20Rights\">Terms of Service</a> for any products like logos and graphics that you might use to generate revenue."
        },
        {
          "found": true,
          "example": "<a href=\"https://www.design.com/maker/legals/termsofuse#:%7E:text=8%20Intellectual%20Property%20Rights\">Terms of Service</a> for any products like logos and graphics that you might use to generate revenue."
        },
        {
          "found": true,
          "example": "<a href=\"https://www.design.com/maker/legals/termsofuse#:%7E:text=8%20Intellectual%20Property%20Rights\">Terms of Service</a> for any products like logos and graphics that you might use to generate revenue."
        },
        {
          "found": true,
          "example": "<a href=\"https://www.design.com/maker/legals/termsofuse#:%7E:text=8%20Intellectual%20Property%20Rights\">Terms of Service</a> for any products like logos and graphics that you might use to generate revenue."
        }
      ]
    }
  },
  {
    "title": "Looking for sketch app?",
    "link": "https://www.reddit.com/r/apps/comments/1mvp67z/looking_for_sketch_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>To be clearer (cause I didn’t know how to say this in a condensed title), I’m an artist and I was hoping to find an app that is on in the background that can produce sketch/marker/pen/crayon etc sounds when my Apple Pencil touches the screen?</p> <p>I know there’s an actual cover I can apply to my tablet that will always produce a sketch noise. But what I seen was incredibly expensive and limited to just sketch sounds.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/hydrastxrk\"> /u/hydrastxrk </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mvp67z/looking_for_sketch_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvp67z/looking_for_sketch_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a software solution to enhance an existing experience"
    },
    "comments_checked": 0
  },
  {
    "title": "Looking for a Technical Co-Founder",
    "link": "https://www.reddit.com/r/apps/comments/1mvp1nn/looking_for_a_technical_cofounder/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’m working on an early-stage startup (pre-seed / idea stage) — we’re building decision intelligence software for enterprise institutions.</p> <p>Right now I’m looking for a co-founder who: - Has experience with Data engineering. - Actually enjoys building from scratch (0 →1 phase).</p> <p>You’d be leading engineering as the team grows. You won’t need to touch finance, sales, or business ops -I’ve got that covered. Your lane is tech + product.</p> <p>What’s in it for you: - Co-founder role + equity (not a “hire”) - ownership over the tech vision and architecture from day one. - Working on tough problems with real enterprise impact</p> <p>If this sounds like you ( or someone who'd think would be a fit ) - DMS are open</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/RequirementBeginning\"> /u/RequirementBeginning </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mvp1nn/looking_for_a_technical_cofounder/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvp1nn/looking_for_a_technical_cofounder/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking a co-founder to improve the technical direction of their startup"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Stealthy Writing Tool for Keyboard Lovers!",
    "link": "https://www.reddit.com/r/apps/comments/1mvod92/stealthy_writing_tool_for_keyboard_lovers/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, I built a desktop app that can allow you to call chatGPT and get response directly pasted onto your text editing field without having to constantly switch back and forth between windows. No browser plug-in, no app integration required.</p> <ul> <li>you can use it in literally in any app on windows</li> <li>treat anywhere you are typing as chatGPT and you can write your prompt</li> <li>you can add your own context for AI to take into consideration</li> <li>you can DIY re-usable prompt short cut</li> </ul> <p>Opening this app for preview release, sign up here if you are interested: <a href=\"https://alacrify-ai.com/\">https://alacrify-ai.com/</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Similar-Let-1981\"> /u/Similar-Let-1981 </a> <br /> <span><a href=\"https://www.reddit.com/gallery/1mvod92\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvod92/stealthy_writing_tool_for_keyboard_lovers/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "request for improvement on an existing tool"
    },
    "comments_checked": 0
  },
  {
    "title": "Simple Retool Assignment Help!!",
    "link": "https://www.reddit.com/r/apps/comments/1mvjysd/simple_retool_assignment_help/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I have an assignment to create a specific Retool app, and I'm very lost! I'm a complete novice, and learning has been a bit overwhelming. If anyone has experience with Retool (low/no code online app builder) and is looking for a little $$ DM me and i'd LOVE set up a call today</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/BagDiscombobulated32\"> /u/BagDiscombobulated32 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mvjysd/simple_retool_assignment_help/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvjysd/simple_retool_assignment_help/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking guidance on improving their skills with Retool app builder"
    },
    "comments_checked": 0
  },
  {
    "title": "Just launched Flag Quiz Master on App Store - 100% free - Looking for feedback - Reviews greatly appreciated! 😊",
    "link": "https://www.reddit.com/r/apps/comments/1mvd47k/just_launched_flag_quiz_master_on_app_store_100/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone!</p> <p>I'm excited to share that Flag Quiz Master is now live on App Store!</p> <p>If you love geography, trivia, or just want to learn more about the world's flags, this app is for you. I built it as a fun way to test and improve your knowledge of country flags from around the globe.</p> <p>App features:</p> <p>- Multiple game modes (Classic, Time Attack, Daily Challenges)</p> <p>- Different difficulty levels to match your skill</p> <p>- Track your progress and achievements (work in progress lol)</p> <p>- Learn flags from 195+ countries</p> <p>It's <strong>100% free</strong>!</p> <p>Here's the app link: <a href=\"https://apps.apple.com/ca/app/geography-flag-quiz-master/id6751133182\">Flag Quiz Master on App Store</a></p> <p>Would really appreciate if you could check it out and leave some feedback! As an indie developer, every download and review helps tremendously 🙏</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/ProgrammingNobody\"> /u/ProgrammingNobody </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mvd47k/just_launched_flag_quiz_master_on_app_store_100/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvd47k/just_launched_flag_quiz_master_on_app_store_100/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for feedback and reviews to improve the app"
    },
    "comments_checked": 0
  },
  {
    "title": "Do you use a blocker",
    "link": "https://www.reddit.com/r/apps/comments/1mv9q91/do_you_use_a_blocker/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Do you use a blocker, to stop your apps snooping on you got your details ? Any other good ones out there ? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/HoobleDoobles\"> /u/HoobleDoobles </a> <br /> <span><a href=\"https://i.redd.it/tk5t73m255kf1.jpeg\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv9q91/do_you_use_a_blocker/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Constitution app?",
    "link": "https://www.reddit.com/r/apps/comments/1mvh0qw/constitution_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Edit— that stupid auto correct lol it’s supposed to say construction app 😂 Hey, I’m going to be tackling a hand full of home repairs and I’m looking for an app that is free or cheap that I can basically use to plane out step by step what I need to do. Also having an area that has. Shooing list that I can add the supplies I need and keep track of multiple projects. I always end up forgetting something. I looked in the App Store and most of the apps are more advanced construction management apps for someone who manages a construction site. Any ideas? </p> <p>And yes I know I can just write it down or make a spreadsheet but I would really like something user friendly for made for DIYers. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/xcaseyxjonesx26\"> /u/xcaseyxjonesx26 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mvh0qw/constitution_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mvh0qw/constitution_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a user-friendly software solution to replace existing methods"
    },
    "comments_checked": 5,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Lock your favourite doomscrolling app till you hit your daily step goal.",
    "link": "https://www.reddit.com/r/apps/comments/1mv80jv/lock_your_favourite_doomscrolling_app_till_you/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://apps.apple.com/in/app/stridegate-walk-to-unlock/id6749471895\">https://apps.apple.com/in/app/stridegate-walk-to-unlock/id6749471895</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Sid_Dai\"> /u/Sid_Dai </a> <br /> <span><a href=\"https://i.redd.it/tn0up43ll4kf1.jpeg\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv80jv/lock_your_favourite_doomscrolling_app_till_you/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "asking for an improved software/tool compared to what they use"
    },
    "comments_checked": 0
  },
  {
    "title": "My quest to recapture novelty with my image discovery app: Photo Pilot",
    "link": "https://www.reddit.com/r/apps/comments/1mv6ge3/my_quest_to_recapture_novelty_with_my_image/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I don't know how well you remember how you felt when you discovered the internet for the first time.</p> <p>Or when you got your first smartphone and went to the app store to download a hundred different apps and games.</p> <p>Or how it felt when you found something online that was niche but beautiful and meaningful to you. Something that felt personal. Something that forged a connection with you.</p> <p>I've felt a lack of this emotion / feeling of novelty / discovery over time. As the internet became more larger, commodified, and corporatised, these tiny, personal corners of the internet slowly disappeared in obscurity. Eclipsed, so to speak.</p> <p>It's a problem of scale. Of algorithms. How do you penetrate deep into the internet to find something niche anymore when your only gateways are search engines and algorithms that promote only the most visited and popular places first? &quot;Relevance&quot; they call it. But what's relevant to you?</p> <p>So there was this one problem as mentioned above, and there were other problems too. The problem of privacy. The problem of pinterest going down the drain. Banning users en masse. </p> <p>Around the time all this was happening, we also experienced, with dismay, the failure of the game &quot;No man's sky&quot; which promised to help recapture this familar feeling of discovery / novelty. What went wrong there?</p> <p>I thought hard about all of this. I formulated some hypotheses of how a search engine can be used to facilitate the discovery of something truly novel and niche and interesting and beautiful. I mean it has to be through a search engine after all. Those are the ultimate gateways to the internet.</p> <p>And et voilà! Something clicked. </p> <p>The following were my observations: - whatever it was had to have a huge aspect of randomneess associated with it - it had to be related to images, not words - it had to be recursive. Like entering rabbit holes. You should be able to &quot;go deeper&quot; into any given niche.</p> <p>That is how Photo Pilot was born. It's not so much an app but a tool with a variety of different applications.</p> <p>This is how it works: It samples a random set of images from the internet. Each image leads to more images. And so on.</p> <p>This is how it's meant to be used: - A user executes a random search and recieves a sampling of images from the internet. - Images that evoke interest or imply a presence of something interesting on the source web page are &quot;collected&quot;. After being collected they can be tagged and organised and users can visit the source webpage. - Then, these images can be clicked on to receive a new set of images that go &quot;deeper&quot; into a given niche. - Repeat </p> <p>The results have been stunning. Yes, there is a learning curve. But there's also a lot of potential. There's so much development that can be done based on this one concept.</p> <p>So far I'm glad to report 1.3k users on Google Play alone. The ios app store also has around half that amount of downloads.</p> <p>I've made the app in a way that respects all users' privacy. There are no user accounts or analytics. Everything is stored on an offline sqlite database.</p> <p>I'd love it if some of you can try it and provide some feedback. Like I said, there is a learning curve so I'll be here for support. </p> <p>Thoughts? :)</p> <p>And thank you for your time!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/KeyRaise\"> /u/KeyRaise </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mv6ge3/my_quest_to_recapture_novelty_with_my_image/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv6ge3/my_quest_to_recapture_novelty_with_my_image/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "User is seeking feedback and support to improve their existing software tool, Photo Pilot"
    },
    "comments_checked": 0
  },
  {
    "title": "✨ Vitamin 2.0 is live! Tracking your vitamins and supplements is now simpler than ever.",
    "link": "https://www.reddit.com/r/apps/comments/1mv56bb/vitamin_20_is_live_tracking_your_vitamins_and/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>We’ve just rolled out a major update to help you stay on top of your vitamins, minerals, supplements, and pills more easily than ever.</p> <h1>What’s new in v2.0:</h1> <p>📝 New input system — keyboard entry or toggles.</p> <p>⌚ Apple Watch widgets rewritten for smoother performance.</p> <p>⏰ Redesigned Watch scheduler for easier daily planning.</p> <p>➕ Higher item limits so you can track more supplements.</p> <p>🔔 Custom notification sounds to keep you motivated your way.</p> <p>👨‍👩‍👧 Family Annual Plan now available.</p> <p>🎟️ Promo code redemption added.</p> <p>💡 Tutorials with Apple TipKit to guide you step by step.</p> <p>⚙️ Completely redesigned settings for a cleaner experience.</p> <p>This is our biggest release yet — crafted to make your wellness journey simpler, smarter, and more personalized.</p> <p><strong>👉 On the Apple App Store</strong></p> <p><a href=\"https://apple.co/42OdSEx\">https://apple.co/42OdSEx</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Antique_Way_3813\"> /u/Antique_Way_3813 </a> <br /> <span><a href=\"https://i.redd.it/pfa3drtlr3kf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv56bb/vitamin_20_is_live_tracking_your_vitamins_and/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Upgrading to a new version of an existing software"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "[4.99$ to FREE for 48H] QRForge - Scanner & Generator",
    "link": "https://www.reddit.com/r/apps/comments/1mv436i/499_to_free_for_48h_qrforge_scanner_generator/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello<br /> Just updated: <strong>QRForge – the powerful QR Scanner &amp; Custom QR Code Generator for iOS!</strong><br /> I built this app as an indie dev to give people a fast, private, and stylish way to scan and create QR codes — without clutter or data tracking.</p> <p>To celebrate the transition from subscription model to one-time purchase, I’m running a <strong>promo offer — grab the Pro version for FREE for the next 2 days!</strong> 🎉</p> <p>Why QRForge?<br /> 📸 <strong>Scan instantly</strong> – Fast and reliable QR code scanning with smart content recognition<br /> 🎨 <strong>Create custom QR codes</strong> – Add your own foreground &amp; background colors<br /> ⚡ <strong>Smart adaptive UI</strong> – Quick actions for Wi-Fi, links, contacts, text &amp; more<br /> 📂 <strong>Organized history</strong> – Keep all scanned codes neatly categorized<br /> 📤 <strong>One-tap sharing</strong> – Save or share QR codes with ease<br /> 🔒 <strong>Private by design</strong> – Clean interface &amp; zero data tracking</p> <p>What I’m Looking For:</p> <ul> <li>Feedback on usability, design, or anything that feels off</li> <li>Suggestions for new features or improvements</li> <li>Your thoughts on how it compares to other QR code apps</li> </ul> <p>📲 <a href=\"https://apps.apple.com/us/app/qrforge-scanner-generator/id6744676395\"><strong>Download on the App Store</strong></a><br /> Regular price: <strong>FREE</strong><br /> <strong>IAP - 4.99$ Pro version</strong> now its <strong>FREE for 2 DAYS</strong></p> <p>Every bit of feedback means the world to a solo indie dev — thanks for helping me improve QRForge! 🙏</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/MefjuEditor\"> /u/MefjuEditor </a> <br /> <span><a href=\"https://i.redd.it/inwgcjfjh3kf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mv436i/499_to_free_for_48h_qrforge_scanner_generator/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for feedback and suggestions on how to improve the existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "Easy to use website builder? Squarespace vs Wix vs Weebly for contractors",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvpbn9/easy_to_use_website_builder_squarespace_vs_wix_vs/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Setting up a basic website for a small construction business and looking for an easy to use website builder that includes domain registration, templates, and ideally scheduling features. I’ve tried Wix and Weebly in the past for other projects, and I’m considering Squarespace since a few people I know like it for simple sites. Budget is limited, so all-in-one solutions are preferred—I don’t want to mess with third-party domain setups. For contractors, does Squarespace have a real advantage over Wix or Weebly? Which builder handles scheduling and mobile optimization best?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/PlateAdventurous4583\"> /u/PlateAdventurous4583 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvpbn9/easy_to_use_website_builder_squarespace_vs_wix_vs/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvpbn9/easy_to_use_website_builder_squarespace_vs_wix_vs/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking a comparison of website builders for specific needs and preferences"
    },
    "comments_checked": 13,
    "comment_analysis": {
      "found": [
        {
          "found": true,
          "example": "<a href=\"https://grok.com/share/bGVnYWN5LWNvcHk%3D_480eba44-2b5f-4856-9b2d-e96051fa58a9\">https://grok.com/share/bGVnYWN5LWNvcHk%3D_480eba44-2b5f-4856-9b2d-e96051fa58a9</a>"
        },
        {
          "found": true,
          "example": "<a href=\"http://lovable.dev\">lovable.dev</a>"
        }
      ]
    }
  },
  {
    "title": "Is there any platform that helps scale your digital persona?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvkhqg/is_there_any_platform_that_helps_scale_your/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Ive been hearing about these native platforms that supposedly let u engage with people in a really personalized way but without actually sitting there replying to everyone manually. Like they kinda take your voice or digital persona or whatever and scale it up so you can talk to way more ppl at once. Idk if that’s just marketing fluff or if there are actually tools that feel natural like I mean I get so many random chatbots in my DMs that just sound fake or generic and i can’t imagine ppl really engaging with that long term. But if something could actually respond in a way that feels like me that could be crazy useful. Basically its like expanding your digital self so you can have convos at scale I guess imagine running a small brand or a side hustle and being able to keep up with hundreds of messages without losing your mind. Has anyone actually tried this yet or is it still kinda hyped?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/ObsidianWolf140\"> /u/ObsidianWolf140 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvkhqg/is_there_any_platform_that_helps_scale_your/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvkhqg/is_there_any_platform_that_helps_scale_your/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for a software solution to improve an existing experience"
    },
    "comments_checked": 6,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Why do some clients think “urgent” means “do it for free”?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mv7nse/why_do_some_clients_think_urgent_means_do_it_for/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Got an email from a client at 10 PM yesterday demanding a full website redesign by Monday, but they “can’t pay extra” because it’s “such a quick job.” I spent 20 minutes explaining it’s a week’s worth of work, and they still acted shocked. Do your clients pull this “urgent but cheap” nonsense? How do you shut it down politely?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Jinnapat397\"> /u/Jinnapat397 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv7nse/why_do_some_clients_think_urgent_means_do_it_for/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mv7nse/why_do_some_clients_think_urgent_means_do_it_for/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "client behavior is a business pain point that could be solved by software or service"
    },
    "comments_checked": 96,
    "comment_analysis": {
      "comments": [
        {
          "id": 1,
          "text": "Usually urgent means more expensive. You would be moving them to the front of the line so that should cost more, not less."
        },
        {
          "id": 2,
          "text": "Express service costs more wherever you go. Express mail costs more. Express train or flight no connections? Costs more."
        },
        {
          "id": 3,
          "text": "Personally, I think the best approach is to highlight that their request is extraordinary and therefore requires extraordinary compensation."
        },
        {
          "id": 4,
          "text": "I have some customers that will argue and complain over 5 bucks, some will try to return products from 2 years ago and others will write a check for thousands of dollars without batting an eye and never complain, they just want things done properly..... it all depends who you are dealing with, and the thing about business is that it involves people, and well... when it comes to people you get all sorts of different types of things happening."
        },
        {
          "id": 5,
          "text": "Express service costs more wherever you go. Express mail costs more. Express train or flight no connections? Costs more."
        }
      ]
    }
  },
  {
    "title": "Best way to sell small online business without time wasters and scam?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvbsfv/best_way_to_sell_small_online_business_without/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p> <p>I have a few onlibe business projects, but due to the lack of time for all businesses, I'm looking to sell some my projects.</p> <p>Its own turnkey software business developed from scratch. I have clients worldwide, own site, admin panel, unique software, clients panel, etc.</p> <p>Need advice on how to sell my projects as sefely as possible. Without scammers, time wasters, and brokers. </p> <p>Thank you in advance for advice.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Outrageous_Silver428\"> /u/Outrageous_Silver428 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvbsfv/best_way_to_sell_small_online_business_without/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvbsfv/best_way_to_sell_small_online_business_without/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking advice on how to improve the selling process of their software business"
    },
    "comments_checked": 6,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "My small business client is getting bamboozled by a \"fractional\" CMO - what would you do?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvn2aa/my_small_business_client_is_getting_bamboozled_by/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I'm consulting for a small business on some operations things and he hired a &quot;fractional CMO&quot; who is providing services. As best I can tell, this CMO doesn't have any contracted deliverables, and describes herself as doing &quot;high-level strategy&quot; related to marketing. (I don't know what differentiates high-level strategy from low-level strategy.)</p> <p>Here's the problem: I think this fractional might be full of shit. As best I can tell, she's just feeding prompts into some ChatGPT-type platform and uncritically serving up the results. I'm not a marketer, but I've worked on enough marketing projects to tell good work from bad, and this is <em>bad</em>. The brand strategy is generic and indistinguishable from our direct competition; the audience segmentation isn't based on any data; there are dozens of untracked marketing performance metrics that are never discussed in leadership meetings. Just today, our agency emailed her (and CC'd me for reasons) with a simple question, and she gave two wrong answers before she gave the right one - all of which were <em>clearly</em> generated by a chatbot.</p> <p>On top of it all, she recommended and hired an agency to rebuild the company website, but without doing any prior work on audience, product, brand, or conversion strategy. It was an enormous investment and the output has been exceptional only in its mediocrity.</p> <p>I've noticed this really obvious deficiency, but she papers over it with a deluge of ChatGPT-generated reports, analysis, and summaries. I think she's taking the client for a ride (and charges a lot for it). How would you approach flagging this for the client without creating animosity or conflict? If the client ultimately doesn't decide to terminate this fractional, I don't want to be left having to navigate an adversarial relationship for the rest of <em>my</em> contract.</p> <p>Thoughts?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/NuncProFunc\"> /u/NuncProFunc </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvn2aa/my_small_business_client_is_getting_bamboozled_by/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvn2aa/my_small_business_client_is_getting_bamboozled_by/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "client is getting bamboozled by a service and wants to know how to approach the client without conflict"
    },
    "comments_checked": 23,
    "comment_analysis": {
      "found": [
        {
          "comment": "The starting point with your client is <br>How much trust do they have in your feedback<br>Can you quantify the monetary value you can provide the client by sharing your concerns.<br>Are you able to back up your findings with data?",
          "example": ""
        },
        {
          "comment": "If her whole strategy could be replaced by ChatGPT prompts, your client’s paying for vibes. That’s it",
          "example": ""
        }
      ]
    }
  },
  {
    "title": "Embroidery vs printing, the things I wish I knew before selling both",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvr6bw/embroidery_vs_printing_the_things_i_wish_i_knew/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>When I first added embroidery to my store, I treated it like a side quest. You know, “Throw a logo on a cap and see what happens.” I wasn’t ready for it to actually outsell some of my printed stuff.</p> <p>Embroidery has this built-in premium feel you just can’t fake. People will happily pay more for something that feels like it’ll survive the washing machine for years instead of cracking or fading. Even the simplest designs, a letter, a small icon, somehow feel more intentional when they’re stitched.</p> <p>But here’s the part nobody warned me about:</p> <ul> <li><strong>Production costs</strong> are higher, and you can’t always pass the entire bump to customers without making them flinch.</li> <li><strong>Digitization fees</strong> are the silent killer. My first month, I ordered 7 new designs through different suppliers and didn’t even notice I was paying $10–$15 each just to turn them into stitch files. By the end of the month, I’d spent more on setup than the products themselves.</li> <li><strong>Design limitations</strong> are real. Fine details that look gorgeous in print often turn into a fuzzy blob in embroidery. Gradients? Just… no.</li> <li><strong>Skipping samples</strong>, my rookie mistake. I once launched a hoodie with a super detailed mandala embroidery from a supplier I’d never tested. On the mockup it looked stunning. The real version? It looked like someone sneezed mid-stitch.</li> </ul> <p>Now I’m a lot more strategic:</p> <ul> <li>Keep embroidery for bold, simple designs, chunky text, initials, clean logos.</li> <li>Stick with printing for anything detailed or full-color where I want the art preserved exactly.</li> <li>Batch my digitization work to avoid paying fees every other week.</li> </ul> <p>And here’s a tip from my trial-and-error phase: order from a couple of different POD companies before you commit. I grabbed samples from Printify, Apliiq, and Printful, lined them up on my desk, and compared stitching quality, thread colors, and fabric feel. The differences were bigger than I expected, and it made it clear which ones I’d actually trust for customer orders.</p> <p>If you’re thinking about offering both embroidery and printing, I’d say go for it, but start small. Test a couple of embroidery pieces next to your printed ones and see how your audience reacts. For me, embroidery went from “nice extra” to one of my best upsells.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Own-Alternative-504\"> /u/Own-Alternative-504 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvr6bw/embroidery_vs_printing_the_things_i_wish_i_knew/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvr6bw/embroidery_vs_printing_the_things_i_wish_i_knew/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The post is asking for an improved approach to offering both embroidery and printing services after the author's initial mistakes and lessons learned."
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Growing on instagram",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvw4ch/growing_on_instagram/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hii! Im soon going to open my small business on etsy, however im struggling to gain traction on instagram. I usually do a lot better on tiktok than instagram and im not too sure why. Ive tried posting at different times and everything but nothing has really worked. The few likes that I get are all from mutuals and not from other people so im wondering how can I grow more?</p> <p>Im open to suggestions but please dont be too mean 😭🫶</p> <p>If it helps my username on both tiktok and insta is fishie.studios</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Gullible-Cat8968\"> /u/Gullible-Cat8968 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvw4ch/growing_on_instagram/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvw4ch/growing_on_instagram/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for suggestions to improve Instagram growth"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "How do solo business owners handle repeating tasks and procedures?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvx3me/how_do_solo_business_owners_handle_repeating/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’m just starting out as a solo founder and I keep noticing that even small businesses need some kind of “procedures” — like sending the same type of client email, following the same checklist before a job, or chasing payments.</p> <p>If you’re working alone, how do you usually handle this?</p> <p>Do you write your own templates?</p> <p>Keep everything in your head?</p> <p>Or just recreate things each time from scratch?</p> <p>Curious to hear what works for you.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/No_Mastodon541\"> /u/No_Mastodon541 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvx3me/how_do_solo_business_owners_handle_repeating/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvx3me/how_do_solo_business_owners_handle_repeating/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "asking for an improved process or workflow compared to what they use"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "small business bank account recommendation",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvqulh/small_business_bank_account_recommendation/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi All - </p> <p>I'm looking for a recommendation for bank account for my llc with no monthly fees. I use BoA for my personal but want to explore other options, thanks. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Status-Collection833\"> /u/Status-Collection833 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvqulh/small_business_bank_account_recommendation/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvqulh/small_business_bank_account_recommendation/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a recommendation for an alternative to existing bank account"
    },
    "comments_checked": 5,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Free Developer Tools - Professional Grade, Zero Cost, Maximum Privacy",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvwc6p/free_developer_tools_professional_grade_zero_cost/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Wanted to share with the community some of the professional developer tools completely free I use every day like; CSS Gradient Generator, Image Compressor Converter, Enhanced Color Palette Generator, Secure Password Generator, CSS/HTML/JS Minifier, JSON Formatter &amp; Validator, Hash Generator, Lorem Ipsum Generator and many many more</p> <ul> <li>100% Free - No freemium BS, everything's included</li> <li>Privacy First - All processing happens in your browser</li> <li>No Registration - Just bookmark and use</li> <li>Mobile Optimized - Works perfectly on phones</li> <li>Professional Quality - Used by agencies and startups</li> </ul> <p><a href=\"https://creativebrain.ca/tools\">https://creativebrain.ca/tools</a></p> <p>What other free tools you use?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/andy-creative-brain\"> /u/andy-creative-brain </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvwc6p/free_developer_tools_professional_grade_zero_cost/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvwc6p/free_developer_tools_professional_grade_zero_cost/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "The post is asking users to share their favorite free developer tools and the author is also sharing their own favorites, indicating a request for recommendations or an improvement on existing tools."
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Looking for ways to contact phone sellers in Shenzhen remotely",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvw1fp/looking_for_ways_to_contact_phone_sellers_in/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p> <p>I’m trying to find a way to get in touch with sellers of <strong>brand new mobile phones</strong> in Shenzhen, but I’m currently outside of China and can’t visit in person.</p> <p>More specifically, I’m interested in the <strong>Yuanwang Digital Mall</strong>, especially the <strong>3rd floor</strong>, where I heard there are many mobile phone shops.</p> <p>Does anyone know a way to reach them, for example:</p> <ul> <li>If the sellers have <strong>WeChat, websites, or online platforms</strong> where they list their products?</li> <li>If there is a <strong>directory or contact info</strong> available for the shops in that mall?</li> <li>Or if anyone who has been there recently could share <strong>phone numbers or WeChat IDs</strong> of sellers?</li> </ul> <p>Any tips or leads would be super helpful. Thanks in advance!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/balqasima\"> /u/balqasima </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvw1fp/looking_for_ways_to_contact_phone_sellers_in/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvw1fp/looking_for_ways_to_contact_phone_sellers_in/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking a way to contact phone sellers in Shenzhen remotely, implying an existing solution is needed for improvement"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Wise has enabled issuing debit cards for U.S. business accounts",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvmn8k/wise_has_enabled_issuing_debit_cards_for_us/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Wise has enabled issuing debit cards for U.S. business accounts.</p> <p>i.imgur .com/FCnn9e7.png</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/MaznLLC\"> /u/MaznLLC </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvmn8k/wise_has_enabled_issuing_debit_cards_for_us/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvmn8k/wise_has_enabled_issuing_debit_cards_for_us/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "requesting an improvement on an existing software solution"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Looking for suggestions for an app",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvvune/looking_for_suggestions_for_an_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys! I’ve been coding an appointment system application to help small and medium-sized businesses for a while now. One day, when I needed it the most, I couldn't find the right program for my small business, and that's how my adventure began. When I started this search, I realized I needed to use different programs for everything. Tracking inventory, managing simple accounting, tracking customers, and tracking appointments meant paying high monthly fees, and I also had to deal with the setup and maintenance of these things. So, I decided to create a program that would track and manage everything. When I came across this subreddit, I thought I could get the best idea from you. Long story short, I'd be very happy if you could share your thoughts on what you're looking for in a business program, what you see as missing, what would make you happy, or what feature would make you subscribe to a program. PS: I'm keeping myself anonymous to avoid advertising. Writing from a fresh Reddit account and won't reveal the name of the program. I'm new to the subreddit, so I hope I'm not violating any rules. If so, please just let me know so I can edit the certain part or delete the post completely. Any thoughts are pretty valuable to me, and thank you guys so much. Love!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/dgczdmr\"> /u/dgczdmr </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvvune/looking_for_suggestions_for_an_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvvune/looking_for_suggestions_for_an_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking suggestions for an existing app to improve its features and functionality."
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Getting my side hustle more “settled in”",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mvm2u9/getting_my_side_hustle_more_settled_in/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Im selling colognes/perfumes, but i want to make a catalog that people can just go on my link and see all the products i have available and order them from me. Like a big market place. But ive already used depop/fb mp/etc. But i want to make it like a strict catalog. Were for example you want _____ fragrance, you go on my catalog and see what all I can source/get it for you. </p> <p>TLDR; i want to make a “place order” type catalog. </p> <p>I couldnt add attachements…… so i got coerced into making a imgur account to add a image. </p> <p><a href=\"https://imgur.com/a/r09rbTI\">https://imgur.com/a/r09rbTI</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/bugyourparents-\"> /u/bugyourparents- </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvm2u9/getting_my_side_hustle_more_settled_in/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mvm2u9/getting_my_side_hustle_more_settled_in/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "user wants to improve an existing platform (Depop/FB MP) with a new feature (strict catalog)"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Please, suggest me an app, that would help me to transfer a large amount of photos and audios from Android 10 tablet to Windows 10 laptop via USB.",
    "link": "https://www.reddit.com/r/apps/comments/1mwq7fg/please_suggest_me_an_app_that_would_help_me_to/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Using default options doesn't work, the process stops halfway. I want something more full proof, preferably open source and offline. Maybe something akin an advanced file manager.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/umimop\"> /u/umimop </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mwq7fg/please_suggest_me_an_app_that_would_help_me_to/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mwq7fg/please_suggest_me_an_app_that_would_help_me_to/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a software solution to improve an existing process"
    },
    "comments_checked": 0
  },
  {
    "title": "[4.99$ to FREE for 48H] OCRForge - Text Scanner",
    "link": "https://www.reddit.com/r/apps/comments/1mwkl07/499_to_free_for_48h_ocrforge_text_scanner/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello<br /> Just updated: <strong>OCRForge – the lightweight, powerful Text Scanner for iOS!</strong><br /> I built this app as an indie dev to make text extraction simple, accurate, and fast — without ads or unnecessary clutter.</p> <p>To celebrate the transition from subscription to one-time purchase, I’m running a promo offer — grab the Pro version for <strong>FREE for the next 2 days!</strong> 🎉</p> <p><strong>Why OCRForge?</strong><br /> 📸 <strong>Scan with Camera</strong> – Instantly capture and extract text from paper, signs, or handwritten notes<br /> 🖼️ <strong>Import from Photos</strong> – Select any image and convert it to text in seconds<br /> ⚡ <strong>Smart OCR Engine</strong> – Accurate and fast text recognition powered by advanced processing<br /> 📂 <strong>History View</strong> – All scanned text saved for later, easy to copy or share anytime<br /> 🔒 <strong>No Ads, No Tracking</strong> – Clean and distraction-free experience</p> <p><strong>What I’m Looking For:</strong></p> <ul> <li>Feedback on usability, design, or anything that feels off</li> <li>Suggestions for new features or improvements</li> <li>Your thoughts on how it compares to other OCR apps</li> </ul> <p>📲 <a href=\"https://apps.apple.com/us/app/ocrforge-text-scanner/id6748552382\"><strong>Download on the App Store</strong></a><br /> Regular price: <strong>FREE</strong><br /> <strong>IAP - 4.99$ Pro version</strong> now its <strong>FREE for 2 DAYS</strong></p> <p>Every bit of feedback means the world to a solo indie dev — thanks for helping me improve OCRForge! 🙏</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/MefjuEditor\"> /u/MefjuEditor </a> <br /> <span><a href=\"https://i.redd.it/4ls4zbpdbfkf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mwkl07/499_to_free_for_48h_ocrforge_text_scanner/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "seeking feedback and suggestions for new features or improvements on an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "free MD Vinyl",
    "link": "https://www.reddit.com/r/apps/comments/1mwkha8/free_md_vinyl/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>someone knows any apps similar to MD vinyl but for free? I would like the appearence of a vinyl record playing on my iPad. </p> <p>I've even researched for videos of screen recording of MD Vinyl on youtube, but it was unsucessful ):</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Annual_Trouble_4530\"> /u/Annual_Trouble_4530 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mwkha8/free_md_vinyl/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mwkha8/free_md_vinyl/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a free alternative to MD Vinyl"
    },
    "comments_checked": 0
  },
  {
    "title": "Which is the suitable ai model for image generation given i am a student with no money and need to create 450 images daily?",
    "link": "https://www.reddit.com/r/apps/comments/1mwaz1f/which_is_the_suitable_ai_model_for_image/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello people,<br /> I am building a project for which i will need to generate simple 2d images for a given context per day i need to generate around 450 images daily which monthly will be around 14kto 15k images.Which image generation model api is best for this given i am just a student and have no to very little money atm</p> <p>i need cost effective,mid pace, simple 2d image generation<br /> Please help</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/UDIK69\"> /u/UDIK69 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mwaz1f/which_is_the_suitable_ai_model_for_image/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mwaz1f/which_is_the_suitable_ai_model_for_image/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking cost-effective and simple 2D image generation model"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Free sound amplifier app",
    "link": "https://www.reddit.com/r/apps/comments/1mw6sjh/free_sound_amplifier_app/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I want a amplifier app without ads. I just need the Volume (1-1000%)</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/AnthonyGuy__\"> /u/AnthonyGuy__ </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mw6sjh/free_sound_amplifier_app/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mw6sjh/free_sound_amplifier_app/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "requesting an improvement on an existing app"
    },
    "comments_checked": 0
  },
  {
    "title": "I'm a little stupid can someone help me with an app idea I had",
    "link": "https://www.reddit.com/r/apps/comments/1mw0nzc/im_a_little_stupid_can_someone_help_me_with_an/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Okay so I'm not exactly the greatest at coding, well, in fact I can't code at all but I had a rlly good idea for an app and wanted to create it. So the ides is an app designed like indeed but just for regular ppl to find professionals or semi decent ppl in their area for small jobs like plumbing, moving things, dog watching, etc. . I mean we all know companies like to overcharge and sometimes for simple projects its an arm and a dang leg to get stuff done. But ppl closer to you like a neighbor would be far more understanding and mauluble with prices and time frame. I know it may seem kinda stupid; i mean i did say i am lol; but i just want to help ppl and i have ideas i just dont know how to create them. So I started looking at different sites that I could use and I stumbled upon an app called &quot;Replit&quot;. I used it and it did somewhat decent but it's fr like 3 kids in a trench coat. It looks good from the outside like it looks nice but the actual functionality is iffy and very bad at best. I can't get the ai to do what I need it to and I need someone to help finish the coding process but I wouldn't know who or where I could find someone. So pls be nice I know I'm kinda dumb but I could rlly use the help. =)</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Dry-Ad7393\"> /u/Dry-Ad7393 </a> <br /> <span><a href=\"https://www.reddit.com/r/apps/comments/1mw0nzc/im_a_little_stupid_can_someone_help_me_with_an/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mw0nzc/im_a_little_stupid_can_someone_help_me_with_an/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking improvement on existing app functionality"
    },
    "comments_checked": 5,
    "comment_analysis": {
      "found": true,
      "example": "There are lot of apps like that like airtasker.."
    }
  },
  {
    "title": "Google Workspace/Outlook is quite expensive for my small business. Any suggestions for a low cost business email alternative?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwg364/google_workspaceoutlook_is_quite_expensive_for_my/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’m a plumber, and I’m tired of paying more and more every year for email. $130/year for one email is ridiculous, but I want to still keep a professional business email. It helps with new clients. Just curious if there are any good cheaper options.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/hghst1244\"> /u/hghst1244 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwg364/google_workspaceoutlook_is_quite_expensive_for_my/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwg364/google_workspaceoutlook_is_quite_expensive_for_my/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking a cheaper alternative to existing email service"
    },
    "comments_checked": 10,
    "comment_analysis": {
      "found": true,
      "example": "You can use namecheap or cloudflare to forward the email to a regular gmail. </p> <p>But honestly what you are paying for in gsuites is inbox guaranteed and local service ads boost. That should already make up for $130 per year. If you don’t get business customers through your gsuite account that way you aren’t using it to its potential."
    }
  },
  {
    "title": "Agencies charging $10k for AI chatbots are straight up scamming people. It's literally a 10 minute job",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwrahf/agencies_charging_10k_for_ai_chatbots_are/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>A friend told me he was looking for someone to build an AI chatbot for his ecommerce business. The quotes he got were INSANE:</p> <ul> <li>Agency 1: $10,000 + $500/month maintenance</li> <li>Agency 2: $8,500 &quot;introductory price&quot;</li> <li>Upwork &quot;expert&quot;: $4,000 minimum flat fee</li> </ul> <p>For a pretty BASIC customer service chatbot. Not AGI. Not some complex system. Just a chatbot that answers questions from uploaded documents(with generic design).</p> <p>I'm also a developer and this pissed me off enough to record myself building the EXACT same thing. Took barely 8 minutes. Cost: $0 to build (hosting is like $20/month if you need it).</p> <p>Here's literally all you need:</p> <ol> <li>Any chatbot builder platform with built in RAG.</li> <li>Your business docs (FAQs, policies, product info)</li> <li>A basic (system)prompt telling it how to behave</li> </ol> <p>The &quot;complex AI integration&quot; these agencies sell is literally:</p> <ul> <li>Drag and drop your files</li> <li>Write a prompt like &quot;be a helpful customer service agent&quot;</li> <li>Click generate</li> </ul> <p>That's it. That's the $10k service.</p> <p>I'm not saying all AI dev work is simple.. custom integrations, complex workflows, actual development work deserve it's price. But charging small businesses $10k for a 10 minute drag &amp; drop setup? That's predatory.</p> <p>If anyone wants the screen recording showing the exact process, I'll post it. Just tired of seeing people get ripped off.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Excellent_Top_9172\"> /u/Excellent_Top_9172 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwrahf/agencies_charging_10k_for_ai_chatbots_are/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwrahf/agencies_charging_10k_for_ai_chatbots_are/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "user is asking for an improved software solution compared to what they use"
    },
    "comments_checked": 5,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "GSuite/Squarespace email has become ridiculously expensive. Any free business email suggestions for a small business operator?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwg3xb/gsuitesquarespace_email_has_become_ridiculously/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>I’m a plumber, and I’m tired of paying more and more every year for email. $130/year for one email is ridiculous, but I want to still keep a professional business email. It helps with new clients. Just curious if there are any good cheaper options.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/rajloveleil\"> /u/rajloveleil </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwg3xb/gsuitesquarespace_email_has_become_ridiculously/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwg3xb/gsuitesquarespace_email_has_become_ridiculously/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "seeking cheaper alternatives to existing email service"
    },
    "comments_checked": 10,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Those with physical stores, how do you handle cameras/prevent theft?",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwpk6g/those_with_physical_stores_how_do_you_handle/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Basically title.</p> <p>Are you actively monitoring the cameras? How do you handle repeat thieves? Do you use AI shoplifting software? etc.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Any_Mountain1293\"> /u/Any_Mountain1293 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwpk6g/those_with_physical_stores_how_do_you_handle/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwpk6g/those_with_physical_stores_how_do_you_handle/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "pain",
      "reason": "describing a business pain point that could be solved by software"
    },
    "comments_checked": 8,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Clover systems and afterpay",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwp10m/clover_systems_and_afterpay/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p>Hello I am a small business owner, and I have had clients asking about financing my product. I know it is possible, I have seen other businesses in my area advertise affirm afterpay klarna etc. However i called my bank where i have my clover card reader system set from they have no answers on setting up this system for me and directed me to clover support which was equally unhelpful. I was signing up for affirm and it had asked me about a platform and no one on clover or the bank could answer. (Had a lot of options like shopify and a bunch of something-commerce style stuff) </p> <p>I was just wondering if anyone has experience or knows somewhere to go to use this system. (Clover with affirm or in store affirm types)Honestly im okay with getting an entire new system away from clover if i need to but I think a buy now pay later system can really help my business. Feel free to ask questions if i was unclear</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Mysterious-Hotel8040\"> /u/Mysterious-Hotel8040 </a> <br /> <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwp10m/clover_systems_and_afterpay/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/smallbusiness/comments/1mwp10m/clover_systems_and_afterpay/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": true,
      "category": "improve",
      "reason": "Seeking an improvement on existing software (Clover system) for a specific feature (afterpay integration)"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "Got asked to do a deep clean, did the job, now the owner is halving the agreed rate after the fact",
    "link": "https://www.reddit.com/r/smallbusiness/comments/1mwqdrz/got_asked_to_do_a_deep_clean_did_the_job_now_the/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<span>I was asked last-minute to do a deep clean of an apartment for someone hosting a special event. The place was in rough shape including a lot of mould and I was encouraged to do as much as I could to get it looking right. I brought my own supplies, worked thoroughly, and postponed other things to fit it in because I was told the rate upfront and agreed on that basis. After the job was done, the owner told me she had “made a mistake” offering that rate and is now only willing to pay me half. This wasn’t discussed beforehand it only came up after I’d completed everything. I’ve tried to handle it calmly and professionally, but I feel really disrespected. I’m torn because she’s in my building and connected to people I know but I also don’t think it’s okay to change terms retroactively. Would love to hear how others would handle this or what you’d say in my shoes. Edit: it’s in writing and verbal, sent her a screenshot of her telling me the rate and she’s claiming it’s a mistake!</span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "pain",
      "reason": "Seeking an improvement on existing software (Clover system) for a specific feature (afterpay integration)"
    },
    "comments_checked": 1,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  },
  {
    "title": "News Widgets are now available in Your News",
    "link": "https://www.reddit.com/r/apps/comments/1mw2h9u/news_widgets_are_now_available_in_your_news/",
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<!-- SC_OFF --><div class=\"md\"><p><strong>Your News</strong> is an <strong>RSS Feed Reader</strong> with built-in support for <strong>Reddit</strong> and <strong>YouTube.</strong> It now includes <strong>RSS Widgets</strong> in <strong>medium and large sizes</strong>, so you can keep up with your favorite feeds right from your home screen.</p> <p>The widgets let you pick which sources to follow, adjust font sizes, change colors, and more.</p> <p>Other highlights include:</p> <ul> <li>Automatic refresh with an optional manual refresh button</li> <li>Navigation buttons to scroll through articles</li> </ul> <p>You can see the widgets in action here: <a href=\"https://www.reddit.com/r/YourNewsApp/comments/1mtddz0/sneak_peek_rss_home_widgets_for_ios/\">Sneak peek of RSS home widgets</a></p> <p>Keep in mind that widgets are a <strong>premium feature</strong>.</p> <p>iOS: <a href=\"https://apps.apple.com/us/app/your-news-rss-feed-reader/id6744372214?platform=iphone\">Your News – RSS Feed Reader</a>Android: <a href=\"https://play.google.com/store/apps/details?id=com.your_news&amp;hl=en\">Your News - RSS Feed Reader</a><br /> Learn more: <a href=\"https://www.yournews.app/\">yournews.app</a><br /> Join: <a href=\"https://www.reddit.com/r/yournewsapp/\">r/yournewsapp</a></p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/TijnvandenEijnde\"> /u/TijnvandenEijnde </a> <br /> <span><a href=\"https://i.redd.it/ijarcfjf6bkf1.png\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/apps/comments/1mw2h9u/news_widgets_are_now_available_in_your_news/\">[comments]</a></span>"
      }
    ],
    "classification": {
      "match": false,
      "category": "improve",
      "reason": "describing an existing product with a new feature or improvement"
    },
    "comments_checked": 2,
    "comment_analysis": {
      "found": false,
      "example": ""
    }
  }
]