{"text": "I'm looking for a completely free software that could capture live audio from a webpage and translate it in real time into text. Nothing fancy, simple GUI and easy to use (I don't want to code anything, you should click on an exe and that's it). It should run in Windows, it has to be software for a desktop PC, not a cell phone app.", "target": "positive"}
{"text": "Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone. I dont want to use any sort of streaming service since I have already bought all my digital music over the years. I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer.", "target": "positive"}
{"text": "Our car, which I share with my wife, is new enough that it has Bluetooth to connect to the audio system, steering wheel controls, etc. but old enough that it only allows a single device to be stored in its memory. It's impractical to delete and store a new device every time we swap over between the two of us so our solution has been that my wife has the Bluetooth slot while I have a Bluetooth adapter that transmits to an FM channel that I use when I am driving. This is a suboptimal solution because the audio quality is bad, there is regularly interference from random radio stations on long journeys, and I can't use the steering wheel controls to answer calls, change tracks, etc. What I am looking for is a Bluetooth bridge device. Something that stays connected to the car, and which we both can pair to easily. Something that would relay the audio from our phone to the car and signals from the steering wheel controls to our phones. But it seems like a really niche thing. Do you think it might exist? Looking around I can find plenty of Bluetooth FM transmitter devices, or devices that operate either on TX or RX mode, but nothing that fills this two way passthrough function that I want. I should add that I'm not looking to have both our phones connected at the same time necessarily. Just something that is easy to pair with. It may be that we could find something that we can both connect to and then easily flip between which device is connected to the car, a bit like an HDMI switch. Any ideas?", "target": "positive"}
{"text": "I'm in the UK. I'm looking for something I can use to turn a bedroom light on to help me wake up. There are lots of lots of plug in timers but a lot of them seem like they'd be complicated to use - I'd be able read the instructions and use them while I remember but then I'd forget, and having to keep the instructions around and re-read them repeatedly would get really annoying. I think I may not great at learning things like that, and also a lot of products are just badly designed and cheaply made. Something like this would be pretty much perfect: https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr# - it uses an electromechanical mechanical timer and pins in holes to tell the mechanism when to turn off or on. I particularly like that there's no \"hidden state\" - if you want to know how the device is set you just have to look at it, you don't have to press buttons or anything to find out what settings are stored on internal memory. But as its mechanical I expect it will be audible, which I don't really want next to my bed. (I don't mind an audible sound when it turns the power on and off, I just don't want a constant noise) I also want the feature that you can turn the power on or off with the switch on the bottom left corner and it doesn't change any permanent setting - the timer continues to work and sets the output to what its programmed for at the next pin position. Effectively for each time position in the circle there are three options - turn power on, turn power off, and maintain current state. Lots of other alternatives have little switches instead of pins but those all seem to only have two positions available, on and off, instead of the three that I want. Something like this https://www.argos.co.uk/product/9822911?clickPR=plp:2:3 looks like it will be too hard to use. I see one reviewer wrote \" It was initially a bit complicated to set up but once I got the hang of it, it was no problem at all \" and I fear I would get the hang of it and then forget and have to go through the process of learning multiple times, which means keeping the manual around, especially since the buttons don't have full words on them. I have no idea what \"CD\" means in that context. Another reviewer said \" I managed to throw away the instructions before programming these and have found it impossible to do so despite looking at you tube etc. \" It also clearly has lots of hidden state, so I wouldn't be able to make a habit of glancing at it to check what time its set to go on in the morning before I sleep. I think my ideal would be something like the one I linked at tradesparky, except instead of an electromechanical clock and rotating rings it would have a silent electronic clock, either with hands or an LCD display to show the time, and a microprocessor programmed so that every 15 minutes it checks whether there's a pin in the relevant hole and turns the power on, off, or maintains the set position as appropriate. The current on/off position should be visible, ideally also feel-able like in the one I linked but it could be a display on the LCD with a button to flip it. Options to stay permanently on or off are probably unnecessary, since I can make the device always off using the switch on the device, and I can make it always on by plugging it in to a different socket.", "target": "positive"}
{"text": "Hello! I'm looking to see if there's a website where you can collaborate with multiple peiple on something online like aggie.io but for music !", "target": "positive"}
{"text": "I'm looking for something with a hair trigger and not smart phone based. 2 \"things\" that just beep immediately when more than 5 feet apart. They're only paired to each other and nothing else, and the key feature is the immediacy of their reaction to being separated. You might describe this as a \"wireless tether\". All of the the trackers and tag systems seem to be built around bluetooth and phone apps as the anchor. They're more geared towards finding something after it's allowed to separate in the first place; they don't immediately notify you within seconds of separation from the phone. I'm wondering if this exists, but perhaps built for a different purpose than what I intend (put one on a phone and one on a wallet)? Maybe an industrial solution exists?", "target": "positive"}
{"text": "I did a light Google search and didn't find what I was looking for so I'm asking here. Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. Does this exist?", "target": "positive"}
{"text": "Has anyone created an app or website that would allow you to create an account, connect with friends, upload a list of the books you own, and see your friends' books. You could search for a book you want to read, see who in your community has it, ask to borrow it, and track through the app who you've lent books to and whose books you have borrowed. Basically a library for friends groups or communities who want to connect and share books.", "target": "positive"}
{"text": "In my experience, wallpaper websites tend to be sketchy and filled with poorly upscaled or downscaled images. AI images are everywhere these days too, and it wouldn't surprise me if these sites were filled with them. I'm wondering if there's a high quality wallpaper site that isn't filled with scaled images or AI junk. EDIT: I'm not here to debate the merits of AI image generation. If you're here to promote it, go away.", "target": "positive"}
{"text": "Hello, I will be going to Japan next month and I'll be at an event that will really all be in Japanese. I'm wondering if there is an app, payed even, that would translate just a live panel Q and A just for me. Like using audio from the panel it could translate as close as possible, live? I've seen a few, but it doesn't keep going. They all stop after a bit. I know they have those translation ear buds, but do those work and will they work for my needs? I also don't mind paying for it, or paying for a subscription while I'm there. Any help would be much appreciated. Thanks!", "target": "positive"}
{"text": "I'm only in the beginning stages of putting my business out there. I run a small travel software agency and weve got a pitch in two days. I need slides, a one-pager, and a couple of mockups, but we dont have an in-house designer. Any tools or hacks for this?", "target": "positive"}
{"text": "https://preview.redd.it/vul2fvhb4ojf1.png?width=1500&format=png&auto=webp&s=a3e23794b055e5892ec19c8b7f124a459590160d Ive been working on a new app called Synchro , and Id love to share it with you all and get some feedback. Synchro is designed to record your voice and quickly transcribe it into text . You can also play it back with line-by-line highlights (like karaoke) , which makes it super easy to follow along. If the built-in engine has trouble with certain words or phrases, Synchro gives you the option to re-transcribe using AI , which greatly improves accuracy. My goal was to keep it simple, fast, and actually useful in daily life , without all the clutter that similar apps usually come with.  A few key features:  Voice to Text  Dual engine transcription (built-in + AI for higher accuracy)  Sync to your iCloud  Clean, minimal UI designed for ease of use Id really love to hear your thoughts  what you like, what could be improved, or any features you think would make it more useful. Thanks for checking it out!  https://apps.apple.com/us/app/synchro-smart-transcriber/id6749406016", "target": "negative"}
{"text": "Hey Reddit! I just released StepZen  Pedometer Counter , a clean and minimalist step tracking app for iOS. No clutter, no unnecessary features  just an elegant way to track your daily movement:  Step, distance, and floor tracking  Daily/weekly progress + monthly calendar with bar charts  Personal goals with smart notifications when you hit them  Lightweight, distraction-free design  One-time purchase  no subscriptions, no hidden fees StepZen is built for people who want to stay active and motivated without the overwhelm of bloated fitness apps. Whether youre walking for fitness, health, or mindfulness, its designed to keep things simple and focused. What Id love from you: Feedback on the design and usability Suggestions for improvements or missing features General thoughts on the minimalist tracker approach  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Would really appreciate any feedback, bug reports, or ideas  and if you try it out, let me know how it fits into your daily routine!", "target": "negative"}
{"text": "so for context, i have a party tonight that im bartending. nothing but friends, i have my bartending license but i will be drinking myself, very casual sort of thing. i was wondering if there was an app, sort of like a bar POS system where they could send in orders of drinks they want, and i could just call they're name when the drink is ready. ive been looking for a bit but all ive been able to find is legit restaurant POSs, and i wanted something they could easily download and use. is there anything youd recommend?", "target": "positive"}
{"text": "i built an inventory app called Inventory Nest mainly for tracking stuff in storage, tools, gear, whatever you have really. you can organize things by location (rooms, shelves, boxes), add pics, group items into kits, track maintenance, loan stuff out, and it works offline,instant website generation of the products coming soon. i'm looking for people to test it out and tell me what need adjustments and give feedback and i'll give you 3 months of pro mode for free to try it out android only for now. dm me your google email that you use on playstore to add you into the testers list", "target": "negative"}
{"text": "https://preview.redd.it/koiu83x0pejf1.jpg?width=1920&format=pjpg&auto=webp&s=a00e57828e7448d7e231acbda44a9f2b8c70d3fb SwipeCity is a new, simple and fun way to plan a trip. You answer a quick quiz, swipe (like Tinder) through places you like  restaurants, bars, hotels, museums, and more  then see them on your map and in favorites to plan your dream vacation stress-free. This is my first app, so Id love to hear your feedback! P.S. The app is free to try, but if you want to use the Pro version, DM me and Ill share a referral code.", "target": "negative"}
{"text": "Hey Community Members, This is a bit personal, but its the reason Im here. Like many of you, I've seen the devastating impact of depression and loneliness on people I care about. That feeling of being alone with your thoughts at 3 AM, with no one to talk to, is something I believe no one should have to endure. The statistics on suicide and mental health are terrifying, and I got tired of feeling helpless. I decided I had to do something . So, I poured everything I had into building ThunDroid . It's an AI mental health companion for iOS. My goal wasn't to replace therapists, but to create a safe, non-judgmental space that's available 24/7. Its for those moments when you need to talk, vent, or just get out of your own head, but don't have anywhere else to turn. I focused on the things I believe matter most: A Real Conversation: The AI is trained in proven therapeutic methods (CBT, DBT, ACT). It doesn't just give robotic answers; it understands context, adapts to your mood, and learns from you. You can talk to it without any limits. Absolute Privacy: This was non-negotiable for me. All your conversations and journal entries are secured with military-grade encryption and never leave your device . I can't see them, and no one else can either. Your privacy is yours alone. Tools That Actually Work: Beyond the chat, I included things that genuinely help, like a smart journaling system to help you spot patterns in your anxiety, and 13 different professional breathing exercises (including the Navy SEAL Box Breathing technique) for when you feel overwhelmed. I know the idea of an \"AI therapist\" can sound weird, and I want to be crystal clear: ThunDroid is a tool to complement, not replace, professional mental health care. It's a companion for the journey. My mission is to get this into the hands of millions and make a real dent in the suffering caused by mental health struggles. But I can't do it alone. Im turning to you, the Reddit community, for help. There's a 3-day free trial with full access to everything. I would be incredibly grateful if you would download it, try it out, and give me your honest feedback. Tell me what you love, what you hate, and what's missing. Your insights will be invaluable in helping me improve it for others. My dream is that one day, someone, somewhere, feeling at their absolute lowest, will open this app instead of giving up. If I can achieve that even once, all of this will have been worth it. Thank you for reading. App Store Link: https://apps.apple.com/app/thundroid-ai/id6746182736 TL;DR: I built a highly secure, AI-powered mental health companion app to fight loneliness and depression. It offers unlimited AI chat, smart journaling, and breathing exercises. My mission is to make mental support accessible 24/7. I'd be honored if you'd try the 3-day free trial and give me feedback.", "target": "negative"}
{"text": "Hey Reddit! I'm the developer of UV Guardian and I'm giving away 300 PREMIUM CODES to celebrate our launch!  What Makes This App Special: Real-time UV tracking - Know exactly when it's dangerous AI-powered skin analysis - Personalized recommendations for YOUR skin type Smart notifications - Never get caught off guard by UV spikes 100% PRIVACY FOCUSED - Your skin data stays on your device Family profiles - Protect your loved ones too Offline mode - Works without internet connection Zero ads, zero tracking - Clean experience forever Global UV data - Accurate anywhere in the world  Perfect For:  People with fair/sensitive skin  Outdoor workers & athletes  Parents protecting their children  Anyone wanting to prevent skin damage  Travelers visiting sunny destinations  Vitamin D optimization (safe sun exposure)  What You Get: 100 codes: 6 months Premium (worth $29.99) 100 codes: 3 months Premium (worth $19.99) 100 codes: 1 month Premium (worth $9.99) All current features included Priority support Family profiles (up to 6 members)  App Store Link: https://apps.apple.com/app/id6749812045  How to Get Your Code: Send me a DM saying \"UV Guardian Premium Code Please\" First 300 people get a code! (distributed randomly)  HURRY! Only 300 codes available. Once they're gone, they're gone!  UPDATE: Will respond to DMs within 1-2 hours. Check your messages! P.S. If you love the app, a quick App Store review would mean the world to me as an indie developer!", "target": "negative"}
{"text": "Im building a coffee syrup brand with single-serve stick packs. Flavors are testing well, but Im struggling to find a co-packer. Most places Ive reached out to either dont handle liquids, arent set up for small stick packs, or require MOQs that are too high for me at the moment. Anyone have advice, connections, or recommendations for facilities that can handle liquid single-serve products or how to go about finding a copacker?", "target": "positive"}
{"text": "I am looking to find a google sheets spreadsheet template for my companies financials and hoping to save the time (and learning) of making one. I see there are tons of templates you can purchase but want to see if I can get some recommendations before buying 10 and hating them all lol. Basically just have a home page with all the big picture financials, then have sheets for the jobs we do and equipment we used to track costs of jobs, as well as payments we have received. Id assume this is basic but honestly idk. We are a solar company, so wed like to be able to track a lot of different equiptment separately (same sized job can have way different equiptment requirements), and be able to see profit margin, and all that other stuff. If anyone has some recommendations on ones they have purchased, or if itd actually better to bit the bullet and make it myself, Id greatly appreciate it!", "target": "positive"}
{"text": "A friend of mine is an avid iPhone user and due to being both deaf and blind, cannot always access the store to search for apps the way I can. I, however, am a die hard Samsung user as my apple ID has been locked out since moses as in Egypt. But I figured y'all seem smart so maybe you can help me find something. She is looking for an app that will allow you to input you original mortage amount, the interest, the min monthly payment, the remaining amount, and then what you actually pay and it will countdown to your final payment. So like if I put $300k was my original, and I have a 6% APR, I have $173k a $1500 a month payment, and I pay $2000 instead, you will have your mortage paid off by April 2036. All these numbers and figures are made up, obviously, so... She can't find something like that and in looking in the play store, nothing seems right either. Does anyone know of anything that does that? She'd also like for the chance to change the figure every once in a while. Like \"Oh, you paid $50 more this month? You now shaved xyz time off your mortage.\" Even the option to 'What if' it too. Like \"What if I paid $50 more for the next year? Oh, that'd save you 2 months and your mortage would be paid off by 123 of 2036 insead.\" I have access to an iPad if I need to download and verify, but it's my son's and he hates letting others use it (wonky screen). But if I can get enough ideas, I'm sure letting me use it for a bulk and then not need to bug him again can be arranged. I also have some coding ability so making one might be an option. Thoughts?", "target": "positive"}
{"text": "It doesnt really have to be an app. It could be a website, software, etc. I prefer stuff that is open source too for privacy reasons.", "target": "positive"}
{"text": "Hi everyone! Would appreciate any recommendations for an app that meets these fairly tight specifications. I have always wanted to be able to store some of the AI runs that I do in a place that I can access at my own leisure and retain for later - splitting up the prompting and running and reading processes into separate elements. I've managed to build out some nice workflows in N8N for doing precisely this: For capturing prompts with voice I use Voice Notes; run that into an agent and then \"put\" it in places (a database for posterity, email (for some), and a notebook). As much as I enjoy reading some outputs however I also would like to be able to listen to them using TTS, What I'm looking for therefore is an app that meets these criteria for Android: - You can create notes or save text programmatically, hence the API endpoint that I can integrate into my n8n workflows - On-device TTS with a good variety of natural sounding voices - The ability to play through your saved notes in chronological order and in a seamless process that would emulate a podcast with automatic skipping from one saved note to the next. Anything that does this?", "target": "positive"}
{"text": "All of my small business deposits have gone through Novo until my account was hacked 3 weeks ago. They bypassed multi factor authentication and came in as an untrusted device. $2500 of fraudulent transactions were taken from my account, leaving me with zero dollars. I changed my email address (which is also the username) and the password too. They managed to login again and change the email address! The security features on Novo suck immensely! There is no way to view or kick out suspicious devices like you can with other banks. Also the username is your email address, which is public information, easy to find out. If you call the fraud department they authenticate you by asking very simple questions like your name, email and business name. No security questions, pins or one time passwords. Way too easy to bypass security messages by simply calling. I didnt get hacked or phished so I do not know how else they gained access other than using Novos lax security. I got my money back but seeing as they are not a bank technically, I consider myself fortunate.", "target": "positive"}
{"text": "I run a small business and have been talking with a few owners lately. What surprised me: a lot of their worst reviews werent about the doctor at allit was the first touch. Stuff like great service, but nobody called me back or phone rang forever. It made me look at my own setup and wonder how many leads I fumble just because Im slow to reply or juggling too much. For those running salons/spas/contracting/clinicshow do you keep calls/messages from slipping through the cracks? Hire more staff? Rotate duties? Something else that actually works? Im building software to deal with this, and Im testing it with a few other SMBs. Happy to open it up free for a few more if anyones curious and is willing to give blunt feedback. Mostly curious how youre handling it, so I dont over-engineer the wrong thing.", "target": "positive"}
{"text": "I have my own website and I have shops that make the products and sell them, and I want to sell on my own website, but Im at a loss? No matter how much research I put into this, I feel like I can only understand the creative process and not the actual business process I know about conventions and art markets but havent been apart of any out of fear that my art doesnt match the right vibes? I work with various mediums in traditional art, as well as digital art. Conventions usually have digital art (mostly fanart  which I have some, just not as much as my original art), whereas art markets have usually consisted of ceramics, clothing, and jewelry. Id also like to be able to occasionally have more control over selling my art through my website/Ko-fi/Etsy because I think its nice whenever I receive art from other artists who include thank you notes and small freebies and business cards. But, I dont really understand shipping and packaging, or sales tax, and even less when it comes to international delivery Ive only made a handful of sales over the past few years, and social media became a detriment to my health and Id prefer to not go back, not unless I feel confident that it wont put me in a bad place again. But without that, theres not much marketing I can do unless theyre in person That said, I have no clue how small business Anything works. When should I register as a small business? How do small business taxes work? What requirements do I need to meet? Should I be making a specific amount of revenue each month, or each year? Are there benefits to register as a small business if I dont really make much sales? Or would it be better to hold off until I get more sales? Or am I required to have my small business registered before attending in-person events? What other paperwork should I expect? How do you motivate yourself to work on your small business when you already dont have any money outside of survival money? I know Im at the part where I just take the jump but Im scared that Ill end up losing more money than I can gain and Im not in a position where I can risk that Im sure theres more questions that Im missing, but I would highly appreciate anything and everything that can help me understand any/all of this better", "target": "positive"}
{"text": "Hi all. Ill make this short. I recently upgraded my iPhone. For years, I was using an app called Vault to keep track of my expenses and income. The app is no longer available on my upgraded phone. I liked the simplicity of the app, the fact that you could easily edit your balance, and it even had a calendar that would display your balance just before payday. It was really easy for me to look at and see when I could be frivolous. Just curious if anyone has recommendations for something similar. For reference, I uploaded a screen shot of the app that I was using. Thanks again", "target": "positive"}
{"text": "Hi. I have a boutique Pilates studio in brooklyn thats been open for 3 years. Its a 50/50 LLC with my business partner and until this point weve mostly just been seeing our own private clients in the space. Were both caretakers (I have two kids & she is taking care of her ailing mother) and are each only available 3 days out of the week and almost completely booked up. We have a few renters that utilize the space but for the most part the space (which is beautiful) is underutilized. One of our current renters wants to start seeing 8-10 clients a week and I cant decide wether it would be in my best interest to keep her as a renter at $30 an hour and have her bring her own people or hire her as an independent contractor and have her schedule open in our books. Is it complicated to have an independent contractor? What do I need to be aware of? Im not quite sure what shes charging her clients now and what she takes home after paying me the rental fee. I want to offer a good rate and also want to grow my business. I think a lot about people looking for availability on our website only to find me and my partners very limited schedule. I want more people in the door and want the space to be used but am nervous about taking this plunge. Also, my partner isnt really into the idea because she thinks itll be too much work. Help please!!!!", "target": "positive"}
{"text": "I have a really hard time waking up, like will turn off the alarm in my sleep, wake up exhausted, tried every app hard. Does anything like the title exist?", "target": "positive"}
{"text": "I recently built Habstick  a very minimal habit tracker. The idea was simple: most habit apps today feel like social media platforms. Too many ads, logins, data collection, leaderboards, and endless distractions. I just wanted a clean space to track habits and stay consistent  without giving away my privacy. So Habstick doesnt need logins, doesnt show ads, and doesnt track your data. Google Play Link : https://play.google.com/store/apps/details?id=com.habit.habstick Medium post about the journey : https://medium.com/@rishad2002/why-i-built-habstick-a-simple-habit-tracker-that-respects-your-privacy-72c1ef545e1a Would love some honest feedback from people here. If youve ever felt like habit apps were more about engagement metrics than actually helping you improve, this might resonate.", "target": "negative"}
{"text": "I built this app to solve my own problems  being overweight and struggling with focus. It combines a Pomodoro timer with a counter for basic workouts. A special twist is that if you leave the app while the Pomodoro is running, youll face an exercise penalty when you come back. I decided to lower the lifetime plan price for a short time so more people can try it out. Hopefully, it can help solve your problems too.", "target": "negative"}
{"text": "Hey (; Built a tool for small and medium app teams who dont have time & budget for ASO. You just paste your App Store or Google Play URL and it instantly gives you clear improvements for your keywords, titles, screenshots, and more. No need to spend 20+ hours researching ASO and playing with keywords. So far results have been insane with 3 beta tester apps (both on android & ios). Need to fix a few things, once it's done I'm launching it to the public. Sign up here: https://forms.gle/DgezmSzQ3qfe68SP9", "target": "negative"}
{"text": "Some new features in the app Hi everyone. Im an indie Android developer, and I built All Status Saver , an easy-to-use app for HD compression and auto video splitting. If that sounds useful, Id love for you to try it. Im offering 3 months of Pro for free (normally $2.97/month). How to redeem Download the app:  https://play.google.com/store/apps/details?id=downloadstatussaver.saver.storydownloader.savewhatsappstory.whatsapp_story Promo codes: UAYJNHSHS1LGVPZMU9Z1LWD | 68DQE0G4A4HH0PE7S89EJL5 | PM2EUW538YU8NMRQ4YLKMD6 | ZKBDL4V7P9D36PP0ZBN9E0H If the above promo codes have all been redeemed, kindly let me know. A short review would mean a lot. Im happy to answer questions or walk through features. Thanks!", "target": "negative"}
{"text": "Hi! Just dropped Ctrl+Neck - a simple tracker for desk workers dealing with neck pain from too much screen time. 4 recovery phases, daily exercises, posture reminders with personality (sarcastic, funny, chill, motivational). 100% offline because your neck shouldn't need WiFi to feel better. I've built it for developers, designers, gamers - anyone who knows the \"why does my neck hurt\" struggle. Personally, I'm doing some of those exercises regularly, because my neck is in pain. Feeling better. I'll update app with more features and bugfixes, as my tracker apps are finished I think. It is a fresh release, so, need to work on it. So, stay tuned for updates / fixes! iOS: https://apps.apple.com/us/app/ctrl-neck-fix-neck-pain/id6748936785 Android: https://play.google.com/store/apps/details?id=com.trifoiltrailblazer.ctrl_neck", "target": "negative"}
{"text": "Can you recommend a earning app that really pay a money. App that can pay in just one week just badly need it for my fur baby medicine.", "target": "positive"}
{"text": "Can you recommend a earning app that really pay a money. App that can pay in just one week just badly need it for my fur baby medicine.", "target": "positive"}
{"text": "I made an app that makes it incredibly easy to create stunning mockups and screenshots - perfect for showing off your app, website, product designs, or social media posts.  Features Website Screenshots: Instantly grab a screenshot by entering any URL. 30+ Mockup Devices & Browser Frames: Showcase your website/app on phones, tablets, laptops, desktop browsers, and more. Fully Customizable: Change backgrounds, add overlay shadows, tweak layouts, apply 3D transforms, use multi-image templates, and a ton more. Annotation Tool: Add text, stickers, arrows, highlights, steps, and other markup. Social Media Screenshots: Capture and style posts from X - great for testimonials. Chrome Extension: Snap selected areas, specific elements, or full-page screenshots right from your browser. Try it out: Editor: https://postspark.app Extension: Chrome Web Store", "target": "negative"}
{"text": "Ive built a social media app that connects people who share similar interests through social clubs. Im testing the app and currently only on iOS Let me know what you think of the experience", "target": "negative"}
{"text": "About Travy: Just launched Travy, a one-of-a-kind travel app that instantly creates detailed itineraries based on your time frame and budget. Whether you want the cheapest option or a luxury experience, Travy finds flights, hotels, restaurants, car rentals, events, and more. Go through the paywall at the end, select the subscription, and it will show as $0 for the next 48 hours. Lock in lifetime access while its free. Looking for feedback  Any feedback on app usability, design, or anything that doesnt feel quite right . Suggestions for new features or improvements . General thoughts on your experience using the app .", "target": "negative"}
{"text": "Build a compelling onscreen experience by combining your media, timed segments, and musicthen project it to an external display with beautifully scaled typography and smooth transitions.Bring order and energy to any session: welcome your audience, run slideshows, keep segments on time, and set the vibe with Apple Musicdirectly from your iPhone or iPad. (Download here)[ https://apps.apple.com/app/id6748536230\\ ]", "target": "negative"}
{"text": "When I was 25 I moved to San Francisco with 2 friends to build a startup. We had no money, no network, no nothing. At one point we were literally sleeping on the floor of a co-working space and waking up before the cleaning staff came in. (Yes kinda shameful, but also kinda funny looking back). Our tiny accelerator gave us 50k. We stretched it for a year. At the end there was only $2k left in the company account. My cofounder and I met with our mentor and told him: thats it, were done. He looked at us and said: 2k is enough for 2 plane tickets back to Europe. Or its enough to do something bold. Up to you. I was 99% sure I was going home. The next day, out of nowhere, a top VC partner tweeted she was looking for the TikTok of jobs. That was exactly what we were building. Through a random intro, we got a meeting with her. We went to their office (first time in my life sitting across from people whose names Id only seen in TechCrunch). The meeting went meh. No big fireworks. She gave us a copy of Ben Horowitzs book and said the classic well be in touch. Two days later Im in an elevator and another VC casually says: Congrats guys, heard the news. Im like what news?? He smiles: youll see, check your email. Turns out the big fund had scheduled us for a full partner meeting. Ten partners around the table. We even crossed paths with Marc Andreessen and Ben Horowitz in the hallway. We pitched. Crickets. Almost no questions. Next day: rejection. But heres the wild thing: apparently when a huge fund like that meets a tiny unknown startup, every other VC in town finds out instantly. Even though we got a no, it created a FOMO wave. Suddenly doors opened everywhere. Within 6 months we raised $1.5M, and a bit later another $6M. Lesson: never give up until the very last minute. The no that crushes you today can be the domino that makes others say yes tomorrow. That experience bought me a few extra years in SF until COVID hit and I moved to NY. Fast forward to today: Im building again. Different space this time. We help businesses get organic traffic for free and rank high on LLMs (think ChatGPT answers). Its self-serve, B2B, and somehow in less than a year more than 1,000 companies are already using it. Multi-millions in revenue, growing crazy fast. Funny enough, I can now email those same VCs directly, and the convo is completely different. They dont invest in tools like this anymore (no defensible moat, distribution > product, etc.). Which I actually kinda agree with but still ironic after everything. Anyway, just wanted to share because 25-year-old me almost gave up with $2k left and a plane ticket home. Sometimes the biggest turning point comes the day after you think its over.", "target": "negative"}
{"text": "hi guys, recently starting up my small business. im rlly worried abt trademarks and copyrights etc.. i had a logo design.com made. i didnt purchase anything regarding to ownership, i took the general idea of the logo and changed it up on my ipad (cut out certain things, added my own) does design.com still hold ownership to it? or since ive changed things is it an own original thing? thank u!", "target": "positive"}
{"text": "To be clearer (cause I didnt know how to say this in a condensed title), Im an artist and I was hoping to find an app that is on in the background that can produce sketch/marker/pen/crayon etc sounds when my Apple Pencil touches the screen? I know theres an actual cover I can apply to my tablet that will always produce a sketch noise. But what I seen was incredibly expensive and limited to just sketch sounds.", "target": "positive"}
{"text": "Im working on an early-stage startup (pre-seed / idea stage)  were building decision intelligence software for enterprise institutions. Right now Im looking for a co-founder who: - Has experience with Data engineering. - Actually enjoys building from scratch (0 1 phase). Youd be leading engineering as the team grows. You wont need to touch finance, sales, or business ops -Ive got that covered. Your lane is tech + product. Whats in it for you: - Co-founder role + equity (not a hire) - ownership over the tech vision and architecture from day one. - Working on tough problems with real enterprise impact If this sounds like you ( or someone who'd think would be a fit ) - DMS are open", "target": "positive"}
{"text": "Hi all, I built a desktop app that can allow you to call chatGPT and get response directly pasted onto your text editing field without having to constantly switch back and forth between windows. No browser plug-in, no app integration required. you can use it in literally in any app on windows treat anywhere you are typing as chatGPT and you can write your prompt you can add your own context for AI to take into consideration you can DIY re-usable prompt short cut Opening this app for preview release, sign up here if you are interested: https://alacrify-ai.com/", "target": "negative"}
{"text": "I have an assignment to create a specific Retool app, and I'm very lost! I'm a complete novice, and learning has been a bit overwhelming. If anyone has experience with Retool (low/no code online app builder) and is looking for a little $$ DM me and i'd LOVE set up a call today", "target": "positive"}
{"text": "Hi everyone! I'm excited to share that Flag Quiz Master is now live on App Store! If you love geography, trivia, or just want to learn more about the world's flags, this app is for you. I built it as a fun way to test and improve your knowledge of country flags from around the globe. App features: - Multiple game modes (Classic, Time Attack, Daily Challenges) - Different difficulty levels to match your skill - Track your progress and achievements (work in progress lol) - Learn flags from 195+ countries It's 100% free ! Here's the app link: Flag Quiz Master on App Store Would really appreciate if you could check it out and leave some feedback! As an indie developer, every download and review helps tremendously", "target": "negative"}
{"text": "Do you use a blocker, to stop your apps snooping on you got your details ? Any other good ones out there ?", "target": "positive"}
{"text": "Edit that stupid auto correct lol its supposed to say construction app  Hey, Im going to be tackling a hand full of home repairs and Im looking for an app that is free or cheap that I can basically use to plane out step by step what I need to do. Also having an area that has. Shooing list that I can add the supplies I need and keep track of multiple projects. I always end up forgetting something. I looked in the App Store and most of the apps are more advanced construction management apps for someone who manages a construction site. Any ideas? And yes I know I can just write it down or make a spreadsheet but I would really like something user friendly for made for DIYers.", "target": "positive"}
{"text": "I don't know how well you remember how you felt when you discovered the internet for the first time. Or when you got your first smartphone and went to the app store to download a hundred different apps and games. Or how it felt when you found something online that was niche but beautiful and meaningful to you. Something that felt personal. Something that forged a connection with you. I've felt a lack of this emotion / feeling of novelty / discovery over time. As the internet became more larger, commodified, and corporatised, these tiny, personal corners of the internet slowly disappeared in obscurity. Eclipsed, so to speak. It's a problem of scale. Of algorithms. How do you penetrate deep into the internet to find something niche anymore when your only gateways are search engines and algorithms that promote only the most visited and popular places first? \"Relevance\" they call it. But what's relevant to you? So there was this one problem as mentioned above, and there were other problems too. The problem of privacy. The problem of pinterest going down the drain. Banning users en masse. Around the time all this was happening, we also experienced, with dismay, the failure of the game \"No man's sky\" which promised to help recapture this familar feeling of discovery / novelty. What went wrong there? I thought hard about all of this. I formulated some hypotheses of how a search engine can be used to facilitate the discovery of something truly novel and niche and interesting and beautiful. I mean it has to be through a search engine after all. Those are the ultimate gateways to the internet. And et voil! Something clicked. The following were my observations: - whatever it was had to have a huge aspect of randomneess associated with it - it had to be related to images, not words - it had to be recursive. Like entering rabbit holes. You should be able to \"go deeper\" into any given niche. That is how Photo Pilot was born. It's not so much an app but a tool with a variety of different applications. This is how it works: It samples a random set of images from the internet. Each image leads to more images. And so on. This is how it's meant to be used: - A user executes a random search and recieves a sampling of images from the internet. - Images that evoke interest or imply a presence of something interesting on the source web page are \"collected\". After being collected they can be tagged and organised and users can visit the source webpage. - Then, these images can be clicked on to receive a new set of images that go \"deeper\" into a given niche. - Repeat The results have been stunning. Yes, there is a learning curve. But there's also a lot of potential. There's so much development that can be done based on this one concept. So far I'm glad to report 1.3k users on Google Play alone. The ios app store also has around half that amount of downloads. I've made the app in a way that respects all users' privacy. There are no user accounts or analytics. Everything is stored on an offline sqlite database. I'd love it if some of you can try it and provide some feedback. Like I said, there is a learning curve so I'll be here for support. Thoughts? :) And thank you for your time!", "target": "negative"}
{"text": "Weve just rolled out a major update to help you stay on top of your vitamins, minerals, supplements, and pills more easily than ever. Whats new in v2.0:  New input system  keyboard entry or toggles.  Apple Watch widgets rewritten for smoother performance.  Redesigned Watch scheduler for easier daily planning.  Higher item limits so you can track more supplements.  Custom notification sounds to keep you motivated your way.  Family Annual Plan now available.  Promo code redemption added.  Tutorials with Apple TipKit to guide you step by step.  Completely redesigned settings for a cleaner experience. This is our biggest release yet  crafted to make your wellness journey simpler, smarter, and more personalized.  On the Apple App Store https://apple.co/42OdSEx", "target": "negative"}
{"text": "Hello Just updated: QRForge  the powerful QR Scanner & Custom QR Code Generator for iOS! I built this app as an indie dev to give people a fast, private, and stylish way to scan and create QR codes  without clutter or data tracking. To celebrate the transition from subscription model to one-time purchase, Im running a promo offer  grab the Pro version for FREE for the next 2 days!  Why QRForge?  Scan instantly  Fast and reliable QR code scanning with smart content recognition  Create custom QR codes  Add your own foreground & background colors  Smart adaptive UI  Quick actions for Wi-Fi, links, contacts, text & more  Organized history  Keep all scanned codes neatly categorized  One-tap sharing  Save or share QR codes with ease  Private by design  Clean interface & zero data tracking What Im Looking For: Feedback on usability, design, or anything that feels off Suggestions for new features or improvements Your thoughts on how it compares to other QR code apps  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Every bit of feedback means the world to a solo indie dev  thanks for helping me improve QRForge!", "target": "negative"}
{"text": "Setting up a basic website for a small construction business and looking for an easy to use website builder that includes domain registration, templates, and ideally scheduling features. Ive tried Wix and Weebly in the past for other projects, and Im considering Squarespace since a few people I know like it for simple sites. Budget is limited, so all-in-one solutions are preferredI dont want to mess with third-party domain setups. For contractors, does Squarespace have a real advantage over Wix or Weebly? Which builder handles scheduling and mobile optimization best?", "target": "positive"}
{"text": "Ive been hearing about these native platforms that supposedly let u engage with people in a really personalized way but without actually sitting there replying to everyone manually. Like they kinda take your voice or digital persona or whatever and scale it up so you can talk to way more ppl at once. Idk if thats just marketing fluff or if there are actually tools that feel natural like I mean I get so many random chatbots in my DMs that just sound fake or generic and i cant imagine ppl really engaging with that long term. But if something could actually respond in a way that feels like me that could be crazy useful. Basically its like expanding your digital self so you can have convos at scale I guess imagine running a small brand or a side hustle and being able to keep up with hundreds of messages without losing your mind. Has anyone actually tried this yet or is it still kinda hyped?", "target": "positive"}
{"text": "Got an email from a client at 10 PM yesterday demanding a full website redesign by Monday, but they cant pay extra because its such a quick job. I spent 20 minutes explaining its a weeks worth of work, and they still acted shocked. Do your clients pull this urgent but cheap nonsense? How do you shut it down politely?", "target": "positive"}
{"text": "Hi everyone, I have a few onlibe business projects, but due to the lack of time for all businesses, I'm looking to sell some my projects. Its own turnkey software business developed from scratch. I have clients worldwide, own site, admin panel, unique software, clients panel, etc. Need advice on how to sell my projects as sefely as possible. Without scammers, time wasters, and brokers. Thank you in advance for advice.", "target": "positive"}
{"text": "I'm consulting for a small business on some operations things and he hired a \"fractional CMO\" who is providing services. As best I can tell, this CMO doesn't have any contracted deliverables, and describes herself as doing \"high-level strategy\" related to marketing. (I don't know what differentiates high-level strategy from low-level strategy.) Here's the problem: I think this fractional might be full of shit. As best I can tell, she's just feeding prompts into some ChatGPT-type platform and uncritically serving up the results. I'm not a marketer, but I've worked on enough marketing projects to tell good work from bad, and this is bad . The brand strategy is generic and indistinguishable from our direct competition; the audience segmentation isn't based on any data; there are dozens of untracked marketing performance metrics that are never discussed in leadership meetings. Just today, our agency emailed her (and CC'd me for reasons) with a simple question, and she gave two wrong answers before she gave the right one - all of which were clearly generated by a chatbot. On top of it all, she recommended and hired an agency to rebuild the company website, but without doing any prior work on audience, product, brand, or conversion strategy. It was an enormous investment and the output has been exceptional only in its mediocrity. I've noticed this really obvious deficiency, but she papers over it with a deluge of ChatGPT-generated reports, analysis, and summaries. I think she's taking the client for a ride (and charges a lot for it). How would you approach flagging this for the client without creating animosity or conflict? If the client ultimately doesn't decide to terminate this fractional, I don't want to be left having to navigate an adversarial relationship for the rest of my contract. Thoughts?", "target": "negative"}
{"text": "When I first added embroidery to my store, I treated it like a side quest. You know, Throw a logo on a cap and see what happens. I wasnt ready for it to actually outsell some of my printed stuff. Embroidery has this built-in premium feel you just cant fake. People will happily pay more for something that feels like itll survive the washing machine for years instead of cracking or fading. Even the simplest designs, a letter, a small icon, somehow feel more intentional when theyre stitched. But heres the part nobody warned me about: Production costs are higher, and you cant always pass the entire bump to customers without making them flinch. Digitization fees are the silent killer. My first month, I ordered 7 new designs through different suppliers and didnt even notice I was paying $10$15 each just to turn them into stitch files. By the end of the month, Id spent more on setup than the products themselves. Design limitations are real. Fine details that look gorgeous in print often turn into a fuzzy blob in embroidery. Gradients? Just no. Skipping samples , my rookie mistake. I once launched a hoodie with a super detailed mandala embroidery from a supplier Id never tested. On the mockup it looked stunning. The real version? It looked like someone sneezed mid-stitch. Now Im a lot more strategic: Keep embroidery for bold, simple designs, chunky text, initials, clean logos. Stick with printing for anything detailed or full-color where I want the art preserved exactly. Batch my digitization work to avoid paying fees every other week. And heres a tip from my trial-and-error phase: order from a couple of different POD companies before you commit. I grabbed samples from Printify, Apliiq, and Printful, lined them up on my desk, and compared stitching quality, thread colors, and fabric feel. The differences were bigger than I expected, and it made it clear which ones Id actually trust for customer orders. If youre thinking about offering both embroidery and printing, Id say go for it, but start small. Test a couple of embroidery pieces next to your printed ones and see how your audience reacts. For me, embroidery went from nice extra to one of my best upsells.", "target": "negative"}
{"text": "Hii! Im soon going to open my small business on etsy, however im struggling to gain traction on instagram. I usually do a lot better on tiktok than instagram and im not too sure why. Ive tried posting at different times and everything but nothing has really worked. The few likes that I get are all from mutuals and not from other people so im wondering how can I grow more? Im open to suggestions but please dont be too mean  If it helps my username on both tiktok and insta is fishie.studios", "target": "positive"}
{"text": "Im just starting out as a solo founder and I keep noticing that even small businesses need some kind of procedures  like sending the same type of client email, following the same checklist before a job, or chasing payments. If youre working alone, how do you usually handle this? Do you write your own templates? Keep everything in your head? Or just recreate things each time from scratch? Curious to hear what works for you.", "target": "positive"}
{"text": "Hi All - I'm looking for a recommendation for bank account for my llc with no monthly fees. I use BoA for my personal but want to explore other options, thanks.", "target": "positive"}
{"text": "Wanted to share with the community some of the professional developer tools completely free I use every day like; CSS Gradient Generator, Image Compressor Converter, Enhanced Color Palette Generator, Secure Password Generator, CSS/HTML/JS Minifier, JSON Formatter & Validator, Hash Generator, Lorem Ipsum Generator and many many more 100% Free - No freemium BS, everything's included Privacy First - All processing happens in your browser No Registration - Just bookmark and use Mobile Optimized - Works perfectly on phones Professional Quality - Used by agencies and startups https://creativebrain.ca/tools What other free tools you use?", "target": "negative"}
{"text": "Hi everyone, Im trying to find a way to get in touch with sellers of brand new mobile phones in Shenzhen, but Im currently outside of China and cant visit in person. More specifically, Im interested in the Yuanwang Digital Mall , especially the 3rd floor , where I heard there are many mobile phone shops. Does anyone know a way to reach them, for example: If the sellers have WeChat, websites, or online platforms where they list their products? If there is a directory or contact info available for the shops in that mall? Or if anyone who has been there recently could share phone numbers or WeChat IDs of sellers? Any tips or leads would be super helpful. Thanks in advance!", "target": "positive"}
{"text": "Wise has enabled issuing debit cards for U.S. business accounts. i.imgur .com/FCnn9e7.png", "target": "negative"}
{"text": "Hey guys! Ive been coding an appointment system application to help small and medium-sized businesses for a while now. One day, when I needed it the most, I couldn't find the right program for my small business, and that's how my adventure began. When I started this search, I realized I needed to use different programs for everything. Tracking inventory, managing simple accounting, tracking customers, and tracking appointments meant paying high monthly fees, and I also had to deal with the setup and maintenance of these things. So, I decided to create a program that would track and manage everything. When I came across this subreddit, I thought I could get the best idea from you. Long story short, I'd be very happy if you could share your thoughts on what you're looking for in a business program, what you see as missing, what would make you happy, or what feature would make you subscribe to a program. PS: I'm keeping myself anonymous to avoid advertising. Writing from a fresh Reddit account and won't reveal the name of the program. I'm new to the subreddit, so I hope I'm not violating any rules. If so, please just let me know so I can edit the certain part or delete the post completely. Any thoughts are pretty valuable to me, and thank you guys so much. Love!", "target": "positive"}
{"text": "Im selling colognes/perfumes, but i want to make a catalog that people can just go on my link and see all the products i have available and order them from me. Like a big market place. But ive already used depop/fb mp/etc. But i want to make it like a strict catalog. Were for example you want _____ fragrance, you go on my catalog and see what all I can source/get it for you. TLDR; i want to make a place order type catalog. I couldnt add attachements so i got coerced into making a imgur account to add a image. https://imgur.com/a/r09rbTI", "target": "positive"}
{"text": "Using default options doesn't work, the process stops halfway. I want something more full proof, preferably open source and offline. Maybe something akin an advanced file manager.", "target": "positive"}
{"text": "Hello Just updated: OCRForge  the lightweight, powerful Text Scanner for iOS! I built this app as an indie dev to make text extraction simple, accurate, and fast  without ads or unnecessary clutter. To celebrate the transition from subscription to one-time purchase, Im running a promo offer  grab the Pro version for FREE for the next 2 days!  Why OCRForge?  Scan with Camera  Instantly capture and extract text from paper, signs, or handwritten notes  Import from Photos  Select any image and convert it to text in seconds  Smart OCR Engine  Accurate and fast text recognition powered by advanced processing  History View  All scanned text saved for later, easy to copy or share anytime  No Ads, No Tracking  Clean and distraction-free experience What Im Looking For: Feedback on usability, design, or anything that feels off Suggestions for new features or improvements Your thoughts on how it compares to other OCR apps  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Every bit of feedback means the world to a solo indie dev  thanks for helping me improve OCRForge!", "target": "negative"}
{"text": "someone knows any apps similar to MD vinyl but for free? I would like the appearence of a vinyl record playing on my iPad. I've even researched for videos of screen recording of MD Vinyl on youtube, but it was unsucessful ):", "target": "positive"}
{"text": "Hello people, I am building a project for which i will need to generate simple 2d images for a given context per day i need to generate around 450 images daily which monthly will be around 14kto 15k images.Which image generation model api is best for this given i am just a student and have no to very little money atm i need cost effective,mid pace, simple 2d image generation Please help", "target": "positive"}
{"text": "I want a amplifier app without ads. I just need the Volume (1-1000%)", "target": "positive"}
{"text": "Okay so I'm not exactly the greatest at coding, well, in fact I can't code at all but I had a rlly good idea for an app and wanted to create it. So the ides is an app designed like indeed but just for regular ppl to find professionals or semi decent ppl in their area for small jobs like plumbing, moving things, dog watching, etc. . I mean we all know companies like to overcharge and sometimes for simple projects its an arm and a dang leg to get stuff done. But ppl closer to you like a neighbor would be far more understanding and mauluble with prices and time frame. I know it may seem kinda stupid; i mean i did say i am lol; but i just want to help ppl and i have ideas i just dont know how to create them. So I started looking at different sites that I could use and I stumbled upon an app called \"Replit\". I used it and it did somewhat decent but it's fr like 3 kids in a trench coat. It looks good from the outside like it looks nice but the actual functionality is iffy and very bad at best. I can't get the ai to do what I need it to and I need someone to help finish the coding process but I wouldn't know who or where I could find someone. So pls be nice I know I'm kinda dumb but I could rlly use the help. =)", "target": "positive"}
{"text": "Im a plumber, and Im tired of paying more and more every year for email. $130/year for one email is ridiculous, but I want to still keep a professional business email. It helps with new clients. Just curious if there are any good cheaper options.", "target": "positive"}
{"text": "A friend told me he was looking for someone to build an AI chatbot for his ecommerce business. The quotes he got were INSANE: Agency 1: $10,000 + $500/month maintenance Agency 2: $8,500 \"introductory price\" Upwork \"expert\": $4,000 minimum flat fee For a pretty BASIC customer service chatbot. Not AGI. Not some complex system. Just a chatbot that answers questions from uploaded documents(with generic design). I'm also a developer and this pissed me off enough to record myself building the EXACT same thing. Took barely 8 minutes. Cost: $0 to build (hosting is like $20/month if you need it). Here's literally all you need: Any chatbot builder platform with built in RAG. Your business docs (FAQs, policies, product info) A basic (system)prompt telling it how to behave The \"complex AI integration\" these agencies sell is literally: Drag and drop your files Write a prompt like \"be a helpful customer service agent\" Click generate That's it. That's the $10k service. I'm not saying all AI dev work is simple.. custom integrations, complex workflows, actual development work deserve it's price. But charging small businesses $10k for a 10 minute drag & drop setup? That's predatory. If anyone wants the screen recording showing the exact process, I'll post it. Just tired of seeing people get ripped off.", "target": "negative"}
{"text": "Im a plumber, and Im tired of paying more and more every year for email. $130/year for one email is ridiculous, but I want to still keep a professional business email. It helps with new clients. Just curious if there are any good cheaper options.", "target": "positive"}
{"text": "Basically title. Are you actively monitoring the cameras? How do you handle repeat thieves? Do you use AI shoplifting software? etc.", "target": "positive"}
{"text": "Hello I am a small business owner, and I have had clients asking about financing my product. I know it is possible, I have seen other businesses in my area advertise affirm afterpay klarna etc. However i called my bank where i have my clover card reader system set from they have no answers on setting up this system for me and directed me to clover support which was equally unhelpful. I was signing up for affirm and it had asked me about a platform and no one on clover or the bank could answer. (Had a lot of options like shopify and a bunch of something-commerce style stuff) I was just wondering if anyone has experience or knows somewhere to go to use this system. (Clover with affirm or in store affirm types)Honestly im okay with getting an entire new system away from clover if i need to but I think a buy now pay later system can really help my business. Feel free to ask questions if i was unclear", "target": "positive"}
{"text": "I was asked last-minute to do a deep clean of an apartment for someone hosting a special event. The place was in rough shape including a lot of mould and I was encouraged to do as much as I could to get it looking right. I brought my own supplies, worked thoroughly, and postponed other things to fit it in because I was told the rate upfront and agreed on that basis. After the job was done, the owner told me she had made a mistake offering that rate and is now only willing to pay me half. This wasnt discussed beforehand it only came up after Id completed everything. Ive tried to handle it calmly and professionally, but I feel really disrespected. Im torn because shes in my building and connected to people I know but I also dont think its okay to change terms retroactively. Would love to hear how others would handle this or what youd say in my shoes. Edit: its in writing and verbal, sent her a screenshot of her telling me the rate and shes claiming its a mistake!", "target": "positive"}
{"text": "Your News is an RSS Feed Reader with built-in support for Reddit and YouTube. It now includes RSS Widgets in medium and large sizes , so you can keep up with your favorite feeds right from your home screen. The widgets let you pick which sources to follow, adjust font sizes, change colors, and more. Other highlights include: Automatic refresh with an optional manual refresh button Navigation buttons to scroll through articles You can see the widgets in action here: Sneak peek of RSS home widgets Keep in mind that widgets are a premium feature . iOS: Your News  RSS Feed Reader Android: Your News - RSS Feed Reader Learn more: yournews.app Join: r/yournewsapp", "target": "negative"}
{"text": "A friend told me he was looking for someone to build an AI chatbot for his ecommerce business. The quotes he got were INSANE:Agency 1: $10,000 + $500/month maintenanceAgency 2: $8,500 \"introductory price\"Upwork \"expert\": $4,000 minimum flat feeFor a pretty BASIC customer service chatbot. Not AGI. Not some complex system. Just a chatbot that answers questions from uploaded documents(with generic design).I'm also a developer and this pissed me off enough to record myself building the EXACT same thing. Took barely 8 minutes. Cost: $0 to build (hosting is like $20/month if you need it).Here's literally all you need:Any chatbot builder platform with built in RAG.Your business docs (FAQs, policies, product info)A basic (system)prompt telling it how to behaveThe \"complex AI integration\" these agencies sell is literally:Drag and drop your filesWrite a prompt like \"be a helpful customer service agent\"Click generateThat's it. That's the $10k service.I'm not saying all AI dev work is simple.. custom integrations, complex workflows, actual development work deserve it's price. But charging small businesses $10k for a 10 minute drag & drop setup? That's predatory.If anyone wants the screen recording showing the exact process, I'll post it. Just tired of seeing people get ripped off.Upvote0Downvote7Go to commentsShare", "target": "negative"}
{"text": "One week ago I launched photo2calendar+ , an app stupidly simple but apparently exactly what ppl were looking for. You snap a photo, or upload an image, and the AI detects the events and adds them into your calendar, a real time saver for those who use the calendar a lot but still have many stuff written on paper or screenshots.I launched the app with 3 revenue streams, ads on generation, a lifetime subscription at discounted price, and a super cheap monthly plan.I did some marketing here on reddit and got mostly 3 types of comments,positive feedback from normal users who liked the ideasolid feedback from tech ppl who gave me advices on landing, pricing and featuresfeedback from frustrated users who, since they cant build something ppl want, spend their time here calling others scammers. but here is the truth, and tell me what you think, Im ready for a rain of shit if needed.The biggest critic I got was that the lifetime subscription price is too low to be sustainable, so I must be a scammer who wants to cash quick and then abandon the app. maybe, and I say it with a bit of arrogance, Im just someone who knows how to do the math and define strategies, I prefer to share them here rather than being called scammer, so here it is,the problem my app solves will be integrated on device by android and ios very soon, ios already does it with apple intelligence on iphone 16, so what Im selling as lifetime is actually more like 2 years max, its not a scam its just understanding the market and betting on timingthe average free user watches ads, turns out that the average revenue of a video ad on my app is about 30x the cost of a generation, this means one free user can pay for around 30 subscribed users, so if math is not lying, keeping 1/30 paying conversion rate makes the app sustainable and subs are just pure extraif point 2 fails, cpm not stable, higher conversions, uneven usage, I have fallback, the price of one lifetime sub covers about 400 generations, even if a user would generate once every day (stats say less), that would cover more than a year and ads would cover the restI dont think Ill be rich with this app, probably make some hundreds or maybe just break even, but Im tired of being called scammer by ppl who dont understand the strategy, so now you know everything, reddit heroes, what do you think?Happy to hear feedback, constructive critics and opinions on this plan.", "target": "negative"}
{"text": "10 years ago, I was 25 and convinced Id be a millionaire by 30.I consumed all the hustle content Gary V, Grant Cardone, you name it. My diet was coffee, podcasts, and self-loathing.I started a small e-commerce store with literally $1,200 scraped from my savings. The first year was brutal: 80+ hour weeks, no vacations, constant stress. But it worked. By year 3, revenue hit $1.2M. On paper, I was living the dream.Heres the catch:I didnt see my friends for months.I was 40 pounds overweight.I once missed my moms birthday dinner because I was negotiating a $3,000 wholesale deal (that later fell through).My relationship ended because I was married to Shopify, not her.Financial breakdown (for the curious):Year 1: $36k revenue / $12k profitYear 2: $400k revenue / $85k profitYear 3: $1.2M revenue / $210k profitYear 4: $850k revenue / $120k profit (market shift + burnout = decline)Whats wild is that when I finally made it (six figures profit), I felt worse than when I was broke.I had money, but no life.The turning point was honestly embarrassing: I ended up in the ER at 29 with heart palpitations from stress + caffeine. The doctor literally said: Your business is killing you faster than poverty would.So I pulled back.Hired a real team instead of trying to be Superman.Sold off part of the company.Built slower, but more sustainably.Now Im 35. Net worth is ~$2.4M (mix of business equity, real estate, and cash), but the real win is that I sleep 8 hours a night, spend time with my kid, and dont check Slack at 3am anymore.Lessons I wish someone had drilled into me earlier:Revenue  happiness.Profit  freedom (if youre chained to the business).Grinding works, but it also grinds you.Hire sooner than you think.Family and health compound faster than money.Im sharing this because I see a lot of people here asking for the magic pill or obsessing over hitting $1M. I was that guy. The million is great, but if you dont design your life first, youll hate the life you sacrificed everything for.Question to the sub: For those of you who made it (whatever that means for you) did it actually feel like you expected? Or did you have to re-define success too?", "target": "negative"}
{"text": "8 months ago, I launched a database that analyzes real user problems from multiple sources to help founders find their next profitable SaaS idea. It's basically been my obsession for months, and it's actually working.A few months back, I came across this (now deleted) post about someone who worked at a hotel and noticed a flaw in the hotel's software. They ended up building a plugin to fix it... and made a nice side income from it. That got me thinking: How many other overlooked software problems are lurking out there, waiting for a solution?I wanted to help entrepreneurs skip the guesswork entirely. If users are complaining about something enough to leave negative reviews, there's likely a market for a better solution.Here's what I built: I analyzed over 150k negative G2 reviews from 8k+ companies, 50k negative App Store reviews from 5k+ mobile apps across 160 keywords, and scraped thousands of Reddit threads where people actively complain about existing tools and missing features.For G2, I used AI to find specific user problems with existing software that could be turned into full competitors or lightweight alternatives.For the App Store, I analyzed reviews across categories like period trackers, meal planners, photo editors, and travel apps to identify what users hate about current solutions.Everything is organized by category and company so you can drill down into specific issues users have with certain tools, or scan real problems across entire industries. You're literally searching through validated problems that people are already paying to solve.For Reddit, I found threads where users are actively discussing broken workflows and feature gaps in popular tools.The results so far:-20,000 people visited the site-1,500 signed up-60 paid customers-$4,000 earned in just these 2 months-$20,000 total since launchNot life changing money yet, but it feels incredible. It's proof that people will actually pay for something I built if I provide real value. It's been tough watching other projects blow up while mine grew slowly (really slowly). I failed flat on my face 8 times before this. But I've learned that consistency absolutely beats going viral once and getting lucky. To anyone building something and feeling invisible: keep iterating. Keep solving real problems. The data doesn't lie - if thousands of users are complaining about the same issues, there's an opportunity there. If you're building or improving a SaaS, this system might save you tons of market research and potentially give you the last product idea you'll ever need. Keep buildingHeres the link if you want to check it out: BigIdeasDBand heres the proof (since its reddit lol): Proof", "target": "negative"}
{"text": "Ive been a lurker here for years, and I finally have a story to tell.A bit about me: I'm 35, and for the last decade, I've had a comfortable career as a Senior SWE at one of the Top 5 tech companies. The pay is great, the work is challenging, and I'm grateful for it. Like many of you, the idea of building my own SaaS has been a persistent daydream for ages, but it never went beyond notes and domain name registrations.That changed about two years ago. My dad lost his job, and my parents, who are incredibly proud people, started to struggle financially. I was in a position to help them with my salary, and I did, but I could tell it wasn't a long-term solution they'd ever be comfortable with. They needed purpose and independence, not a handout from their son.So, I had a different idea. I decided to start an e-commerce business for them centered around custom home decor. I bought a simple machine, set up a website, and taught them the ropes. To my amazement, it took off. What started on a workbench in their garage has now scaled to a small 150m2 factory with 4 employees. Both my mom and dad work there, and my brother recently joined them. It generates a real, decent monthly salary for them, and I don't take a penny. Watching their stress melt away and be replaced by the pride of building something has been one of the most rewarding experiences of my life.But here's the part for this sub: Building that e-commerce business was HARD. As a software engineer, I was naive about the sheer number of non-technical obstacles. I wrestled with everything from clunky inventory management and supply chain logistics to inefficient marketing automation and customer service workflows. I found myself constantly saying, \"There has to be a better way to do this.\" I was stitching together five different tools, writing custom scripts, and still felt like I was operating with one hand tied behind my back. These pain points became my obsession. A few months ago, I started working on a SaaS to solve the very problems I faced.And this is where things get wild. AI has completely changed the game. I'm still at my full-time job, so this is a side project. Yet, my development velocity is unlike anything I've ever experienced. With the help of AI tools for code generation, architecture planning, and debugging, I'm not just building faster. I'm building smarter. I'm on track to have a V1 of my product ready in about 6 months. This isn't just a simple tool. I'm building a platform with a core feature set and level of sophistication that I see in established, public companies valued in the $5B - $8B range.It sounds insane for a solo dev on a side project to even say that, but that's the seismic shift that's happening. The barrier to entry for building complex, powerful software is crashing down. What used to require large, specialized teams is now becoming accessible to a single motivated person.I wanted to share this because my journey into entrepreneurship was accidental and born out of a family need. But it showed me a real-world problem that I'm now passionate about solving. And the tools we have access to today are making it possible to build solutions that were unthinkable for a solo founder just a couple of years ago.", "target": "negative"}
{"text": "Hey everyone,Ive been deep in the cold email game for a while and recently scaled to ~700k emails per month. I figured Id share the stack Im using, along with honest pros/cons of each tool, since I see a lot of people asking how to do this at scale without burning domains or killing deliverability.Data SourcesApollo  Great for bulk lead lists. Easy filters, tons of data, and the integrations are solid. Downside: quality can be hit or miss depending on the industry. I still double-check higher-value accounts.LinkedIn Sales Navigator  Not really built for scale, but still one of the best for targeted outreach. Perfect when youre going after decision-makers and want accurate, up-to-date job titles.Email VerificationBrandNav  Honestly one of the most important parts of my stack. If youre sending this volume, you cannot afford high bounce rates. BrandNav cleans lists quickly and Ive seen better deliverability since using it.Inboxes PuzzleInbox (Google Workspace)  Makes managing and rotating inboxes smoother than doing it manually. Helps avoid the \"all your domains burn at once\" problem.Slicey (Outlook 365)  Similar to PuzzleInbox but for Outlook. Having both Google and Outlook accounts in my stack assist with deliverability.PersonalizationClay  When the offer justifies it (e.g., high-ticket B2B), Clay is a beast. You can enrich data, pull insights, and generate personalized snippets at scale. For campaigns where volume is more important than custom touches, I keep it simple with dynamic merge tags.Sending ToolInstantly.ai  The backbone of my sending operation. Handles inbox rotation, warmup, and sending logic automatically. Super clean UI, fast to deploy campaigns, and the deliverability features make it worth it.At this scale, the real challenge isnt just sending, its keeping deliverability healthy. The key lessons Ive learned:Diversify inboxes (both Google & Outlook). Clean data relentlessly (never skip verification). Dont overdo personalization unless it directly impacts ROI. Monitor metrics daily (open/reply rates, bounce rates, domain health).Thats my stack. Would love to hear from others running 100k+ emails/month  what tools are you using for inbox management or list cleaning? Always curious if theres something better out there.", "target": "negative"}
{"text": "I thought Id get 1,000 users on launch day. Reality check: I got 4. Heres how I clawed my way to 100 in 2 weeks.The excitement surrounding launch day is exaggerated. People rarely show up unless you actively pull them in. However, after two weeks of relentless effort, over 100 individuals were using my tool, and we received a Featured badge from Google.Here are five strategies that proved effective:Responding to complaints on Twitter. I searched for tweets saying I dislike managing XYZ and suggested my product as a solution in my replies.Reddit posts focused on problems first. Rather than simply sharing links, I outlined the issues I was addressing, and only after people expressed interest did I provide the link.Joining an early adopters Slack group. I became part of a makers Slack and shared my experience, leading to 20 people immediately trying my tool.Creating an email drip campaign for the waitlist. Instead of merely launching, I sent tips to those on the waitlist via email and gently encouraged them to test the product.Encouraging early reviews. I openly told users: Your review could help secure a Featured badge, and it was effective.If youre experiencing anxiety about growth, concentrate on one authentic channel. Thats sufficient to get started.", "target": "negative"}
{"text": "Earlier this summer I sold about $420 worth of home dcor items through my shop. Everything was legit. Tracking showed delivered, I even had emails from the buyer confirming they received the package and were happy with it. A month later I still got hit with a chargeback for unauthorized transaction. The funds were frozen and I spent days piecing together evidence stressing over this whole ordeal, plus submitting the whole evidence and waiting days for an answer.This stuff is very annoying and it really gave me a hard time, I'm fairly new at this stuff and 400 being frozen or potentially lost because some AH decided he wanted MY PRODUCT for FREE is terrifying. I've decided on the more streamlined approach since then and I've never felt better with everything being automatically collected and submitted. I need to know how I can manage a little better and maybe deal better with my customers because that's something that I'm still not very good at. I would appreciate any tips you might have, thanks for listening to my rant.", "target": "positive"}
{"text": "So it's time to be completely honest. I've been doing side hustles online for about 15 years I have made a little bit of money, I've never made a lot.I've looked into a lot of things, as time goes on most things are scams. I've had so many friends that call themselves online gurus and what's not and it's just bs. They're just trying to get people to get the money well never actually producing a product themselves.That being said the legitimate side hustles that did exist have mostly been eradicated.It's a problem, freelancing is getting decimated by artificial intelligence and it's just going to get harder.We need to be honest about this.I was horrified to assist some people in this community to try to apply for thousands of different gigs and jobs online and for all of them to get rejected except for one or two.It's extremely hard out there and it's time to be transparent..", "target": "negative"}
{"text": "AI is speeding things up. Frameworks are abstracting everything. And beginner/intermediate devs are skipping the hard parts not because theyre lazy, but because the tools make it feel like they dont need to learn them.No real debugging. No understanding of the DOM. Just copy-paste, deploy, and hope the AI was right.Were building sites that look fine but break under pressure. Were shipping code we dont fully understand. And were getting confident before were competent.Drop your dev wake-up calls, your I thought I knew what I was doing moments, or the one thing you wish youd learned earlier.", "target": "negative"}
{"text": "I'm a solo founder and I'm wearing all the hats. I feel like I'm working 16 hours a day but not making enough progress. I think a lot of my time is getting sucked into a black hole of emails. How can I figure out where my time is actually going?", "target": "positive"}
{"text": "Hello Redditors.I would love some feedback about this web app I just launched. It allows anyone to verify before they purchase anything 2nd hand if the item is listed as lost, stolen, or safe to handle. safeorstolen.com Check VIN, IMEI, and serial numbers in real-time at safeorstolen.com Please visit the site and give me your thoughts.", "target": "negative"}
{"text": "I found a way to remove all negative reviews on all plattforms in minutes! The question now is, should I keep it for myself or sell the method? I created a gumroad offer and I think(!) they cant fix it. What do you think? And what do you think is a good price for this?", "target": "negative"}
{"text": "around a year ago i wanted to take a gap year, to learn how to code and build apps.my dad slapped the shit out of me.told me shut up and go to college like every other person.well, i didn't...ended up sleeping on a bench in a park and walking 1hr everyday to the libraryfast forward 9 months: i built the best all in one study app out there: studytype.lolthere is literally nothing you can not do on studytypejust upload a material, and get notes, flashcards, practice tests, mind maps, stories, podcasts, answers.EVERYTHINGits basically free rn but i probably have to start changing it soon.so check it out: studytype.lol", "target": "negative"}
{"text": "6 weeks ago, I launched a tool called Tydal. It's a Reddit marketing tool that generates leads for you and helps people get customers from Reddit. It has basically been my primary marketing method, and it's been working great for me.It's literally just enter your product description  wait 30 seconds  dozens of potential customers.I launched it 45 days ago.Today:- 5000 visited the site- 212 signed up- 11 paid- $277 earned in totalNot life-changing money. But it feels amazing.It's proof that people will pay for something I made. That I can be a founder.Its been hard watching others go viral while I stayed invisible. But over the past month and a half, I think I've learned that consistency beats going viral.To anyone whos building something and feeling stuck: keep posting. Keep iterating. Consistency is everything.It's how I've grown and how I plan to keep growing.", "target": "negative"}
{"text": "The SaaS Boilerplate I Built After 3 Failed LaunchesI used to think my ideas werent good enough. But after my 3rd SaaS project failed, I realized the real problem wasnt my ideasit was the months I wasted rebuilding the same boilerplate over and over.So instead of starting another SaaS, I built the kit I wish I had from the beginning. I called it Indie Kit. It has multi-tenant B2B features, admin impersonation, support for multiple payment gateways (Stripe, PayPal, LemonSqueezy, Dodopayments), and the kind of architecture you usually only add after hitting scaling pain.The wild part? Its now used by 300+ devs who were stuck in the exact same cycle I was. The most unexpected feedback Ive gotten? The mentorship calls I include have been more valuable than the code itself.Curious if anyone else here has ever turned a frustration into a product that others actually needed?", "target": "negative"}
{"text": "Was really nervous about getting featured or not, but at 3AM found out we are at #2. A lot of work went in on making it the best it could be, so really thrilled with where we are at!ReadyBase is an AI Prompt to PDF solution. You can transform your intelligence into a PDF in seconds!https://www.producthunt.com/products/readybase", "target": "negative"}
{"text": "Title says it all. See a lot of bs posts across reddit about 10x this or went to 100k MRR in a month that. So I dropped a link with a screenshot for proof on how we've built our content engine and 7x'd our impressions and scaled our LLM visibility in under 90 days. Drop your company info and I can share some strategy for how you could scale as well", "target": "negative" }