{"text": "https://preview.redd.it/t96mp0zo53lf1.png?width=1214&format=png&auto=webp&s=ecd0d3b8c0f881bfd5039cf0a80545a54be5f096 I recently started programming and was thinking about what kind of useful project I could build in C++. I decided to create a lightweight and efficient text editor, and I've been working on it. So far, it only has a few basic features and some of them are still buggy, but I finally managed to get it to compile successfully. Is this a good project for someone at my beginner level? Should I continue developing this text editor, or would it be better to move on to other projects? I have built the entire app with my own code and no outside libraries.", "target": "negative"}
{"text": "hi ya'll :) this is a mental health app i'm making - my only goal is to give users the most magical experience ever. i think it can re-shape and re-wire negative thoughts and really improve millions of peoples lives. every feature im building is based on years of research that i've personally read. the audience is really anyone that wants their thoughts to be 1% better. how does the ui/ux look? any things i may not be noticing that i should improve? any mainstream ux principles im breaking? all feedback is good feedback, pls share your thoughts :)", "target": "positive"}
{"text": "Hey everyone, I'm in a bit of a wild situation and could really use some perspective. I'm a regular 9-5 employee, and for the last 9 months, I've poured all my free time into building a SaaS project I'm passionate about. I launched two weeks ago, and it's grown way faster than I ever imagined  over 1900 users and even a few paying customers already. The problem is, the user activity is so high that my server costs are scaling just as fast. At this rate, I can only afford to keep it running for another 2-3 months. Heres the main challenge: its an NSFW SaaS-based product. I know this can be a major hurdle for traditional funding, and I have no idea how to approach paid marketing. I'm just trying to figure out the best path forward to keep this alive and growing without going broke. Has anyone here navigated the challenges of a fast-growing, bootstrapped project in a 'controversial' niche? I'm open to any and all suggestions on what one usually does here.", "target": "positive"}
{"text": "Hey guys!  I just launched Quokkai.cloud . Were getting traffic and organic signups but so far, 0 conversions . Ive tested the registration flow multiple times (desktop + mobile) everything works: Register with Google Register with email + password Or email + magic link People do register, but then stop there . They dont try any of the AI gigs, even though free credits are available. So Id love your feedback: Is it unclear what Quokkai actually does? Do you find the platform difficult to use? Was it confusing what to do right after registering?  What is Quokkai? Think of it as Fiverr, but for AI models . Instead of learning prompts or switching between platforms, you just pick an AI Gig (image, video, audio, writing, marketing, etc.), adjust a few options, and get results. No subscriptions  pay only for what you use No learning curve  AI gigs are pre-prompted to deliver exactly whats shown Credits never expire  Which AI models are inside? Weve integrated 200+ AI gigs across: Visuals: Photon, BigColor, ImageGen4/3 (Google), Recraft, Flux, Quokkai Video: Kling, Seedance, Runway, Minimax, Luma (soon) Audio: Quokkai, Minimax (soon), Meta (soon), Sakemin (soon) Writing: Claude, Deepseek, OpenAI, Grok Marketing: Claude, Quokkai  Who is Quokkai for? Content creators & influencers who need assets fast Freelancers boosting productivity in design, writing, or marketing Startups & small businesses needing affordable, on-demand content Marketing teams who want easy access to multiple AI models without technical skills  How does pricing work? 1 USD = 1 credit Gigs range from $0.10  $30 Top-up packages: $10  $1,000 (with bonus credits starting $600+) No expiration  credits last until used New users get 12 free credits via the Welcome Gift Checklist  So, my main question: Why do you think people stop after signing up? Is it positioning? Onboarding? Or maybe the value prop isnt clear enough? Any feedback would really help", "target": "positive"}
{"text": "I'm wondering about how do you understood that your startup gonna fail? What was that point when you got your first signs of failure and did you did something to keep it alive? How it's been and what was wrong which led your startup to fail? Cause I think mine will...", "target": "negative"}
{"text": "I am building a SaaS product with a mobile-first approach. I believe I am using a unique method for collecting user input and presenting data based on that input. I am considering filing a patent to prevent so-called two-day AI developers from cloning my idea. What type of patent would provide the right protection? Could you also share your experience with doing something similar?", "target": "positive"}
{"text": "Hey guys, Nowadays it feels like people can build almost anything with AI, just type a few prompts and boom, youve got an app or website/platform. But Ive also seen quite a few downsides of using AI to build SaaS products: things like spaghetti code, unoptimized performance, hidden bugs, and the fact that you cant fully rely on AI if youre thinking long-term. So Im wondering is it better to just hire a developer? For context: my coding knowledge is very minimal (basically just if/else and file directories which I get to learn it in uni, since I studied electrical engineering, not software). I dont know much about tech stacks. Ive heard people say that AI can be great for quickly building an MVP before getting a proper developer involved, or even using AI to do 90% of the work and then paying a developer to polish and complete it. What do you guys think? Should I stick with AI as a starter tool, or is it smarter to bring in a developer from the start?", "target": "positive"}
{"text": "so i wanted to challenge myself and I bult a simple chatbase alternative Features so far: - knowledge based agent creation - scrape and crawl websites for knowledge - add files for knowledge - customization - playground testing - rate limits - domain lock so it works only on desired domains - custom agent instructions If anyone wants to try it out, it's cheaper than most also decent free plan if you're a small business https://asistbase.com Any feedback is appreciated", "target": "negative"}
{"text": "Hey guys, I'm a software developer who builds apps using AI, and I'm looking for a new project that actually helps people. Instead of guessing what to build, I want to ask you directly: What's a recurring frustration, a tedious task, or a minor inconvenience you face all the time? For example A repetitive, mind-numbing task you wish you could automate. An information-overload problem (e.g., \"I wish I could summarize all these articles/emails/reports\"). A creative block you're struggling with. Something that just feels inefficient or clunky in your workflow. No idea is too small or too weird. What's a real-world problem you'd love to see solved by a smart app?", "target": "positive"}
{"text": "Thrilled to launch YouTubeScribe.com! Built with pure vibe coding flow  lightning-fast UI on Vercel v0  + powerful backend using Claude Sonnet 4 . Crazy how easy it was to go from idea  launch in no time. Youtube to text for FREE  If you liked it, do share with others. And if need any other feature use the feature request. VibeCoding #NewRelease #AItools #StartupLaunch #IndieDev http://youtubescribe.com", "target": "negative"}
{"text": "Hello everyone I am building a project to launch a website for selling automation scripts for business processes. The key idea is that the website should be fully self-sustaining without manual content management. What needs to be implemented 1. A system where scripts are automatically generated by AI and published directly on the website 2. An order system that collects client requests and preferences automatically 3. An AI assistant that identifies client needs and guides them before purchase 4. A developer and manager team is already in place to support clients and handle advanced requests 5. I am looking for an AI and web development expert who can integrate backend logic AI generation and marketplace functionality into a single system Think of it as AppSumo for scripts but with 80 percent of the process handled by AI including content creation and product listings If you have experience in AI SaaS web automation or building self-updating platforms comment below or send me a message If you have worked on marketplaces or AI assistants before you are also welcome I am not only looking for freelancers but also potential long term partners Reach out if this project matches your expertise", "target": "positive"}
{"text": "In outbound, I got 150 test users in one month with a $0 budget, and in inbound, 1 with a $1,600 budget. I'd like to get it right with inbound, but I haven't figured out the right steps.", "target": "positive"}
{"text": "Hi, would love to know you you are currently building your app View Poll", "target": "negative"}
{"text": "My vision is to help job seekers not just with resumes, but with relevant job postings in one place, almost like Skyscanner for jobs. To do this, Im exploring scraping job data from large sites to display curated postings. But as I dig deeper, I realize this is a legal and ethical minefield. Has anyone here tried navigating this? What practices (if any) make scraping jobs less risky, or should I look at partnerships/APIs instead? Would love honest thoughts from other founders, solo makers, or anyone with firsthand legal/tech experience. I have skimmed through some github projects which scrape job postings and I really loved this project: https://github.com/speedyapply/JobSpy , I have integrated it and works pretty neat.. Any suggestions are apprecitated.", "target": "positive"}
{"text": "I've been a professional software engineer for the better part of a decade. I've worked on front-end and back-end production software at small non-profits and in Big Tech. I've been losing my creative spark from my professional work and decided to rekindle my curiosity by building side-projects and sharing them openly. I finally took the first step by building and deploying my personal project website. It is built from scratch. Just 1 HTML file, an Ubuntu VPS, and NGINX. No frameworks and no technical complexity (yet). It's a bit of a manifesto and represents my commitment to build in public. At this point, I still lack a clear business plan, but this still represents a huge step in actually building something and sharing it with the world. I'd love feedback from those that have gone down similar paths, or are considering it.", "target": "positive"}
{"text": "These are the most common mistakes I see. Products made for the seller, not the buyer. You might love it, but if nobodys searching for it, it wont sell. Weak or dated presentation. Poor design, filler content, or AI slop that nobody wants. Zero trust signals. Forget testimonials, theres no branding, no shop policies, nothing that says safe to buy from. Traffic wont fix these. The shops making consistent sales have all three dialed in: demand, quality, and trust. It's easy to create & publish digital products. Once you take care of these 3 things, selling them becomes much easier too.", "target": "positive"}
{"text": "I recently moved my computer behind my TV in the living room. Make the whole area the entertainment center, and I get to keep my laptop for work on the office. Problem is, I really like my keyboard and mouse, and I'd need to sit in front of the TV for this to work. I'm old-school and hate wireless things. Batteries suck. My PS3 controller doesn't need to be plugged into the PS3 to work, so that's a start, but again, I really like my keyboard and mouse, and would like to keep using them if possible. Ideally, I'd like to find a USB port with 2+ slots I can plug into an outlet, that will send the relevant signal to the computer wirelessly, so I can use my keyboard and mouse from across the room", "target": "positive"}
{"text": "In black preferably, with 5 cards in a row on top and a row of 6 on the bottom. https://ibb.co/zTNZ3C7t", "target": "negative"}
{"text": "Have we forgotten what having a personal diary is all about. Journaling is a very personal matter. It comes from within, if someone is stuck in their journaling routine. Or if someone is not doing it often doe to any reason what so ever, AI has no place in driving or motivating a person. Because, that totally defeats the purpose of putting your personal thoughts, your brainstorming, your plans on to an external medium. Its intimate and its personal. Only through personal introspective can a journal entry be truly be meaningful, otherwise its coerced, and this just so wrong. Not everything needs to have AI. On that note I would recommend one app that I have been using for almost a decade. Do checkout Daylio , the app even has its on dedicated subreddit. No AI gimmicks and no ridiculous notifications and you can disable them without worry.", "target": "positive"}
{"text": "My mind mapping tool Pathmind has really grown since first release and you wouldnt believe how it started. When i first got the idea i was really into chrome extensions and i decided why not make a mind mapping tool which people can use on a daily basis, and so i did. It was not refined, laggy, unresponsive and not didnt even look good, but people still loved it. Thats when i really put all my passion and drive towards this project because i realised this is something people need. The app has migrated over to a website and is now doing really good! Im really glad people are enjoying it and that i could bring something important for the community :) Huge thank you to everyone who uses or supports the project, if you want to take a look for yourself because youre interested you can easily access it at: https://pathmind.app", "target": "negative"}
{"text": "The apps alright, takes a while to get enough wards to cash out but it's got me out walking more which is a plus. The quickest way to get wards is to work your way up the leagues as the winner each week gets 50 wards in the top one.", "target": "negative"}
{"text": "Hello everyone, I relaunched my app called Crossnumber: Math Puzzle Game for iOS. Searching or solving numbers using the scrambled numbers and mathematical symbols. My latest update includes Custom Puzzle where users can create their own custom puzzles within the app and share them with other. Crossnumber App Store Link https://preview.redd.it/7ej6s2pwkclf1.png?width=2030&format=png&auto=webp&s=8bfe5838e7e0d2545dd88e9d3f450a82be8fcfa0", "target": "negative"}
{"text": "Hello I am using WhatsApp for a long days. And I switched to signal a years ago. And I found one thing crazy in this messaging apps. In WhatsApp I can send files upto 2 gb with E2E. But in signal can't send it. Only supports 100mb. And compress the file or image always. So I tried to find many other secure apps. No app is there. If anyone find secure messaging app with no limit of file transfer size. Message here", "target": "positive"}
{"text": "inventory app mainly for tracking stuff in storage, tools, gear, whatever you have really. you can organize things by location (rooms, shelves, boxes), add pics, group items into kits, track maintenance, loan stuff out, with qr and barcode support ,instant pdf , excel export and with instant website generation of the products and it works offline https://play.google.com/store/apps/details?id=com.kaadan.inventorynest", "target": "positive"}
{"text": "Less is more, when its done right. NoteStack gives you only what you need to take and organise notes quickly. While other apps show you a really tiny preview, with NoteStack you can see the real note before you open it. This makes the app more fun and easier to find your notes.  Download NoteStack  Notes & Lists", "target": "positive"}
{"text": "Hey folks, just wanted to share something I started using recently thats been surprisingly good. Its called Pop  basically a payment app that gives you cashback every time you pay (bill payments, shopping, recharges, etc). Ive been using it for a while and the cashback adds up quicker than I expected. Best part? Its instant and you can actually use it instead of it being some useless points system. If anyones interested, you can try it out and get a sign-up bonus using my referral code: [YOUR CODE]. Honestly, if youre already paying bills / shopping online, its free money youd otherwise leave on the table.", "target": "positive"}
{"text": "What app are they from?.", "target": "negative"}
{"text": "Is there a play card apps that can play by multiple player such as group of friend. Whenever were vacant in school we want to play cards(lucky 9) but we don't want to get caught. So want to play online. Thank you", "target": "positive"}
{"text": "Us and Canada users pm me for the referral link. Takes 5 min or less.", "target": "negative"}
{"text": "Apps for TV? Apart from magisk, Latin TV... I'm still looking to watch kdramas", "target": "negative"}
{"text": "WeWard has a new feature called community where you can join groups and walk to earn coins for communities that benefit the posted topic. You can select what percent of your coins are donated to the community. I created a group to raise coins to benefit environmental protection. For friendly competition within the group, you can join one of two teams: the EPA or NOAA. I hope you decide to join and enjoy, thanks! The code to join is EPA2025", "target": "positive"}
{"text": "I realized that I started using AI quite often to translate text. Over time, I got tired of writing \"Translate the following text into *language*\" and decided to create my own mobile app. This app is for iOS, it's already available in the AppStore and also available for Mac. I would be grateful for any support and feedback :) There is even AI support for text-to-speech and voice input, examples, meaning and more https://apps.apple.com/app/apple-store/id6748754116 https://preview.redd.it/d1660oe3r7lf1.jpg?width=1206&format=pjpg&auto=webp&s=6426d779c9d1bc4ee5432aeb95f0a7e9b45aa216", "target": "negative"}
{"text": "https://apps.apple.com/us/app/lockin-daily-track-time/id6743713321 [link] [comments]", "target": "negative"}
{"text": "Hello! I created a community on the app weward today. Anyone can join by entering the code. This is a great opportunity to make new friends as well.", "target": "negative"}
{"text": "TL;DR: I built PRYSM, an AI-powered app that lets creators sell products directly inside DMs/comments section. Our AI stack (IntentAnalysis + VisionService + DynamicPricing) figures out exactly what the customer wants, then generates the correct instant checkout link. Launching Sept 16  prysmpage.vercel.app Heres the problem every creator knows: A fan says I want that  under your post but youve got 10 products. Which one do they mean? You DM back  too slow. You send them to your site  they drop off. Or the message gets buried under 50 others.  Thats sales leaking out of your DMs. So I built PRYSM. Think Stripe for social media sales  but smarter. How it works (the AI under the hood): Creator uploads products into PRYSM. Sets trigger keywords inside PRYSM (I want that, how much etc). Connects socials (Instagram, WhatsApp, TikTok, Twitter). When a fan comments or DMs:  IntentAnalysis Service  understands what they meant, not just what they typed. (Yo can I grab that hoodie? still maps correctly.)  VisionService  scans the creators post itself (the product in the photo/video). It cross-checks against your PRYSM catalog so when a customer says I want that, PRYSM knows which product theyre pointing at and tells generateLink.ts which checkout link to build.  DynamicPricingSuggestion Service  smartly recommends discounts, bundles, or upsells depending on demand and buyer behavior. 4. PRYSM instantly replies with the correct 1-click checkout link. 5. Customer taps  mobile checkout (just that product)  purchase complete in <30 seconds. 6. Creator gets notified + fulfillment details in their dashboard. Why i think it matters: No back-and-forth. No abandoned Shopify carts. No lost sales because a fan wasnt crystal clear. Just  I want that  instant sale. Traction so far 1,200+ creators already on the waitlist. 15 carefully handpicked beta testers using it right now and giving me feedback.  Features: Multi-platform integration Stripe + PayPal support Real-time notifications Analytics & inventory management Automated responses Were launching September 16. Early signups get: Priority access Lifetime 50% off Chance to shape the product with feedback  Join waitlist here: prysmpage.vercel.app Id love to hear from creators/founders: Whats the most frustrating DM sale youve lost? Thats the exact pain I built PRYSM to kill.", "target": "positive"}
{"text": "So, after months of updates, bug squashing, and UI polishing, my little side project cinematique is officially live worldwide on Google Play. Its a media tracker thats basically grown into a full-on app ecosystem, and the latest version is the biggest jump yet. Why does cinematique exist? Because I got tired of juggling multiple trackers, paywalls, ads, and apps that break sync. So I built one that: syncs with Trakt, TMDB, etc. Google Drive backups, keeps your Up Next list sane, tracks your streaks (with sass), is completely free and ad-free. Download: https://play.google.com/store/apps/details?id=com.arctco.cinematique Would love feedback, bug reports, and ideas. Im pushing updates constantly, so every suggestion helps shape the next version.", "target": "positive"}
{"text": "Hey everyone, Every time I launch a new app, I waste way too much time trying to find good places to submit it. Id Google launch directories, end up on old blog posts, and then scramble to make a messy list for myself. At first, I just had a simple Excel spreadsheet with 52 launch directories that I shared on Reddit . It got over 400 upvotes, which was awesome! But people kept asking for more: like domain ratings, traffic stats, dofollow links, and even more sites. So I finally just made one solid list of 80 launch directories that actually matter. Sites like Product Hunt, Hacker News, Indie Hackers, AngelList, and a bunch of others where people really look for new apps and tools. Whats cool is that most folks visiting these directories are indie hackers, developers, and founders, so basically people like us. And yeah, they might be the perfect audience for your app. Maybe your habit tracker or whatever youre building could help them out too. I also added DR next to each site so you get a sense of how much traffic or SEO value they might bring. No paywalls, signup forms just a straightforward resource that I wish I had every time I launched something. Here it is if you want to check it out: launchdirectories.com Hope it saves you some time and helps get your app in front of the right people. Good luck with your launch!", "target": "positive"}
{"text": "I recently rebooted my android to give it to my dad and there are apps that i used to have (basic fit for example) that he cant download because theyre not available in the country (we live in France). I dont know what to do to help because i downloaded this app when it was my phone but now that its rebooted those apps arent available anymore. Anyone to help please ? :)", "target": "positive"}
{"text": "ik this isn't me creating the app, but it just seemed so good but like i couldn't get to who made it, any idea of who made this?", "target": "positive"}
{"text": "My granda somehow downloaded an app called Bus Chroma Rush and it keeps giving her phone pop up ads whatever she does. I cant find the app anywhere but I can see that its active and I can disable it but that doesnt last long as it just enables itself a few minutes later. Dont know what to do, I tried looking for invisible apps and downloads with weird names or icons and had no luck at all :/", "target": "positive"}
{"text": "Hello there, I'm excited to share MBCompass - a modern, free, and open source Compass and Navigation app without Ads, IAP, or Tracking. That's support Compass and Navigation features with being lightweight and simple ! The main reason the MBCompass is built is that it bridges the gap between a compass and a full navigation app, showing direction and live location without using hundreds of MBs of storage or making privacy trade-offs. MBCompass has come this far thanks to the amazing feedback/suggestions from the community , including Reddit, HackerNews, Product Hunt, and tech communities, which have shaped its development. I'm also consistently asking for feedback from you guys to improve MBCompass! GitHub Source code: https://github.com/CompassMB/MBCompass MBCompass website: https://compassmb.github.io/MBCompass-site/", "target": "positive"}
{"text": "Post business promotion messages here including special offers especially if you cater to small business. Be considerate. Make your message concise. Note: To prevent your messages from being flagged by the autofilter, don't use shortened URLs.", "target": "negative"}
{"text": "https://edition.cnn.com/2025/08/24/economy/de-minimis-package-delivery-small-business Any tips on how to get around Deminimis exemption ?", "target": "positive"}
{"text": "I'm about to open my first cafe/restaurant. I've worked in venues that do have WiFI and those that don't and not sure what to do for the best. Is it all a bit of a faff or is their an easy (and cheap) way to do it?", "target": "positive"}
{"text": "Hello! I've been reading up on this scam thats been attacking local buisnesses including people I know Scammers are threatening to spam businesses with thousands of false one star reviews unless they are paid large sums of money - usually through a Google Play Card It really stuck with me because I know how vital the review systems are to customers and small businesses and have seen how damaging a low rating can be. Ive spoken to a few different people and am discovering how vulnerable restaurants can be to this extortion but I get the sense I'm only seeing the tip of the iceberg of the damage that can be done. Does anyone have any experience with this scam that they would be willing to share? Thank you!", "target": "positive"}
{"text": "We just hired a new Sales Development Rep. I want to get them trained and productive as quickly as possible, but our current outreach process is kind of all over the place. What does a good onboarding and training process for an SDR look like?", "target": "positive"}
{"text": "Tips on strategies that works on getting clients for my creative studio. I currently have a few clients, and my time is limited for prospecting new ones. Since client acquisition isnt really my area, any advice is very welcome I want to understand which methods work best in practice if you have a method that works, or maybe it would be better to hire someone to handle it???", "target": "positive"}
{"text": "Hello everyone, I am music producer learning how to compose music from lessons of life, my experiences but too keep up I need to fund my journey.. I am not asking fund for free, I am also a website developer and belief me I create some of the best and stunning website. So if you wanted to connect for upbring us both, feel free to dm..", "target": "negative"}
{"text": "Hey everyone! I am a video editor, I know how to edit awesome videos with color grading, pacing and smooth storytelling nad transitions but i don't know motion graphics and animations, is that gonna hinder in me getting clients from businesses?", "target": "positive"}
{"text": "Hi Everyone! I want to Start a new small business on TikTok Shop, My product on Amazon and shopify work well but I want to expand a business on TikTok Shop. My niche is health products and I don't know how to setup it up and authorize my brand and policies of TikTok Shop anyone have experience here and guide me to setup it up. TIA", "target": "positive"}
{"text": "I once had a client who bought my $20 website template and said, Its mostly done just needs a few personal touches. Then offered $50 for those changes. By personal touches, they meant: Changing fonts, Swapping the layout, Rewriting the copy, adding a booking system, integrating a newsletter, making it feel more premium I reminded them it was a template. They said, Right, but it should still reflect my brand. I said that would take custom work. They said, Its just tweaks. So, I tweaked. And tweaked. And tweaked. Until the template was unrecognizable and I was basically rebuilding the site from scratch. No extra budget. No scope change. Just vibes. They loved the final result. Then asked if I could quickly design a pitch deck to match the site. Freelancing isnt just delivering work. Its navigating the blurry line between whats promised and whats assumed. Anyone else been there?", "target": "positive"}
{"text": "I recently bought a bubble tea franchise. The franchisor requires new owners to attend 7 days of training and then keep the same trainees working for at least 30 days after opening. Because I was short on people, I asked my aunt-in-law and her cousin (lets call him John) to attend training with me. I pay John a fair salary ( $1000/ month), so this is not unpaid family help. The problem: John acts like a clown. He's the type that think he's being funny but is really just a jackass. In our official work group chat (which includes my parents, the actual owners, and the franchisor staff), he changes the group name to things like The Royal Court, pins random jokes, and generally behaves unprofessionally. This is very frustrating because:  Im the manager responsible for running the shop.  My parents are the owners, so I lose face when he acts out.  The franchisor requires him to stay for at least 30 days, so I cant just replace him immediately. And really, this dude is just really annoying in generall. So my question is: how should I deal with him during these 30 days? Should I ignore his behavior and just get through it, or should I confront him directly and risk creating family drama?", "target": "positive"}
{"text": "Im 4th generation in a family owned and operated business. Over the years Ive learned many different facets but this last year Ive really been focused on Marketing. Social media, re designing our website, and now Im running ads on google / facebook. Im curious how legit the data is that these platforms provide to you? The results seems really good but I was hoping someone could chime in. We are a wholesale distributor in the floral industry. We dont have many competitors in our area and weve reconstructed our business to tailor not only to professionals but also the average individual giving them access to many resources they wont find anywhere else. Im targeting local business (100 mile radius). Just looking for general input and thoughts on the data here. https://www.dropbox.com/scl/fi/q17djdd6ag2xsu4i8eelk/Facebook-AD.jpg?rlkey=gckr4ssw2tirkvbrrpdv7kxku&st=7hlzol0g&dl=0", "target": "positive"}
{"text": "To the disabled veteran owned businesses out there, I have a question. Do you think you gain more customers with publicly claiming such? I was in the military (USAF during Desert Shield/Storm) and have 15% disability (PTSD where I can't get on an airplane, ringing in hearing...small stuff). I always felt bad to claim I am a disabled vet because... well... I have both my arms and legs, not in wheelchair, etc (nothing super drastic or life changing). A business associate is pushing / advising me to start going after govt jobs and also putting on my internet webpage, to claim I am a disabled vet. I really never pursued this claim for 30 years. But as a new business owner, I am curious of it's benefits, if any exist.", "target": "positive"}
{"text": "Hi everyone, I create engaging fitness content that inspires readers and drives traffic. Whether you need blog posts, website articles, or short social media captions, I can deliver high-quality writing tailored to your audience .  What I offer:   Fitness & health blogs (5001500 words)   Nutrition & wellness articles   Social media captions & fitness tips   SEO-friendly content for better visibility   Professional, clear, and research-based writing  Rates: 1530 per piece (flexible depending on length & scope)  Payment: PayPal only", "target": "negative"}
{"text": "We're a US-based startup but we have a big market opportunity in Latin America. We need to start doing sales outreach in Spanish. Are there agencies or tools that are good at handling multilingual outreach campaigns?", "target": "positive"}
{"text": "For small businesses, what do you think is the hardest part of adopting BIdata integration, cost, or training the team?", "target": "negative"}
{"text": "I'm excited to share my idea of starting a cloud kitchen that focuses on serving healthy and nutritious food. I've always been passionate about food and wellness, and I believe there's a growing demand for healthy options in the food delivery space. However, I'm new to the industry and would love to learn from others who have experience in setting up a cloud kitchen. Can anyone share their insights on the following: Initial investment and costs: What are the estimated costs involved in setting up a cloud kitchen, including kitchen rental, equipment, staffing, and marketing? Menu development: How do I develop a menu that is both healthy and appealing to customers? What are some popular healthy food options that I could consider? Food delivery and logistics: What are the best options for food delivery and logistics? Should I partner with third-party delivery services or set up my own delivery team? Marketing and promotion: How do I market and promote my cloud kitchen to attract customers? What are some effective strategies for social media marketing, online ordering, and customer engagement? Regulations and licenses: What are the necessary licenses and permits required to operate a cloud kitchen in [your city/state]? Are there any specific regulations I need to be aware of? I'd appreciate any advice, guidance, or resources that can help me get started. Thanks in advance for your help! TL;DR: Starting a cloud kitchen for healthy menu - Need advice on initial investment, menu development, food delivery, marketing, and regulations.", "target": "positive"}
{"text": "Let's chat.", "target": "negative"}
{"text": "Im the owner of Big Bite Burgers in Pune , and what started as a passion for grilling turned into a full-time hustle. Everythings made fresh juicy patties, homemade sauces, and soft buns. If you're in Pune, come by and try one! Also curious what makes a burger great for you? Smash or thick? Classic toppings or wild combos? Would love your thoughts and support", "target": "negative"}
{"text": "Hi everyone! I recently relaunched my cake studio . Right now I work fully online (custom cakes for weddings & events) while I build toward having a physical shop. Im setting up payments and was wondering: what platforms do you find most professional and easy for clients in the US? Ive been looking at PayPal Business and Square. Any advice from your experience would be super helpful .", "target": "positive"}
{"text": "Hi All I launched something called SWAAI. Think: small businesses telling their story without drowning in boost post hell and consumers actually finding them because of purpose not because they outspent someone on ads. Its live on Apple and Im curious on thoughts from founders, consumers etc. Lmk open to feedback !!!", "target": "negative"}
{"text": "When I started my business, I thought Id finally get to focus only on my main craft. Instead, Ive ended up learning things like bookkeeping, video editing, and customer service scripting on the fly. What random skills did you have to pick up that no one warned you about? Also, how did you go about learning it? Did you wing it, do online courses, outsource or what? Curious to hear your experiences and what worked for you.", "target": "negative"}
{"text": "Seeking advice only (no offers/DMs) on finding a reliable U.S.-based person or service to receive mail.", "target": "positive"}
{"text": "Curious if anyone here actually uses customer reviews as part of their social media strategy. Do you take reviews from Google, Yelp, etc. and turn them into posts/stories/reels? Has it worked for you in terms of engagement, leads, or sales? What tools do you use to make the visuals? Would love to hear whats been effective (or not) in the real world .", "target": "positive"}
{"text": "Im confused on if i can sell my slushies with plastic straws For example the ones with the little scoops at the end. But because of the single use plastic ban i dont think its allowed. But I've been served plastic straws pretty recently for other slushie places. And the paper ones are horrible they melt away really quick.", "target": "negative"}
{"text": "Anyone providing SEO services for Med Spas, E-Commerce brands, Dentists, or Law Firms?", "target": "positive"}
{"text": "Current numbers:  $8-10K MRR  40,000 users  2,000 paying customers  30,000 monthly visitors  10,000 clicks sent to makers' products last month But here's the crazy part... I just did a brutally honest conversation with Thomas from Uneed, and holy shit, it hit different. TD;LR This guy failed 30+ projects before one finally worked. Not 3. Not 5. THIRTY. The Graveyard of \"Almost Made Its\"  His GitHub is literally a cemetery of abandoned repos here's a list of his failed saas: Gumaffiliates - Marketplace for Gumroad sellers. Made $500 in 2 years. RIP. - Freeesbee - Built in a day for product feedback. Never even launched it. - SeeduryFor - A \"really useless\" planning app he only used himself - Uneed Gaming (2024) - Uneed but for video games. Didn't work. Plus stuff like lstnr, wordnuxt, equilibre (a SaaS boilerplate), Cineplex, minbird, zephyr, whatisanindiemaker, isthisfromeu, Windlib, Scribe, Uneed Hacking, Uneed No Code... the list goes on. What Uneed does: Uneed is a product launch platform where indie makers can launch their products and get discovered - basically Product Hunt but for indie/bootstrap founders instead of VC-backed startups. Makers submit products, users discover new tools. After reflecting on his failures, he identified these patterns: 1. The Week-Two Quit No sales after 14 days? Must be a shit idea. Wrong. Products rarely work overnight. The difference between failure and success is often just one more iteration 2. The Pretty Landing Page Paradox Your site has sick animations but nobody knows WTF you're selling? Congrats, you played yourself. If your headline doesn't explain it, nobody's scrolling. 3. Momentum Murder Build in public for 3 weeks  Stop posting  Wonder why nobody cares anymore. You literally have to start from zero every time you go silent. 4. Build It and They Will Come  Spoiler: They won't. Ever. No matter how good your features are. 5. Timing Denial Sometimes January isn't your month. But July might be. The market changes, trends shift. Persistence > Perfect Timing. The One That Finally Worked  Uneed started as a basic front-end tools directory making $200/month. Not exactly yacht money. Then he pivoted to a launch platform right when everyone was bitching about Product Hunt only featuring big VC-backed products. Revenue initially tanked (scary AF), but then... The Two Rules for Ideas That Actually Work After all his failures, he boiled it down to this: 1. You MUST know how to sell it - Understand the market - Have distribution channels - Know your customers' pain points With Gum Affiliates, he knew nothing about affiliates. With Uneed, he knew Product Hunt, indie hackers, and had already built his Twitter audience. 2. You NEED competitors \"You're not Steve Jobs. Creating a new market is nearly impossible.\" No competitors = No market = No money. Simple as that. His Tech Stack (For the Nerds) Framework: NuxtJS (not NextJs) Database: Supabase Emails: Bento Hosting: Self host on Hetzner VPS manage by Coolify Payments: Polar Analytics: Plausible The Advice That Actually Matters Forget the \"hustle 24/7\" bullshit: It's a marathon, not a sprint. You have the same chance of getting rich in a month as winning the lottery Don't sacrifice everything. He cycles, sees friends, has a life. Burnout kills more startups than competition Just build. You miss 100% of the shots you don't take. Actually, Thomas told me you don't need 30+ attempts - you can move way quicker if you follow the basic rules he learned the hard way. He just took the scenic route  and yeah if you want to learn from some real founders you can get them here The Bottom Line: Almost nobody has overnight success. There are YEARS of work behind every \"sudden\" success story you see But here's the thing if you don't build anything, you'll never know if project #31 could've been the on", "target": "positive"}
{"text": "This video is not speeded up. I am making this Open Source project which let you plug LLM to your android and let him take incharge of your phone. All the repetitive tasks like sending greeting message to new connection on linkedin, or removing spam messages from the Gmail. All the automation just with your voice Please leave a star if you like this Github link: https://github.com/Ayush0Chaudhary/blurr If you want to try this app on your android: https://forms.gle/A5cqJ8wGLgQFhHp5A I am a single developer making this project, would love any kinda advice or collaboration!", "target": "positive"}
{"text": "They all start with this huge money chart and focus on how much money they made, purposefully ignoring a couple key things which will make you reach out to them. I thought there'll be more of : this is my hobby project or turns out x was hard to figure out which made me do y ...", "target": "negative"}
{"text": "Basically I feel like for a lot of people, some form of human accountability (gym buddy, office crush, etc.) is pretty effective at motivating you to workout, so Im trying to capture that feeling with a cuddly marshmallow that gets sad / angry when you dont do your workouts. Ive been working on this for a few months with a buddy whos into design and animation. A bunch of stuff is still pretty jank but Im trying to be less perfectionist. Tracking is done with camera and is all on-device with Google MoveNet pose detection, and Im trying to add more stretching, yoga, and exercises that people would find fun / useful. We put a version out on the app store and would love any feedback / criticism. Ive been meaning to post for a minute now and have been procrastinating, but the pushup post yesterday inspired me to finally get off my ass and do it (shout out togaratee and lazyfck!).", "target": "positive"}
{"text": "4 years and 3 months ago (just checked my git log), I started building My Forever Books . A website where you can upload your text messages (iMessage, WhatsApp, SMS, etc.) and get them printed into a real, physical book. Top use cases being anniversary gifts or preserving the texts of family/friends that have passed. Exactly a year ago today, I made my first organic sale from a random customer in Tennessee. That moment pretty much changed everything for me, and I was convinced that I had real business with real potential. A month later, I quit my job and went all in on the business, right before the holiday gift giving season. Sales went crazy, my email was blowing up, and I was in front of my computer all day every day answering emails, getting on calls, fixing bugs, building features, and so much more. Although I started working the most I've ever had in my life, it was so rewarding and fulfilling, especially that I had built so many relationships with my customers and had received beautiful emails from them thanking me for making a service that really preserves something special. Till this day, I know most of my customers personally. It's been a wild journey with a ton of mistakes made. I remember the first version of the site felt like a saas page with zero emotional weight, whereas now, it's really starting to feel like a cohesive brand. Looking back and checking when I actually started coding the site, it's crazy to think that it's been over 4 years. But it makes sense, I remember working at my corporate job all day, to then try and work nights and weekends. It was pretty tough to code after an entire work day, and that's reflective in the amount of time it took me to initially build the site. The closer I got to going all in on the business, the more I stayed in a flow with building and the more I could get done. Once I was totally focused, I probably built more in 3 months than in 3 years. To anyone working on a side project, you can do it! Keep pivoting, keep believing in the vision, and be selective to who you listen to. You have to wear so many hats, but the longer you're in it, the better you get at everything. Not just building, but marketing and business. You also get your best ideas here in the flow! I have so many other niche ideas that I want to release soon, and I'm just feeling so confident with how fast they'll generate revenue because I know what to do now. At least... better than I did before. Stay focused, stay business savvy, give charity, and everything will work out.", "target": "positive"}
{"text": "I started using Google ads for the first time to share a new website / chrome extension I built. I normally hate spending money on ads, since Ive never had success, but excitedly saw a deal (spend $500, get $500 credit). I quickly claimed it and spent the next month running various ads (without much success). After spending $500, waiting 3 weeks, the status of the promotion just became invalidated, without any reason at all besides not meeting the eligibility requirements. They did not specify which one, and I'm very confused by this since I've never broken any of their rules. There wasnt any email about this either. I feel scammed. (resharing my post from the google ads subreddit, since I think it's relevant to you all as well)", "target": "positive"}
{"text": "Im a student in NYC and Ive been working on a side project to make eating out a little less painful. The idea is simple: show wait times for restaurants in minutes so you dont waste an hour standing in line. To do it, I combined live crowdsourced submissions with data from Google + Yelp APIs, then layered in a prediction model that estimates wait times based on patterns (day of week, time of day, cuisine type, etc.). I also added some algorithms to flag outlier/fake submissions so the data stays useful. From the dev side, I built it in SwiftUI with MapKit integration, async API calls, and a small disk cache so the UI loads instantly even on cold start. Its been a great learning project, and Im curious if anyone else here has tackled real-time user input + prediction modeling in their side projects. App Store link if you want to check it out: https://apps.apple.com/us/app/waitmatenyc/id6751106144", "target": "positive"}
{"text": "Hey everyone, Im a freelancer and Ive always hated sending the same portfolio to every prospect. It never felt right. Each client is different. Each mission deserves a tailored portfolio. But lets be honest, customizing your portfolio every time is a pain. Most people (including me) end up sending the same generic one over and over. Last year, I had multiple prospects ghost me. I knew I had the skills for the gigs, but I realized I didnt present myself in the right context. So I started manually tailoring my portfolios for each lead and the difference in replies was huge. But doing that manually took forever. That's why today i am launching PortfolioKit , a tool to create personalized portfolios in 510 minutes using drag-and-drop blocks. You create a base with your past projects, then just pick the relevant pieces for each new client. Publish, share the link, and youre done. Its like LEGO, but for portfolios. Its still early. There are bugs and features I need to add. But the core idea is live and working, and Id love to hear what you think. If you try it, let me know what feels off or what youd want next. And if youre down for a chat, Im happy to jump on a call too. Thanks for reading.", "target": "positive"}
{"text": "hey all! I launched something recently that I built solo in 7 days and I wanted to share here to get some beta eyes on it and some feedback. In the first 48 hours, ~200 people signed up and started using it, but I know there are a lot of thing to improve So, my tool called Polary  it's like your AI co-founder that generate a startup blueprint in minutes, validates it, and plan your next steps. It researchers the market, competitors and more I hope it will be helpfull for people who wants to validate their ideas quickly and have a clear roadmap", "target": "negative"}
{"text": "When you build in public, you never know who's going to come for you  Yesterday, one of my posts went insanely viral on Bluesky. Best sales day ever for my little file converter app. And then... the backlash hit. From who? Not competitors. Not other indie hackers. Not angry customers. FURRIES Yes, furries came after me  For the last 24 hours, I've been slammed with: - hate replies, - weird memes, - and even posts advertising my competitors It's been... well, weird. But it made me a lot of money. I don't have any hate for furries and I didn't even know there was a community there. I'm just a guy who posts about his app every day", "target": "positive"}
{"text": "The Problem I'm Trying to Solve: Discovery is broken - Amazing dev projects get buried in GitHub's noise. Your CLI tools, libraries, and weekend hacks deserve better than 3 stars. Contribution is a nightmare - Want to contribute to open source but can't find repos that match your skill level or interests? Same. What I'm Building: A platform tentatively called \"LaunchPad\" that's basically \"Product Hunt meets GitHub Intelligence\": Project launches with proper context (demo links, use cases, tech deep-dives) AI GitHub analysis that reads your coding patterns and suggests relevant projects to discover AND contribute to. Community voting & discovery but actually designed for developer projects Before I finish building this, I really need to know: How do you currently find open source projects to contribute to? (It sucks, right?) What stops you from contributing more to open source? How do you discover new dev tools? (Reddit? Twitter? Accidentally?) Would AI-powered project recommendations based on your GitHub actually be useful? Honest question: Am I solving real pain points or just adding another platform to ignore? I'd rather get roasted now than build something nobody needs. Give me your brutal honest thoughts!", "target": "positive"}
{"text": "I came across Rytsense  they offer custom AI development services and intelligent automation. Website: rytsensetech.com . Would love to hear your thoughts on their approach or tools like this?", "target": "positive"}
{"text": "A few weeks ago, I made a post showing a prototype of a timezone tracker here . And it seemed like some people liked the idea and keen to try, so I built it properly and launching it as promised. Just launched so it's far from perfect. Its free to use! Would love to hear your feedback!  The project link: timezonetracker.co dummy demo: https://app.timezonetracker.co/share/84eb2b99-10cd-43db-8b17-a3ea7aea402e", "target": "positive"}
{"text": "https://preview.redd.it/5fi35vxz4clf1.png?width=1200&format=png&auto=webp&s=2a3540d7dc1e43acf8e021b0507a932dd04dd93a Weekend mission: avoid manually downloading SVGs or adding heavy packagesso I made logocn.dev . Its a tiny CLI. You run: npx logocn init npx logocn add netflix stripe github And boom: React/Vue/TS components for logos drop into your project. 3,300+ brands, zero npm dependencies. You own the code. No installation horrors, no clashing packages, just clean logo components you can style and tweak. Would love to know: Is this actually something youd use? What brand logos are missing? Any duh, I need this moments? Roast or praiseboth work. I  brutal honesty.", "target": "positive"}
{"text": "I keep seeing small stores leave money on the table. A client had dozens of abandoned carts every week. We set up an automation: Detects abandoned cart in Shopify Sends WhatsApp reminder with dynamic payment link Marks the order as Recovered in Airtable Result: 18k recovered in the first week, with zero manual followup. If youre running a store and want to break down this exact setup, I can share the Make/n8n blueprint free. It takes ~20 minutes to implement.", "target": "positive"}
{"text": "Hey  Every time I finish a long podcast episode, I feel like I forget 80% of what was said. Sometimes I want to revisit an idea but have no clue where it was. So I built this:  Podcast Transcriber A tool that turns any podcast audio into a high-quality transcript and GPT-4-powered summary. Why I built it: I wanted an easier way to actually retain what I heard in podcasts. Im a big podcast listener, but scrubbing through audio to find one quote is frustrating. This tool makes reviewing and saving insights much easier.  How it works:  Paste a podcast link (supports Apple Podcasts, RSS feeds, etc.)  Transcribe audio with OpenAI Whisper  Summarize with GPT-4  Choose summary language (English/Chinese)  Works for both English and Chinese podcasts  Fully open-source + free to use  GitHub: https://github.com/wendy7756/podcast-transc Would love feedback from fellow builders:  Is this useful to you?  What features should I add next?  Have you used other tools like this? Thanks for reading  happy to share more about the stack or challenges if youre curious.", "target": "positive"}
{"text": "I'm learning programming while I study. While I'm on vacation, I've been practicing several exercises on Python, HTML, CSS, and JS. My goal was to learn how to manage websites, backends, servers, and a bit of scientific programming like computational physics. This is the first project I've published. I hope you like it. https://learningashort.github.io/Sistema-solar-didactico/", "target": "positive"}
{"text": "Every month, over 2.2 million people search for Twitter Video Downloader 450K in the US, 368K in India, 165K in the Philippines, and more worldwide. To tap into this demand and boost SEO for my cross-platform screenshot tool Zapshot , I built a free Twitter Video Downloader. Its simple: people looking to save videos discover Zapshot, and a fraction convert into long-term users. Hopefully", "target": "positive"}
{"text": "Hello everyone, As the title says, I have created a Chrome extension called Instaboard. With it, you can: - Screenshot and save URLs in one click - Manage visual ideas with folders, sort, organize, and search extremely fast - Everything is saved offline, so your data is absolutely secure - Create artistic mood boards to share with someone Give it a try and send me your feedback!", "target": "negative"}
{"text": "So I've been working on this side project for the past 3-4 days. you can drop pins anywhere on map and comment. other people can see your pin ,read comments and drop comment. does this sound useful or fun to use ?", "target": "positive"}
{"text": "Hi Guys, I've just launched my first app on Play Store and I was looking for some advice on proven inexpensive strategies to get users on my app. I don't have a big budget so Ads wouldn't be my best call. Its a Social Confidence Builder App it leverages AI to improve people's Conversations and Style. It also has a community wall for people to share there advice on how to better navigate social and dating situations. You Can Click Here to check it out", "target": "positive"}
{"text": "Your prompt actually matters in getting items with good stats. Would be interested if anyone can find prompts that work well.", "target": "positive"}
{"text": "I built a small Android app called File Saver. From the Android share menu, pick File Saver and it saves instantly. No Special permissions Works for photos, videos, docs - basically anything you can share. No \"Save as...\" pop ups, just one tap (see app settings) Supports multiple files, auto folders, and a simple Material Design UI. Id love your feedback on UX and ideas for improvements. Play Store link", "target": "positive"}
{"text": "If you've had a bad day, this is the place for you. I have performed UX/performance tests, AI analyses, and much more, but I have not subjected my website to the harsh scrutiny of human criticism . https://vitcor.com Please let me know if you see any areas for improvement. Even if its something like not liking the button color. Thanks.", "target": "positive"}
{"text": "Having trouble making popular tiktok videos well this system is the thing for you", "target": "negative"}
{"text": "Six months ago, I went all-in on my SaaS dream. I quit my comfortable job, rented an office, built a small team, and spent $2,500 setting up what I thought was a real business. We built and polished our product, held energetic team meetings, and set roadmap after roadmap. The result? $0 revenue, and not a single real customer. Looking back: I had completely underestimated the challenge of distribution . We could buildbut without an audience, nobody cared. Instead of trying to add yet another feature, I decided to switch gears and document my journey publicly, sharing raw, honest updates and lessons on Instagram and YouTube. The results in just 20 days: 200,000 views across platforms 1,000+ followers interested in our space Actual leads reaching out for conversations Unexpected support and feedback from the community Hard-earned lessons: Building in silence = building for yourself Audience-first wins: Start with distribution, not just product Content compounds; even imperfect stories beat polished demos Feedback from just a few real users teaches more than months at the whiteboard Now, Im focused almost entirely on building with my audience, sharing what works and what doesnt in real time. Would love to hear from other founders: Have you struggled with getting attention for your product despite building something good? Whats worked in terms of getting your first loyal users? Any tips on growing beyond the first few hundred engaged followers? Not promoting herejust want to share what worked (and didnt) for me. I genuinely hope this helps anyone feeling stuck at zero. If youre building something similar, lets swap notes in the comments!", "target": "positive"}
{"text": "Im experimenting with some new ideastrying out modern UI/UX and focusing heavily on features and overall user experience. Ive noticed the wave of hate around the new ChatGPT-style UI. A lot of people are saying it makes apps look generic, and I get that. But it makes me wonder: to what degree does UI/UX actually matter when it comes to long-term use? Like, would you really switch from an app just because it looks like a ChatGPT clone, even if it works well and is easy to use? Or do features and reliability outweigh the aesthetics? Curious to hear the communitys perspective on this.", "target": "positive"}
{"text": "I discovered a strategy that completely transformed my cold email results, and while it seemed counterintuitive at first, it actually makes perfect sense when you think about it. The insight was simple: people who are active on LinkedIn are also more likely to respond to cold emails. Someone who regularly engages on social media, checks notifications, and responds to messages on one platform will probably do the same across other channels, including email. So I decided to test this theory. Instead of using static databases like Apollo, I started building my outreach campaigns exclusively from LinkedIn activity. I used Instantly with 140 domains, sending around 3,000 emails per day, but only targeted prospects showing recent LinkedIn engagement. Here's what I looked for: people commenting on posts with specific keywords, users engaging with industry creators, prospects interacting with competitor content, event attendees, group members, job changers, basically anyone showing they're actively using LinkedIn. Of course, I still filtered everything against my ideal customer profile. The results were incredible. I booked over 100 demos using this approach, and my reply rate tripled compared to traditional database outreach. The difference was night and day. What really made this work was the dynamic nature of the sourcing. While static databases get stale quickly, LinkedIn gives you fresh, engaged prospects every single day. New posts, new comments, new event attendees, new job announcements. The activity never stops. For example, just by following one industry creator this month, I pulled 5,000 leads from their engaged audience. Sure, there's some overlap when creators talk about similar topics, but the daily flow of new interactions keeps your pipeline full of fresh prospects. The trade off is obvious... you miss the silent lurkers who read content but never engage. But honestly, those weren't converting well anyway. The people who actively participate in conversations are the ones who'll actually respond to your outreach. You can do this manually by checking profiles one by one and filtering for your ideal customer, or if you're more technical, use automation tools like n8n, though that gets complex and expensive. There are also specialized software solutions designed for this, though I won't name specific tools here. The bottom line is this: active LinkedIn users are pure gold for cold email campaigns. By tapping into real-time social engagement instead of stale databases, you're reaching people who are already in the habit of responding and engaging online. Good luck guys !", "target": "positive"}
{"text": "How do you guys stay motivated? My friends and family are worried about me because I'm in my room 12+ hours a day grinding out this product. It's the only thing I can think about and I feel like it's starting to be a disservice to the people around me that I can't turn \"founder\" mode off when I should just be spending time with friends or family. Let me know how you guys manage this and how you stay motivated with all this isolation.", "target": "positive"}
{"text": "Lately I have been noticing that it is not always the big systems and any fancy tools that actually change how I work sometimes it is the smallest habits. For me, it was something as simple as writing down tomorrow 3 priorities before logging off. its Weirdly enough, that little ritual cut down my stress a lot. Now I am curious what is the underrated thing you do that ended up making your work life smoother? Could be anything a mindset shift, a random routine, or even some weird shortcut you swear by. Would love to steal some good ones from this thread.", "target": "positive"}
{"text": "72 hours ago, our TikTok hit 375k views. We jumped to 500 users. Our product broke. Servers failed. Bugs popped up everywhere. We spent money we didnt have just to keep the lights on. But heres what I realized: this is the best way to learn. When youre forced to fix real problems for real people at speed, you cant hide behind well fix it later. Growth is messy. But its growth. *Edit here is the video for (proof) not just karma farming https://www.tiktok.com/@lukedwags04?is_from_webapp=1&sender_device=pc", "target": "positive"}
{"text": "Seems like every post is AI slop of a BS story with a link to a loveable project in the comments. I get wanting users, but it's annoying and low effort - what is a better sub for constructive conversation?", "target": "negative"}
{"text": "Recently, a friend wrapped the launch of her B2B SaaS after months of building. Their launch post went viral with millions of views across LinkedIn, Twitter, and other platforms, and they also ended up in the top 3 on Product Hunt. I used to think launch = just ship it and post on Product Hunt. I was wrong. Heres what actually moved the needle for them: Start telling the story weeks before. You dont need to build in public feature by feature, what worked best was sharing the big story early, giving people a reason to care before launch day. Line up distribution in advance. Get friends, colleagues, and even former classmates ready to upvote/share on Product Hunt. Reach out to people whove retweeted similar launches (tools like Apify can help scrape lists). A simple Hey, you liked X, heres something youll love works. Lock in newsletter mentions and community shoutouts before launch. Have one high-quality piece of launch content. For them, it was a 90-second video (produced with Represent Studio) alongside clean screenshots and a polished Webflow landing page. It became their best performing piece of content. Activate hard on launch day. Think of it less like broadcasting and more like direct outreach at scale. Momentum comes from dozens of small pushes, not one big push. Measure and adjust in real time. Tools like Posthog helped track where traffic came from and where onboarding was dropping off, so they could make changes in the first 48 hours, not weeks later. Id love to hear from other founders, whats your #1 launch tip that made the difference?", "target": "positive"}
{"text": "I hate promotional posts on Reddit! But Im starting a cool product and I want to get traffic from Reddit. So I think its interesting to ask the community- how can you benefit from Reddit while avoiding promotions? Like if I contribute to the community, like share a cool feature I develop and tell people how I built it for example, Is it cool to name my product? Or avoid promotions completely and hope people will enter my profile to see a link? I think its an important discussion for the community to have!", "target": "positive"}
{"text": "Hi All, I launched an app called SWAAI. Think: small businesses telling their story without drowning in 'boost post' hell and consumers actually finding them because of purpose not because they outspent someone on ads. Its live on Apple and I'm curious on thoughts from founders, consumers etc. LMK open to feedback !!!", "target": "negative"}
{"text": "Someone mentioned churn sneaking up. I built a FREE n8n workflow so when a customer cancels, it auto-emails a survey link, logs the cancel + response to Google Sheets, and pings Slack. Gives you churn patterns without a heavy system. Just comment below and i'll add the code!", "target": "positive"}
{"text": "Ive been diving into SaaS scaling stories lately, and its fascinating how different teams tackle growth. Some focus heavily on infrastructure and DevOps, while others struggle more with feature bloat, customer onboarding, or just keeping churn low. One thing Ive noticed across the board: scaling isnt just about adding more servers or code. Its about balancing tech, process, and people. For example: Architecture : Did you redesign your app for multi-tenancy or microservices, or did you start with that mindset from day one? Team scaling : How did you handle the shift from a few engineers wearing multiple hats to specialized teams? Customer expectations : At what point did customer success and support become a bottleneck? Curious to hear from founders, PMs, or engineers here: what was the hardest scaling hurdle for your SaaS, and how did you overcome it?", "target": "positive"}
{"text": "Hey guys, i developed and finished recently my first Saas. Its called tripzy and automates the guest communication for airbnb hosts using AI. The first version is ready but now i stand infront of the next door and dont really know how to open it! I looked a little bit on the internet and here and saw most of all people just promoting their saas here on reddit, x or writing blog posts to rank on google. If you guys have any tips i would be really gradeful! Thank you in advance! Here the link to the project if you want to check it out: Tripzy", "target": "positive"}
{"text": "I made a resume builder and i have noticed that users barely make any resumes , if so only one then they never return, most just register and thats it. This is my first time and im not sure yet what I need to do : https://rezucraft.vercel.app/", "target": "positive"}
{"text": "We worked with a client and built their production MVP using low code tools. Built in weeks, to get to market faster. Their SaaS product now has an investor and users are starting to onboard. They used the Australian Investor Network. There are several other places to get investors too. Lesson here, if you have an idea, stop waiting and sitting on it. Give it your best shot. Mistakes or not, we learn and grow.", "target": "negative"}
{"text": "The idea came from my own pain: during interviews it's really hard to recall all the theory on the spot, even if you've been working with the tech for years. I wanted something that could support me in real time. So I built an extension that: Listens to your browser tab (for example, google meet, teams etc.) Transcribes the question instantly Generates an answer right there, in the flow of the conversation I've already used it myself and even managed to land offers thanks to it. Today it's at 45 users and honestly, I never thought so many people would be interested. This is still just the beginning, but it's exciting to see how such a small idea can turn into something big.", "target": "positive"}
{"text": "When I raised for my first company in SF, we hit a hype wave. One of the people who led our round was Greg McAdoo, ex-Sequoia partner, hed been at Sequoia for a decade and done some of their biggest deals.The moment Sequoia found out we closed with him, they called me directly to get a meeting. Not because they suddenly believed in us but because they didnt want to miss out on a deal their former partner was in. That was one of my first lessons: even the top funds in the Valley are driven by FOMO. Heres the twist: my old company raised millions on hype + FOMO when we had barely any revenue. Now Im running companies with real traction, strong fundamentals, and actual money coming in and VCs dont care. Why? Because today the herd is chasing infra AI plays. Foundation models, crazy valuations, same 20 companies raising all the checks. If youre not in that pack, youre not defensible enough.Dont get me wrong, Im not anti-VC at all. I had an amazing board last time, learned a ton, and Id raise again if the market lined up. But its funny (and a bit humbling) to see how much capital allocation comes down to timing + narrative, not just results. So yeah. If youre building right now: Dont assume traction == $ checks. Dont assume a no means your product isnt good. And dont assume VCs are immune to FOMO. Theyre human, they follow each other just like everyone else. Fast forward to today, Im building again. Now fully bootstrapped. one helps businesses grow organic traffic + even rank in LLM answers (like ChatGPT results).We have 900+ websites in the pool the other uses AI to analyze hair health from a phone camera, showing projections + personalized care plans. Growing super fast too.", "target": "positive"}
{"text": "For years, I was caught in the same cycle: dream up a SaaS, spend 2 months setting up boilerplate (auth, payments, teams, admin tools), lose steam, and never launch. After my third failure, I realized the problem wasnt my ideasit was the soul-crushing setup work. So instead of another SaaS, I built the boilerplate I wish I had. That project became Indie Kit. Now it comes with B2B multi-tenancy, admin impersonation, flexible payments (Stripe, LemonSqueezy, PayPal, Dodopayments), and even 1-on-1 mentorship calls. Its being used by 300+ devs today. Sometimes the best product isnt the idea you start withits the tool you wish existed.", "target": "positive"}
{"text": "I am close to finishing a whole SaaS, I might or might not reveal it here when its deployed not sure yet, its fully functional, with its cloud functions deployed, full backend, of course I had to intervene multiple times, debug functions multiple times on my own, I had to design it all myself since AI is complete shit at design, I've been building it for about 6 months now. Here is a piece of advice : Use it to integrate code and link between front and backend, do not expect it to build complex systems on it own. Treat it like a kid, its dumb, it needs to understand what you're trying to do in DETAILS, do not expect it to understand what you want to do. Be an engineer and expect the worse, if you faced a problem, DO NOT TELL IT TO RESOLVE IT, check the console, debug the code, send it to claude and tell it to fill it with console logs to debug it, and send it the resullts, take the solution and send it to the one building ur app. Again, AI doesnt think like a human, make the tasks easier to do, step by step, speak in a simple detailed language, and u need to explain what u want to do like u're explaining to a 7 year old. Edit : to clear up some misunderstandings, an app built with AI and a solo engineer/dev, isnt full production ready, u might be able to handle 1000 users that are in need of the app, in a specific small region of the world, which is my case, but not a global launch, it has many optimization and security issues that require a full dev team. Its like a production ready MVP", "target": "positive"}
{"text": "Im speaking from the heart here. Im a ChatGPT plus user. Chat GPT users complain about memory. I create RAG file systems that solve the memory issue. The file system can also act as a prompt library. I dont charge much for builds. I actually feel I under charge. GPT users in other subs get really upset that I dont teach how to do this for free. I feel that think its easier then what it seems. To fully customize it that is, and get it how you need it. I have several questions. Why are Custom GPT actions such a gray area? Why are GPT plus users so against paying for additional service to make GPT better but constantly complain about the issues? Is it like taboo to sell services that are related to apps like GPT as far as actions and what not? It took me a good bit of time to learn custom GPT actions. Its taught me a lot about software tbh sent me down many rabbit holes I have learned a lot from, why do people expect that knowledge to be free tho.", "target": "positive"}
{"text": "Im 22, working night shifts and studying economics, and since I was 14 Ive been bouncing between different online businesses. Ive tried e-commerce stores, Instagram theme pages, YouTube channels, affiliate marketing, CPA offers, reward sites. basically anything I could think of. Some of them made a couple thousand but most died out. When looking back now I realize the problem was always the same. I was chasing quick action instead of building something that actually mattered. Every project felt like a grind, Id launch a store, push ads, make a few sales and then watch it fade out. At some point I realized the obvious thing I had been ignoring that's if you dont provide real value, nothing else matters. You can run amazing ads or have a clever funnel but if the product itself isnt useful people wont stick around. And I was also skipping another basic step which was listening to customers. Not just mine but even my competitors. If people are complaining about something, thats literally a free roadmap for what to fix and I wasnt paying attention to that at all. Then by accident, I came across a YouTube video of someone building an iOS app. It reminded me that when I was 13 my dad had signed me up for programming classes and I actually built and published my first Android app back then. I had forgotten about it, but I remembered how much fun it was. So I decided to try again and this time it clicked instantly, I loved it. For once it didnt feel like a grind. Thats when I decided to stop chasing quick wins and build something I actually cared about. Ive always been into selfimprovement like reading, going to the gym, tracking progress. I like seeing progress in numbers and data. But I also noticed how messy most selfimprovement apps are. Notion is powerful but confusing and a lot of apps are old and outdated. So I took a couple of months and tried build something of maximum value while still keeping it MVP. The first version is a clean dashboard where you can \"install\" the tools you want to use. Habits, goals, journaling, tasks, detox tracker, countdowns, focus tracker. The part I cared most about was analytics and customization. Just because everyone's goals are different and analytics keeps you motivated and you can actually see the progress. Right now the app is live with a 7-day free trial so anyone can actually use it before deciding. It's called Strukt: Productivity hub but it's for Iphone only currently. Ive built in an easy way to send me feedback, and if something makes sense I can push updates fast, sometimes in less than 48 hours. Since its still new the first 999 users also get an early discount and some special perks that wont be offered again. If you've read this far I hope you've gotten something of value, and if you have any questions I'd love to answer them.", "target": "positive"}
{"text": "hi saas founders, do you have this problem with fake signups, temp emails, and spammers submitting your signup/contact forms?", "target": "positive"}
{"text": "In todays competitive OTT landscape, platforms like Netflix, Disney+, and Amazon Prime Video thrive by using AI-powered recommendation engines that personalize content for each viewer. By analyzing user behavior, preferences, and viewing history, these engines suggest relevant content, keeping users engaged, reducing churn, and boosting revenue through better ad targeting and subscriptions. Implementing AI recommendations involves collecting user data, choosing the right algorithm, integrating it into your platform, and continuously optimizing for improved user experience. Check out the full insights here .", "target": "negative"}
{"text": "I was chatting with a few D2C founders recently, and almost all of them said the same thing: they spend more time juggling dashboards than actually focusing on growth. Between Shopify for orders, Amazon or Flipkart for marketplace sales, Google and Meta Ads for campaigns, spreadsheets for P&L, and analytics tools for customer data, it feels like half the job is just logging in and out of platforms. And all of this just to answer basic questions like: Whats my real profit this week? Which channel is actually driving sustainable growth? Are repeat customers even profitable? Most brands either hire analysts to stitch things together or just go with a gut feeling and whatever the agency report says. It made me wonder if AI could actually act like a co-founder in this chaos, pulling data from everywhere and giving direct answers in plain English. Has anyone here tried building something scrappy like that, or found a good way to solve this? Really curious how other operators are managing it.", "target": "positive"}
{"text": "If you're building something, finish it. Do the marketing. Talk to people. I wanted to share a personal story about how I almost let my project go before it ever had a chance. I've built over 8 projects before this. Some shipped, some didn't. Most flopped. At one point, I had started working on what eventually became a platform that helps founders find real, validated problems to build around. I had the idea, started scraping Reddit posts, G2 reviews, App Store feedback but I paused. Back then, I had a habit of stopping halfway. I'd build something, lose confidence when it didn't immediately take off, and jump to the next thing. That almost happened with this one too. At the time, I had a working prototype. I could generate startup ideas from Reddit threads, analyze SaaS gaps from reviews, turn App Store complaints into product opportunities, and identify what users hate about existing mobile apps across categories like period trackers, meal planners, and photo editors. I even shared a small post or two, got decent engagement, some messages, but nothing crazy. I almost gave up again. But something told me this time was different. So I kept going. I finished the MVP. I posted consistently. I asked for feedback. I improved it weekly based on what people actually wanted. Now it has over 6,000 users and has made $22,000 in revenue (5.6k in the past 2 months!!) Looking back, I realize how many projects I gave up on just before they might have worked. That's why I'm sharing this. If you're building something, don't stop halfway. Finish it. Talk to people. Share it. Iterate. It probably won't take off right away. But you'll never know if you quit too early. if you'd like to check it out: Link proof of revenue from the past 2 months: https://imgur.com/a/5600-revenue-Pfqdeb8", "target": "positive"}
{"text": "Something happened yesterday, and it opened my eyes to how lonely I have become, I realized that the past 5 years of trying to make it work isolated me, not only socially, but also emotionally from others. It is almost like I can't really relate to the average person's problems, and the opposite is true. Now, I tried making friends based on my other aspects of life, such as major hobbies or special interests, but none lasted long, and I believe great friendships are built on shared suffering and success, thats why school was a great friendship machine. So, I thought why not make friends with other solo business owners, we share similar struggles, and similar achievements, both of which we mostly had to experience alone, its a horrible feeling wanting to celebrate sudden success, but not knowing who to tell or share with, and even worse when you have to mourn failure alone. Let's be friends, let's build a community where we don't sell, but celebrate, collaborate, enjoy each other's company, and possibly create life-long friendships. I will not simply make a discord server and post the link, this almost never works. Instead, the plan is to group match-make, if any of you is interested, let me know in a private message, and we'll talk for a while, then I'll attempt to group matching people together in their preferred platform, probably either discord or WhatsApp.", "target": "positive"}
{"text": "I'm about to launch a prototype of my web app as an experiment and I want to buy some traffic to see how it performs. What are my options? I don't want to spend time making/learning how to make video ads and I'm not good with image editing. Ideally, text-based ads would be preferable.", "target": "positive"}
{"text": "As the title says. I have no social media following so no audience to push to. How do people market their unproven beta saas to get test users? Where are people actually building in public?", "target": "positive"}
{"text": "Hello , I have built a marketplace for freelancers (ConnectInk). It is a freelancer network where professionals showcase their skills and team up to build projectswhile businesses tap into ready-made creative talent. Looking for any ideas, tips and resources to onboard more users (freelancers/businesses)", "target": "positive"}
{"text": "I'm paralyzed by the marketing aspect of my business. Part of it is me. Part of it is my industry. I'm in the self-improvement space (coaching for procrastination, mental health, etc) which is a space saturated with low quality products. As someone trying to offer a high quality service, here is the issue as I see it. Effective growth happens through a complex process which is unique for each person, which means its complex to market. Ineffective growth is sold through simple solutions which apply to everyone at once, which makes them fit more easily into a traditional sales funnel. Ex; \"This 1 strategy will stop procrastination instantly\" VS. \"Procrastination is caused by many things and has many different solutions. I help you manage your expectations and find your blind spots.\" I feel stuck between demonstrating my value in a way that is too complex to hold attention and interest, and only being able to simplify my message by stripping away what makes my service effective  giving away my only real advantage by doing so. I thrive in long-winded discussions (podcasts)  but growing a business solely via podcast is obviously unfeasible. Im hoping for a budge in two ways: 1. Perspective Adjustment  snapping myself out of the snootiness, perfectionism, self-critical process that causes me dismiss 90% of my ideas and options for viable promotion. 2. Advice for marketing a complex service: I think my service is inherently complex and cant as easily fit into a typical sales funnel strategy. What types of content or marketing strategies are better for a service where it takes a long time to educate consumers? Recommendations for podcasts, resources, systems, or just your personal experiences and opinions  anything would be highly appreciated.", "target": "positive"}
{"text": "Ok so pricing is the mind game nobody talks about honestly... like everyone gives theoretical advice but here's what actually happened when I tested different prices for TuBoost.io (with real numbers and psychological tricks that worked) My pricing journey (with actual conversion data): Phase 1: $10 (the \"safe\" price) Conversion rate: 8% Monthly revenue: ~$50 Customer feedback: \"seems too cheap, is it legit?\" My mindset: scared of rejection, wanted everyone to afford it Phase 2: $50 (the \"ambitious\" price) Conversion rate: 0% Monthly revenue: $0 Customer feedback: crickets (nobody even tried it) My mindset: panic, immediately doubted everything Phase 3: $30 (the \"goldilocks\" price) Conversion rate: 6% Current monthly revenue: ~$770 Customer feedback: \"fair price for the value\" My mindset: finally found the sweet spot The psychology tricks that actually moved the needle: 1. Anchor with value, not features BEFORE: \"AI video processing for $30\" AFTER: \"Save 3 hours of editing for $30\" People buy outcomes, not technology 2. Compare to alternatives they already use \"Less than what you spend on Netflix, saves you 10+ hours monthly\" \"Cheaper than hiring an editor for ONE video\" Makes the price feel obvious instead of expensive 3. Remove the biggest objection upfront Added \"Cancel anytime, no questions asked\" Conversion jumped 40% immediately People need emotional permission to buy 4. Use precise numbers (psychological trick) $29.99 feels \"marketingy\" and fake $30 feels honest and confident Weird but precise pricing ($23, $37) can work for premium positioning 5. Payment psychology that matters \"Less than $1/day\" breaks down resistance Annual plans with 2 months free (creates urgency) Never say \"only $30\" (makes it sound small/cheap) The uncomfortable truths about pricing: Truth 1: Higher prices filter for better customers $10 customers complained about everything $30 customers give constructive feedback Price affects customer behavior, not just revenue Truth 2: Most people undercharge from fear, not strategy We're scared of hearing \"that's expensive\" But \"that's expensive\" just means they're not your customer The right customers don't negotiate on small amounts Truth 3: Value perception trumps actual value Position yourself as premium solution to specific problem Not cheap alternative to expensive thing \"Best video editor for creators\" vs \"affordable editing tool\" Specific tactics that work: The \"comparison anchor\" method: \"Professional editors charge $100/video\" \"This processes 20 videos for $30\" \"ROI obvious when you do the math\" The \"time value\" calculator: \"If your time is worth $20/hour\" \"And this saves 3 hours monthly\" \"It pays for itself in half a month\" The \"social proof\" pricing: \"39 other creators are already saving time\" \"Join the creators who value their time\" FOMO works if it's genuine Common pricing mistakes I made: Competing on price : Race to bottom, attracts wrong customers Explaining the price : If you have to justify it, it's wrong Changing prices randomly : Confuses positioning and brand Ignoring customer feedback : They tell you if it's right or wrong How to test pricing systematically: Start with value-based pricing (what outcome is worth to them?) A/B test 20% higher and 20% lower Track conversion AND customer quality metrics Ask customers \"what would be expensive for this?\" Adjust based on data, not feelings The mindset shift that changed everything: Stop thinking \"what can I charge?\" and start thinking \"what's this outcome worth to someone who has this problem?\" Questions to find your right price: What do customers spend on alternative solutions? How much time/money does your solution save them? What would they pay to avoid their current frustration? Are you attracting customers who value what you built? Real talk: pricing is 80% psychology, 20% math. Most founders get this backwards and optimize for conversion rate instead of customer quality. Anyone else have pricing breakthrough moments? The psychological aspect of this stuff is wild when you start paying attention to it. Also curious what pricing mistakes you've made because I guarantee I've made worse ones lol.", "target": "positive"}
{"text": "Hey Reddit, I've been building a document processing platform that automatically extracts data from invoices, bills, receipts, and bank statements with real-time fraud detection. Currently 80% complete and looking for honest feedback before investing more time. What it does:  Bulk Upload: Drop 100+ documents at once, processes in ~2 minutes with 99% accuracy  Multi-language OCR: Upload invoices in Chinese, Arabic, Spanish, etc.  outputs standardized English fields (e.g., Chinese \"\"  \"Invoice_Number\")  Email Auto-Extract: Forward invoices to dedicated email, automatically processes attachments  Line Items Extraction: Pulls individual products/services with quantities and prices from tables  Real-time Fraud Detection: AI flags suspicious patterns, duplicate invoices, unusual amounts  Smart Organization: Auto-categorizes expenses, assigns to clients, tracks payment status  Share Links: Generate upload links for clients/vendors to submit documents directly  Expense Intelligence: Classifies as income/expense, suggests tax categories, tracks cash flow  Accounting Integrations: Odoo integration ready, Xero/QuickBooks/Sage coming soon The tech: PaddleOCR + DeepSeek AI for extraction, Django backend, processes PDFs/images/scans. My question: Is automated document processing with fraud detection something businesses actually need? Worth finishing the last 20% and launching? Processing speed: 100 invoices  structured data in under 2 minutes at 99% accuracy. Be brutal - should I continue or pivot?", "target": "positive"}
{"text": "1 year ago, I quit my job as a software engineer. 6 months ago, I started building a Reddit marketing tool to help brands find their first users on the platform. I've been dedicated to this for the past few months. It all started by chance. One day, I saw a post where a startup founder shared how they tried to promote their product on Reddit, but because they didn't understand the community culture, many of their posts were heavily downvoted and eventually deleted. It got me thinking: How many brands are wasting time and effort because they don't know the rules and culture of every sub? I want to help entrepreneurs get rid of this confusion for good. If you can find the communities that are already actively discussing topics related to your product and master the right marketing approach, your chances of success will increase dramatically. Here's what I'm building: a Reddit tool with an AI Matching feature. It will use AI to analyze your product information and keywords, then precisely match you with the most relevant subreddits. This ensures your content reaches the right people and prevents you from wasting effort in the wrong communities. To build this tool, I've analyzed over 100,000+ subreddits, 500,000+ Reddit posts, and 3,000,000+ comments. And it's worth noting that during my analysis, I noticed some subreddits have very strict written rules, but their posts and comments are managed more loosely. It's important to identify these situations. Here are the results so far: - 500+ visitors to my website - 300+ registered users - 100+ paying customers - $3,500+ in revenue last month While it's not life-changing yet, it feels amazing. It proves that if I provide real value, people will actually pay for what I've built. For anyone building a product and feeling like they're toiling in obscurity, my advice is this: If you can find a pain point that users are actively discussing, that's your opportunity. If you're also trying your hand at Reddit marketing, this tool might save you a ton of time and effort, and even provide you with a better strategy. If you'd like to check it out, my tool is called Leadmore AI. It already has a content publishing feature, and the features mentioned in this post will be live this week. Feel free to join r/LeadmoreAI for the latest updates!", "target": "positive"}
{"text": "Curious to hear how others tackle the never-ending battle of refactoring and keeping technical debt under control. Whats the hardest part about managing or cleaning up code in your team or solo project? Do you have any systems or rituals that actually work, or do you mostly end up doing grunt work before every new feature? How do you know when to say enough is enough and actually bite the bullet on a big refactor? Ever found tooling, automations, or lightweight workflows that made a dent? Or is it all just PR to PR, sprint to sprint? Would love to hear stories, war wounds, or clever tacticsespecially from people constantly balancing moving forward vs. cleaning up the old. (Personally, sometimes it feels like I spend more time on invisible improvements than \"new\" features.) Lets make a thread full of real strategies, venting, and hopefully a few tricks that actually helped someone!", "target": "positive"}
{"text": "Big step for me Ive finally gone rogue and launched my own Media Agency! After almost 6 years of working with brands as an employee and freelancer, I decided its time to build something of my own. Over the years, Ive handled everything from content strategy & creation to running ads and influencer marketing campaigns and now Im bringing it all under one roof. Ive been lucky to work with some amazing brands along the way, like: Skechers Gulf Oil McLaren Oxienutrition Alkalen Now, Im looking to collaborate with businesses from different industries and build a strong portfolio. If thats you (or someone you know), lets chat!", "target": "positive"}
{"text": "Hey Solopreneurs, Running a one person business means juggling a lot, especially money. One thing that really helped me level up was focusing on building business credit early on. Why? It keeps your business finances separate from your personal ones, which protects your credit and makes taxes easier. Plus, banks and lenders look way more favorably on businesses with their own credit histories. That means better loan options, credit lines, and payment terms. Having solid business credit also boosts your credibility with vendors and partners, often getting you better deals and trust. And it gives you financial flexibility when things pop up unexpectedly or when you want to grow fast. Getting started is simple: a business credit card or small line of credit, using it responsibly, and paying on time. Over time, it builds a strong foundation that lets you focus on growing your solo venture without money stress. If you want to swap tips or hear what worked for me, lets chat. Building smart means growing strong. |", "target": "positive"}
{"text": "Im selling 100% ownership of a fully developed AI Resume Builder SaaS . Its live, has traction, and is ready to scale. Highlights: 150+ signups AI-powered resume tailoring (upload resume + match job description instantly) Modern UI with light/dark mode Stripe subscriptions integrated (2 tiers live) 2 users already purchased in the first month  proof of willingness to pay Interest in white-label licensing from agencies/coaches Built on Next.js, React, Prisma, Vercel, Stripe, OpenAI Why this is a big opportunity: Evergreen market: 50K+ monthly searches for AI Resume Builder Competitors like Enhancv, Resume.io , MyPerfectResume get millions of monthly visitors Easy to operate: ~12 hrs/week Huge growth levers: SEO, TikTok/LinkedIn ads, B2B white-label deals Whats included: 100% ownership of the codebase & GitHub repo Active deployment (Vercel + Stripe integrated) Domain & branding Full transfer + walkthrough If youre interested, drop a comment or DM me  happy to answer questions or jump on a quick demo call/walkthrough.", "target": "positive"}
{"text": "Looking for a game like Palia, identical almost, but with fighting or dungeons. Does this exist?", "target": "positive"}
{"text": "Hey everyone  Im Tanguy, a designer turned developer, and I just launched SuperGymbo . SuperGymbo is a home workout app where a robot coach guides you through no-equipment workouts. You just choose how much time you have (5, 10, 20, or 30 minutes) and the type of workout you want to do (full body, upper, lower, or cardio/HIIT). Every day youll get a new workout for each category, so you never get stuck repeating the routine you have already done 20000 times. The idea came from my own frustration. I was tired of doing the same YouTube workouts. What I wanted was something simple: no overthinking, just open the app, pick a time, and follow along. So I built the app I wish I had years ago. Since I also do 3D animation, I created a robot coach who demonstrates all the exercises. He makes the workouts feel more fun and less serious, and hes also become my mascot for the project. I love mascots. So far, I have reached a little over 50 users and I am currently going all in on TikTok for marketing. Happy to talk about it !", "target": "negative"}
{"text": "where can i listen to music with no internet?? for ios please", "target": "negative"}
{"text": "I recently came across the Wareeg app, and it could be an interesting way to meet travelers and earn money in a more flexible manner than through a traditional touring company. I have used similar tools in the past through TripAdvisor when I have taken my own vacations. But since it's a new app I would like some people on here willing to share their experience and whether they would recommend it to others. I am considering getting involved in the Seattle area.", "target": "positive"}
{"text": "Anyone else on the Minutiae app? If so, would love to hear your experience. Ive been on for a few weeks and so far its pretty cool.", "target": "positive"}
{"text": "https://preview.redd.it/cwn9d849mglf1.jpg?width=150&format=pjpg&auto=webp&s=c173cb078ee0fd04e8332d0f4029b009a63fb7f3 I just built this ' fairydust AI ' app to be sort of an AI utility for fun or useful applications of AI when a 'chatbot' interface doesn't necessarily make the most sense. It's kind of fun for stories, recipes, images, there's even a few games in there. If you try it out, I would appreciate any feedback!", "target": "negative"}
{"text": "Does anybody remember this animation app on iPad called \"Animator\"? I've been trying to see if it was ever even remotely used by people and from the looks of it that doesn't seem to be the case. It's a lost app potentially :<", "target": "positive"}
{"text": "I'm looking for an app called hourly reminders or something like it. It's supposedly an open source app that Reddit users rave about. Supposedly it's found on this other app called F-Droid which I installed at the behest of ChatGPT. There is no app in f-droid called hourly reminders. Does anybody know of an app that will remind me for free every hour? Google Assistant just shoves in tasks as a one time event.", "target": "positive"}
{"text": "https://preview.redd.it/9xkbuvt27flf1.jpg?width=2000&format=pjpg&auto=webp&s=4e7a1aa979d767ee2c951273e2715fcba1a7bf29 My new app just went live on the App Store. Greetings From Space introduces spatial messaging with a library of 3D reactions for Messages. Theyre like GIFs, emojis, or stickers, but in augmented reality. Download it today on the App Store: https://apps.apple.com/us/app/greetings-from-space/id6480014639 For many people this may be the first theyve ever seen AR. Ive shown this approach to hundreds of people and hear very often, I didnt know my phone could do that! One of those just-for-fun apps that gives a little taste of the future. Hope you have some fun with it.", "target": "negative"}
{"text": "Hi. Before answering with \"Ninite\" or \"Winstall\", this is not what I'm looking for. What I'm looking for is much more flexible and customizable. Here's what it must be able to do: Take any installer for a software I provide. Be able to copy a portable app to a desired directory. (And be able to create said directory if necessary) Be able to add or replace files after an install. This is, for example, to copy a backup of software settings to AppData or install plugins that does not come inherently with an app and does not necessarily have an installer. Be able to resume progress after a reboot if an app required it. As such, able to know when an app has finished installing and detect if its installer downloaded another installer such as an optional plugin for an app does not have in its installer but can fetch it for you or missing dependencies. A great example is any MS Visual C++ Redistributables) Ability to run all installers silently or verbose. (Optional) Ability to create a personalized .exe or .msi with all the required files inside. (Optional) However, it is required that, at least, it's able to create its own proprietary package format in one file. Having to install this app before all others is acceptable. The ability to add drivers install package is optional (since these might be more sensitive or more machine specific) Having a GUI and no scripting / programming knowledge is REQUIRED AND NON-NEGOTIABLE . It can be free (closed or open source) or paid. REASONING: A lot of people might say \"why not make an image of your OS install?\". That can work but they are inefficient space wise: they have the WHOLE OS and all the shebang along with it. On top of that, what if you want to change the version of Windows and fresh install it? Using the image will only re-install the same version of the OS. For most people, Ninite and Winstall will do the job but I find that, looking at both options, that there are missing a lot of apps I want installed, want finer control or are legacy apps not available for download anymore. Some are paid apps which might need me to enter the product key. So, they can't be included in Ninite or Winstall. My setup is particular as well: I have several dozens of apps and it take me DAYS to have everything back up and running after a Windows re-install. So, just me thinking about re-installing Windows is nightmarish. Just having to double-click a file and have them all installed in 30 minutes, including their most up-to-date backed up settings, would be AMAZING. Now, I know I might be pulling at straws here. There might not be such program floating around. That's why I'm willing to pay for it - if it exists. I'd really love if Reddit knows of such an app. I know it bears similarities to Ninite or Winstall but some kind of offline option with the possibility of other apps. Thank you!", "target": "positive"}
{"text": "I am involved in a community of small business owners, mostly people who own boring companies like plumbing, roofing, commercial cleaning, manufacturing, etc. Over the last couple months theres been a bit of a shift in the conversations we usually have It used to be a lot of talk about general experience sharing, planning/growth, team building, and other generally positive things. Lately Im hearing more stuff like, We REALLY need to get sales in the door or were in trouble or this cash crunch is the worst its ever been. Feels like the end is always near but never hits Not everyone is saying this, but the last couple months Ive heard it a lot more. Talked to another owner yesterday in totally different groups and he said something very similar. I feel like theres been a lot of talk for the last 2-3 years about a looming recession but this is the first time Ive actually seen people really feel like theyre in a tight spot. Curious if others here are seeing this too, or if its just the circles Im in.", "target": "positive"}
{"text": "Need advice on selling own small online business, have all financial info and stats, MRR $3000-$3500, ARR $36-38k with potential for growth. Where to start, guys? Any tips? Thanks in advance.", "target": "positive"}
{"text": "When I started with digital products, I realized creating them was easier than getting that very first sale. What about you  was the harder part building or selling?", "target": "negative"}
{"text": "I run a small plumbing business and keep finding out after the fact that someone in my area was desperately looking for help on local Facebook groups, Nextdoor, or even Reddit while I was sitting there with availability. Just yesterday I found a post from 3 days ago - water heater emergency, need plumber NOW - posted 2 miles from my shop. Theyd already hired someone by the time I saw it. This happens constantly. By the time I check all these platforms manually, the opportunities are gone. What are you all doing to catch these faster? There has to be a better way than manually checking every local group daily.", "target": "positive"}
{"text": "Can anyone recommend a harder money lender who deals with poor credit? I have an established business with stable monthly deposits. Looking for $100k+, 3-6 month payoff.", "target": "positive"}
{"text": "I am trying to focus on creating thank you card templates for my digital store, Do you think as a business owners thank you card is necessary", "target": "negative"}
{"text": "First off a little bit about me: Engineering graduate with strong technical foundation Didn't make it into my target master's program, but realized that was actually a blessing - I was planning to start a business after graduation anyway, so why wait? Decided to go straight into AI automation since that's where I see massive opportunity Recently completed specialized coursework to sharpen my skills - I'm the type who believes in being prepared Coming from a middle-class, single-earner household with zero connections or inheritance - everything I build will be 100% earned I'm specifically reaching out to successful entrepreneurs and business owners who started from nothing and built something significant. Here's what I need guidance on: Getting started strategically - What's the smartest first move when you have skills but no network? Breaking out of analysis paralysis - How do you shift from learning mode to earning mode without feeling unprepared? Pricing strategy - What do businesses actually pay for real value, not just cool tech? Maintaining momentum and destroying your ego- How do you stay motivated during rejections and the inevitable slow periods? tools - list of best free/ cheap tools you have to have when starting out. Why I'm asking here: I've discovered Reddit has an incredible community of people who've actually walked this path. I'm not looking for shortcuts or handouts. I want to learn from people who've been where I am and came out winning. I'm ready to put in the work and have a lot more context I could share, but I tried to keep this focused on what matters most. Any wisdom from those who've built something real would mean everything", "target": "positive"}
{"text": "Want fresh juice in seconds with zero effort? The Zulay Citrus Press is your new kitchen MVP. https://www.amazon.com/dp/B07D5KRQL7?maas=maas_adg_2B0CDB3F505663221A1CDFAE10D34651_afap_abs&ref_=aa_maas&tag=maas .", "target": "negative"}
{"text": "Ive been doing videography from 15-26 Now Im ready to go official with a bank acct and LLC (if the later is recommended) I went on a 3 year hiatus and my local industry has new primary go tos for the work, but Im still a local staple. Im spending September rebuilding and choosing my specialty but before I take on new clients I want get my paper work done. I was just going to go to M&T bank after work and inquire about a business bank account to keep track of all of my expenses and income easier. Any tips or advice? From dont do an LLC yet to get the LLC before bank or use a credit union and stay sole proprietor (So far Ive done my taxes as sole proprietor) just looking for friendly advice not to hold anyone liable for my choices lol", "target": "positive"}
{"text": "Hi all, Im exploring the possibility of opening a Goddard School franchise in California and wanted to tap into the community for real experiences. If youre a current or past Goddard franchise owner , how has your journey been? Do you feel the investment has been worth it in terms of enrollment growth, support from corporate, and profitability? For parents with kids in Goddard Schoolswhats been your experience? Do you feel the quality of care/education justifies the cost? Any red flags (hidden costs, unexpected challenges, competitive pressures, licensing issues in CA, etc.) that someone considering this should know about? On the flip side, whats been the biggest benefit of being part of the Goddard system? Im especially curious about California locations how theyve performed given the high cost of real estate, staffing challenges, and state licensing regulations. Any honest insight, success stories, or warnings would mean a lot before I move further with this. Thanks in advance!", "target": "positive"}
{"text": "Ive been running a small design business for two years and have gotten by fairly well on word of mouth. Which I liked, because I live in a small tourist town and word of mouth goes a long way. And I reeeally dont want to advertise. It feels disingenuous, and a tad scammy. Believe me, I dont feel this way about advertising in general. Its just not how its really done around here (ads in the traditional sense seem to be directed towards incoming tourists buying their second, third, fourth homes which is the opposite of the clientele Im aiming for). I decided to get a website up and running. Its simple yet nice in my opinion. Ive ran websites for a few different firms, so I feel its a good start for the type of advertising Im looking to do (have a web presence). In the week Ive had it up, Ive been bombarded through my contact form by SEO experts saying my online presence sucks and only they can help me. I understand SEO (at least somewhat enough), and I feel like I know the buzzwords potential clients are searching for. I recognize the websites I ran previously were for more established organizations, so thats a big difference from where Im starting out. I just cant stomach paying someone thousands of dollars to reach a potential couple hundred people in my targeted audience to boost word of mouth. I just want my website to show up when someone looks for somewhat niche design, located in such-and-such county. Obviously theres something out there Im not understanding that are bringing these SEO vulture experts my way and not my broader audience. Ideas?", "target": "positive"}
{"text": "I purchased a poster that is due to ship soon , shipping from a UK seller to US ( me the buyer ), price was about 70euro, so around $100+. we are waiting till after Aug 29 till he ships it to me. he is a private seller. what can i expect after the new tarrif law in a few days? am i going to have to pay USPS once it arrives? or is this handled from seller side with royal mail? i have no clue how tarrifs works, ive ordered from UK before item just arrives to my door, nothing more to do. what would be the situation in this case? is it possible since its a poster it still follows its specific HTS classification making it free of tarrifs? chat gpt says either way after new law im paying usps a flat fee? please explain like im 5. TY", "target": "positive"}
{"text": "Hello, Iv designed a new product for golf that took me almost 2 years off and on of working towards getting the image out of my head and being able to 3d print a prototpye. I started by learning CAD, the very basics, and outsources the technical shaping, logos, and pattern designs to go on the product. Now I have a near finished product (i think) What should my next steps be? Desgin patent Finding a manufacturer Finding partners to join/invest? -Would like to go solo as far as i can but feel like i keep getting stumped My current thoughts where i am stuck are: I need to get a realistic prototype i can actually use and test to therfore make corrections as needed. As the 3D printed prototypes are just physical models not applicable/usable. This needs to be a mold/rubber polymer manufacturer But to do so i need to find a manufacturer to make my product without breaking my wallet to test prototypes. I believe i need a patent before sharing or reaching out to manufacturers. This too will break my wallet but i plan on doing so. how can i get small batches of my product made while i test the diffent Corrections/changes? TYA also let me know if this should be posted somewhere else!", "target": "positive"}
{"text": "My wife and I are buying into a partnership of an existing struggling business. Aside from the obvious concerns, should we use our own LLC as a partner or become part of their existing LLC? Benefits and dangers of both?", "target": "negative"}
{"text": "Small town, population around 6000, there is a building site inside the city limits and one outside of them. Business is roofing. 1 office worker, 5 man crew.", "target": "negative"}
{"text": "Small tweaks help local SEO: Post an update/photo weekly Reply to all reviews Keep hours current Google rewards active profiles with better visibility.", "target": "negative"}
{"text": "Hi! Im wondering if anyone knows of any orgs that provide volunteer marketing help for mission driven small businesses in LA? I had someone call me yesterday after seeing a flyer for my business. She offered to help out with marketing because the mission resonated with her. She asked me to text her my availability but then she never answered- Im feeling bummed but I decided to look into whether I could get pro bono marketing help somewhere else. Of course there are a ton more options for nonprofits. I have some regrets about opening as an LLC instead of a non profit (I had reasons for this at the time). Wondering about resources for small businesses", "target": "negative"}
{"text": "Hi Everyone, Im looking to start a business as a sole proprietor and I havent been able to figure out in my research why you would want to loan your business rather than provide an equity contribution. Would someone please elaborate? Im new to this so I thought if I for example transferred $1k personal funds to the business, that is viewed as an equity contribution which Ive already paid taxes on and wont be used in the business taxes as the profit (revenue - expenses) is what Im taxed on. Im paid back on the contribution with what profit I make. Sorry for all my confusion but appreciate everyones help in advance!", "target": "positive"}
{"text": "One of my workers hurt himself on the job today. We have everything workers comp insurance through our PEO. I believe that's the acronym. Anyways I reach out to them and they're taking me through what I need to do with them. Is there anything I should watch out for or be aware of? Thanks in advance", "target": "negative"}
{"text": "I want to make a try to sell them on line. I don't have any idea how to do this. I would be making them with generic bricks that don't say Lego. Please, any advice and perhaps step by step instructions. I'm afraid I'll screw it all up.", "target": "positive"}
{"text": "Hi guys. Minor here. I'm bashing my head against the wall right now as we speak because just about every single bank has declined to take my LLC. I'm stuck without options. Anyone have any places that will let me have my business actually have a bank account without outright rejecting just because the business owner is 16? I'm supposed to be receiving crowdfunding donations and grants right now and I CANNOT have these in my personal accounts.", "target": "positive"}
{"text": "As the title states I have an LLC and have contracts for a couple clients and just badly need to hire someone for data entry. I just cannot afford to hire someone locally at $20/hr and have a day here and there where theres nothing to do. This could grow to a need of 1-3 people and slightly beyond in the future possibly. What are your experiences? What nation did you hire out of? Any you wouldnt? Which EOR best provides super small businesses with help? Strong English skills are a must. Time zones are almost completely irrelevant. I just need one employee now within 30-60 days. Are they quick to train? Can I pay a bonus if work is done well? Is it really ONLY $600 a month total? For salary HR etc all included? If my contracts were cancelled for any reason with clients can I quickly end my EOR or is there a term contract?", "target": "positive"}
{"text": "Ive been thinking a lot about how small business owners manage their online presence. Many Ive spoken with rely mostly on Instagram, and arent easily findable on Google or Yelp because verification can take a long time. Im exploring building a tool that would let business owners: Create custom listings with their brand colors Showcase services and photos Collect reviews Manage bookings Id love to hear from small business owners here: How do you currently manage your online presence? Whats the hardest part about getting discovered online? Are there features you wish existed in one place?", "target": "positive"}
{"text": "Hi everyone! Ive built a new feature for Your X Buddy - it analyzes your posts on X and shows the best time and community to post in order to maximize engagement. If you have feedback or run into any bugs, Id love to hear from you!  Also, if theres interest, I can bring the same functionality to Reddit via my [ RedditBro extension]. Would love your thoughts!", "target": "positive"}
{"text": "Been 9 months since i started my directory submission hustle. heres where were at: - 100K+ total visitors sent - avg revenue per visitor: $0.34 - worked with 500+ founders - avg DR lift: +23 - avg backlinks per site: ~120 (link to tool: submit website to directories ) honest part: weve had to redo work for ~30 clients because DR didnt move, some sites didnt index, or submissions got rejected. painful but true. things founders kept asking us for that we couldnt deliver (yet): guaranteed DR increase refund if DR didnt increase ongoing DR maintenance (since it keeps falling if you stop) fully done-for-you option so after 9 months of learning + failing + listening, were launching something new and i want feedback from this community that helped us grow: WOHOOO - 100% guaranteed DR 70+ increase service, or refund $500 one-time setup $50/month maintenance to keep DR above 70 if DR doesnt cross 70 within 4560 days  full refund unlimited listings in niche + high DR sites until the target is hit basically: if you dont grow, you dont pay. would love feedback on: is this pricing fair? is this something youd actually pay for? what feels off / what would make it more useful? building this in public  happy to hear brutal takes too.", "target": "positive"}
{"text": "As an ADHD person, I've been having a rough time following through on tasks - especially tasks that I really don't want to do (setting up my new healthcare, returning something to amazon, etc...) I hit my breaking point last week, and decided that it was time to make something to fix this. So I'm building a \"do\" assistant - Whenever AI. Here's how it works: 1. Enter a task 2. The assistant breaks it down into steps 3. For each step you get one-tap actions and the exact info you need to complete the step Basically, how can we make it so easy and frictionless to do a task you can't say no. For example, I need to Post Barstools to Facebook Marketplace Whenever breaks the task into steps: 1. Take photos, 2. Write Item Descriptions, 3. Set a price 4. Create listing Then, for each step it gives you everything you need to complete that task as easily as possible: 1. Take Photos -> One tap open camera button, guide on how to take the best FB marketplace pics. MVP launches this week - if you're interested join the waitlist: https://www.getwheneverai.com/ Just trying to get an idea if we're heading in the right direction with this. Would an app like this help you? Do you have any tasks that no matter what you can't get yourself to complete?", "target": "positive"}
{"text": "Hey, Im a physics student at the University of Waterloo Over the summer, I built a website called Math & Matter It's meant to help students see the connections between concepts and build a deeper connection in understanding by making topics easier to understand. Link: mathandmatter.com More details in the comments!", "target": "negative"}
{"text": "Like its just not, they're just doing it for marketing and everyones supporting it because its mental masturbation and makes you feel closer to achieving a dream that very few achieve, maybe I'm just jealous and haven't reached that point yet but this is definitely how I feel.", "target": "negative"}
{"text": "Last year, I started looking at failed product launches across Twitter, Product Hunt, and Reddit. I analyzed 1,000+ failed SaaS launches and interviewed 47 of their founders. The results were crazy to me. Only 12% failed due to technical issues or poor execution (pretty low with AI now). The overwhelming majority was that 73% failed because they built something nobody actually wanted. and also: 89% of these founders claimed they \"validated\" their idea before building. So what went wrong? Every single founder I spoke to followed the same \"SaaS Playbook\": surveys, landing pages, interviews/posts with people in their niche. They got encouraging responses, built the product, launched... and no one gave any shit. The problem isn't that validation doesn't work. The problem is that most validation methods are fundamentally flawed. When you ask someone \"would you pay $29/month for this productivity tool?\" in a survey, they're giving you a hypothetical answer. They want to be helpful, so they tell you what sounds reasonable. But real purchasing decisions don't happen in surveys. They happen when someone is frustrated enough with their current solution to actively search for alternatives. The founders who succeeded did something different. They didn't ask hypothetical questions they found people who were already complaining about existing solutions. One founder I interviewed built a project management tool after spending weeks in contractor Facebook groups where people constantly complained about existing software. Another created a scheduling app that fixed what users hated after documenting hundreds of negative reviews about calendar tools. They found real pain points FROM EXISTING products, not just imagined problems. The difference between a complaint and a survey response is everything. complaints are unfiltered, detailed, and come from people actually using the software that they pay for. They reveal specific frustrations, workflow breakdowns, and feature gaps. That's why I started collecting these complaints systematically. G2 negative reviews where people explain exactly why they switched platforms, Reddit threads where users detail their software frustrations, App Store feedback where people describe what made them delete apps. Here's the data if you want to check it out: link (if you are curious) Your next successful product isn't hiding in a useless brainstorming session or \"survey\" results from posts on different platforms. It's sitting in plain sight in every detailed complaint thread, frustrated review, and angry support ticket. Stop asking hypothetical questions. Start listening to real problems.", "target": "positive"}
{"text": "Hey everyone! Built this because I got tired of dating apps that only care about looks. Circle lets you match based on what actually matters; whether you meditate, practice yoga, are into alternative wellness, or just value authentic relationships. Plus you can switch between dating and friendship mode anytime. What makes it different: Match on practices like meditation, breath-work, energy work (not just generic \"interests\") Dual intent: dating, friendship, or both Compatibility system based on wellness practices and personal growth approaches Built for people who want meaningful connections over surface-level stuff Tech stack: React Native + Expo, Firebase backend, Stripe payments Status: Mobile app 80% done, landing page live at joinfullcircle.app Stage: Getting feedback from beta users and building waitlist The interesting challenge: Building matching algorithms for lifestyle/wellness compatibility is way harder than basic filters. How do you weigh someone who's into \"plant-based living + meditation\" vs \"alternative healing + personal growth work\"? Started this as a side project but it's becoming my main thing. Looking for: Feedback on the concept and anyone who knows mindful/wellness communities who might be interested. Check it out: https://joinfullcircle.app", "target": "positive"}
{"text": "It is basically a personalized document maker that uses llms to write stuff in your way. it can make Legal docs, Question papers, any document that u think becomes too generic when ai writes it....also adding a really nice presentation editor that has some great animations. Your advice is appreciated on everything(i am new at this so dk what to do apart from coding and seo) ps : still making so not launched or nothing like a signup page", "target": "positive"}
{"text": "available for trying at minepal.net/imagine , let me know what you guys think!", "target": "positive"}
{"text": "Hello everybody. I am quite excited to share one of the projects of mine that Ive been working on - https://secureledger.app/ . It is the quite typical finance manager app with a couple crucial differences - one of which is the maximum possible privacy of the users data. There are also few AI features for ease of use and deep data analysis. The project is free except for the AI-based features. Yet, when you create a new dashboard you are given 300 free tokens that should be plenty to see all the features available for free. With this project, I wanted to address a fundamental problem with personal finance apps - the requirement to trust companies with your most sensitive financial data. Most apps store your transaction details, spending patterns, and financial behavior in plaintext on their servers, creating privacy risks and attractive targets for data breaches and misuse of that data. My solution is a receipt processor and expense tracker built on zero-knowledge architecture. The core principle is simple: I cannot access your data even if I wanted to. Here's how it works technically: When you create a dashboard, you set a private password known only to you. This password generates an encryption key entirely within your browser using client-side cryptography. Your sensitive datastore names, prices, purchased items, spending patternsis encrypted in your browser before any transmission to my servers. What I store is encrypted data that appears as meaningless text without your password. The application handles both receipt scanning and manual entry. For receipt processing, I've implemented an isolated AI service that operates anonymously. Your browser requests a temporary token from the main application, then sends the receipt image directly to a separate AI service that has no knowledge of your identity or dashboard. The AI extracts the text and returns it to your browser, where it's encrypted before storage. The AI service never retains the image or extracted text. The dashboard provides comprehensive analytics through interactive charts that decrypt and process your data entirely in the browser. You can track spending patterns, monitor category breakdowns, and even calculate a personalized inflation rate based on your actual purchases. For deeper insights, there's an AI analysis feature that can answer questions like \"Where can I reduce spending?\" using your decrypted data processed anonymously. For shared finances, dashboard owners can generate revocable invite links, but shared users must receive the dashboard password to decrypt and view the data. This maintains the zero-knowledge principle even in collaborative scenarios. The architecture ensures that even in a complete server breach, your financial data remains secure and unreadable. I'm looking for feedback on the concept, user experience, and any concerns about the privacy model. The application is functional and I'm particularly interested in perspectives on whether this level of privacy is valuable enough to users to justify the additional complexity of password management.", "target": "positive"}
{"text": "You work on something. Launch it, get no users but thin, once I market this then it will just snowball. Days pass by and still nothing. So I was wondering. When should you quit? After 60 days? 30?", "target": "positive"}
{"text": "We are in the first year of r/natively , and still going strong :)", "target": "negative"}
{"text": "I have been reading a lot about SaaS founders and their growth stories recently. But I noticed that it is hard to find all this information in one place. I want to know two things: Where do you usually find stories of solo founders making $10K, $50K, or even $100K per month How do you learn about their business models, pricing, and marketing strategies I have found a few indie hackers who share their numbers publicly, which has been really helpful. But apart from random blog posts and X threads, I have not seen a proper place where this information is well-organized. How do you find such insights? Do you follow founders directly, use some tools, or collect data from different sources manually?", "target": "positive"}
{"text": "Lost focus and got lonely working on things alone so I setup an app for solopreneurs to work together, stay consistent, manage tasks and at the end of it all launch their project to other users. All free (and still very much beta stage) but would absolutely love some users to work together with :) https://preview.redd.it/iykfjfmzeflf1.png?width=2948&format=png&auto=webp&s=b14cda2ba702aa4a78334df294532b0b5216f6cf https://preview.redd.it/ywjrp3f5fflf1.png?width=2972&format=png&auto=webp&s=7891f912878155d44e7919ea0a158b6f99bc6b76", "target": "positive"}
{"text": "https://preview.redd.it/bjkvm4tyydlf1.png?width=1976&format=png&auto=webp&s=05cc0eaba11fc6a3d563f2e8639c5efdefb9bf50 I am building Vitraux, a .NET library for manipulating the HTML DOM in WebAssembly applications. Map your .NET ViewModels to HTML in WebAssembly. An alternative to Blazor Webassembly. https://github.com/sebastiantramontana/Vitraux", "target": "positive"}
{"text": "Yesterday I was on a 1:1 demo call for almost an hour Walking him through every single feature, answering every doubt, and honestly, I wasnt sure if he would convert At the end of the call, there was that awkward pause. Then he said the golden words: Okay, lets go ahead with this That feeling when you see your payment notification pop up... priceless. Making a single dollar online sounds easy but trust me, its so much harder than it looks . Every Yes feels like a huge milestone. Onwards to the 3rd one", "target": "positive"}
{"text": "Be honest! how many startup or side project ideas are floating around in your head right now? 5? 10? 50? If youre like most of us in this sub, you dont have an idea problem. You have a finishing problem. You probably know the feeling: You get excited about a new concept. Then you start Googling competitors, wondering if its worth pursuing. You spend hours coming up with names, sketches for logos, maybe even a half-finished landing page. And then it stalls. The enthusiasm fades, and your next big thing ends up buried with the rest of your unfinished projects. That cycle frustrated me for years. I wanted a way to actually test them in the real world without weeks of setup. So I built a side project that basically automates the annoying stuff: validating ideas, generating names/logos, spinning up a landing page, even letting me showcase it on a global map for feedback. Instead of analysis paralysis, I can just ship fast and see if people care.", "target": "positive"}
{"text": "Hey! I've always struggled with todo apps being boring and demotivating. So I built one that turns your daily tasks into a Pokemon adventure for myself and Im sharing it with you guys. Every task you create encounters a random Pokemon, and completing tasks = capturing Pokemon for your Pokdex. You can check it out here . Here's what makes it special: Pokemon encounters - each new task discovers a random Pokemo Gotta complete 'em all - finishing tasks captures Pokemon and adds them to your Pokdex Pokdex tracker - see all your captured Pokemon with capture dates and encounter stats Task management - click any task to add descriptions, notes, or edit the title Built it for free, no accounts needed. Just open and start your Pokemon journey while getting stuff done! PS: If you want to build your own Pokemon-themed apps or customize this one, check out r/davia_ai", "target": "negative"}
{"text": "Hey everyone, Ive been building QuickEditVideo.com  a privacy-first, browser-based video editing toolkit. No signups, no uploads, everything runs locally in your browser. This week, I added a new Text-to-Speech feature that Im really excited about:  Whats new Pause markup : You can now type [pause] into your text to create natural breaks in speech. Multiple [pause] markers = longer breaks. Smooth transitions : Pauses dont feel robotic anymore. The engine handles fade, timing, and even breath-like silences. Speed control : Choose 0.5, 0.75, 1.0, 1.25, or 1.5. The AI adjusts pacing and pauses accordingly. SRT  Speech : Upload a subtitle file and turn it into audio clips (or one file) instantly, with proper timing preserved.  Why it matters Creators can generate more natural-sounding narrations without post-editing. Educators can slow down or emphasize content with pauses and pacing. Accessibility : Anyone with subtitles can instantly generate spoken audio.  Try it here Free TTS tool: QuickEditVideo.com TTS SRT  Speech: QuickEditVideo.com SRT-TTS Its still early, but Id love feedback: Does the [pause] markup feel intuitive? Would you use SRT-to-speech for repurposing videos/podcasts? Any other small features that could make this TTS tool even more useful?", "target": "positive"}
{"text": "I am working on veltor.ai , its basically an AI-cofounding team for you, imagine a whole C-suite team working 24/7 with you on your product. Your startup will be equipped with a marketing team, strategy team, development team, finance team, business team and more all working together to make your dream a reality. If you are building an online startup, this is your unfair advantage to scaling. If this sounds exciting make sure to sign up for the beta waitlist, also open to more feedbacks on what you would expect from a product like this, and any advice from experience in building multi agent orchestration!", "target": "positive"}
{"text": "I am an experienced programmer with XP in both startups and big tech. I have launched an AI SaaS recently. we made it bug free and robust. I launched last week and for now got only 2 users which are my friends. I am realizing how hard is it to compete against even vibecoded saas. Any ideas on how to crack growth?", "target": "positive"}
{"text": "Hey there, young SaaS padawan. You want more clients? Of course you do. Everyone here does. Heres the blueprint I use to book a ton of calls from LinkedIn. First, forget about tools, imports, or offers for a second. What you need is a fully optimized profile. No excuses. If youre a woman, youll naturally get a slightly higher reply rate. Thats just how it is. An optimized profile means consistent activity on LinkedIn, a clear banner that shows what you do, a decent profile picture, a description that makes sense, an up-to-date experience and education section, and a clickable link in your bio that leads straight to a booking page or website. If youre still rocking an old profile with no picture, stop here. You wont get results. Once your profile is ready, move to step two: your offer. If your product is priced too low, think under $150 a month, youre wasting time. Outreach at that level is painful and rarely worth it. Aim for at least $200 or more per month unless youre targeting influencers for broader reach. Step three is defining your ICP. This part is critical. You can only send about 200 invites per week. If your targeting is off, youll waste your invites and never know if your offer works. Now, lets talk lead sourcing. You have two options. Option one, do what everyone does and pull the same leads from static databases like Apollo, enrich them with Dropcontact, and hit the same pool of prospects everyone else is spamming. Option two, play smarter and use dynamic data. These are what I call High Intent Leads, people showing real activity signals. Scrape event attendees, post likers, commenters, or people engaging with specific keywords. Then filter those signals down to your ICP. Once you have your dynamic list, youll need an automation tool to send messages. There are dozens out there, and some even combine sourcing and outreach. Do your research and pick what fits your workflow. Now, messaging. If you pitch in your first message, youre dead. If you include a note in your connection request, youre dead. Heres what actually works. Send a simple invite. If they dont accept the next day, engage with their content. Like their latest posts, leave a thoughtful comment, follow them. Get on their radar. Once they accept or after a few days of light engagement, send a message. Make it contextual. If you saw they joined an event, say something like, I noticed youre interested in this topic, would you be open to chatting about it? If you dont have context, keep it simple and conversational. The goal is just to get a reply. This is the foot-in-the-door approach. Once they respond and show interest, dont send a calendar link right away. Ask what time works best for them, then handle the booking yourself. Later, configure your calendar for automated SMS and email reminders to reduce no-shows. And thats it. The SaaS game is getting tougher, so youll need to be sharper than ever. Good luck out there.", "target": "positive"}
{"text": "Testing out trained AI agents on early stage startup and business functions like sales/marketing by understanding your product, researching, and refining results. Drop a link to your website if you're interested!", "target": "negative"}
{"text": "Hey! I'm testing a tool out and am happy to reply to everyone. Just drop a link and I'll give you feedback and info on where to find your first customer.", "target": "negative"}
{"text": "So a little bit of background, I'm a senior enterprise SDR for a large fintech company. Yes, I'm the guy who's spamming your inboxes looking to get \"15 minutes\". Yes, I know you all think we're annoying, but the problem? In the hundreds of emails you get a week, at least a couple of them have potential to change your quarter. I'm bootstrapping this startup called shutup.bot (cheesy? idk) where we use AI to filter inboxes, rank each cold email and assign it a score. You get a daily recap email with all the most relevant emails based on info you put in at signup so hypothetically you save a lot of time a week. (This is not meant to be a plug, just giving some background.) To the decision makers that belong to Saas companies here, I KNOW this is a problem, but is this something you would genuinely pay like 10$ a month for if it saved you a couple hours? What other features would make this a home run for you? I genuinely want to make something that provides value to all these people I annoy on a daily basis and I think I found a great opportunity to deliver it.", "target": "positive"}
{"text": "I have been reading a lot about SaaS founders and their growth stories recently. But I noticed that it is hard to find all this information in one place. I want to know two things: Where do you usually find stories of solo founders making $10K, $50K, or even $100K per month How do you learn about their business models, pricing, and marketing strategies I have found a few indie hackers who share their numbers publicly, which has been really helpful. But apart from random blog posts and X threads, I have not seen a proper place where this information is well-organized. How do you find such insights? Do you follow founders directly, use some tools, or collect data from different sources manually?", "target": "positive"}
{"text": "To all entrepreneurs and dreamers on Reddit: Whats the idea or project you wish you could make happen this year? Share your dream venture or the biggest challenge youre facinglets achieve success together in 2025! Thinking about launching a startup? Building a tech product? Creating a new SaaS platform? Post your vision or even just a seed of an idea. Were here to brainstorm, motivate, and maybe help turn some dreams into reality!  Lets see how far your ambition can take you, no matter the obstacles.", "target": "negative"}
{"text": "Kinda jelly at everyone here posting MRRs of 5-6 figures so thought I'd share my small success :D. Launched in June, after 2 months, my marketing tool https://www.tydal.co/ is making $608 MRR. Couldn't be happier with it. I started it as a side project because I also had a 9-5 job I had to manage. As time went on, I became super invested in Tydal and was able to find a really nice balance with this project. It took some serious work in the beginning to ship out the first version and a few more major improvements. Now I spend a few hours a day working on feature requests from my users, and making sure not to let up on marketing. Not rushing to scale it like crazy since but I am planning on going full-time on it soon. I just wanted to enjoy working on something outside of my main job, but I've started to love the grind. Also, seeing paying customers is such an awesome feeling, and it makes everything worth it. Has anyone else had this path of building a SaaS? Starting as a side project, then going all in. Here is a screenshot from Stripe as MRR proof: https://imgur.com/a/EEybBVO", "target": "positive"}
{"text": "The first 48 hours my launch post for Folderly Chat hit 8.2K views Then I shared an update here and the discussion blew up Right now the post stands at 39K views 95 upvotes 84 comments and a 91.2 percent upvote ratio That sounds like a dream but the reality was different Most of the feedback was brutally honest Landing page lacked clarity People questioned trust Some even asked if it was just another AI tool At first it hurt but this is why I am building in public So I acted on it I redesigned the landing page to make the copy clear and the flow smooth I fixed the messaging to explain why and not just what For context Folderly Chat is not another chat app It is a productivity tool for ChatGPT users that helps you organize and structure your conversations in an optimized way so you never lose context or ideas again Here is the biggest lesson Traffic does not equal traction Thirty nine thousand people can visit but if they do not trust you in five seconds they leave Now my focus is clarity and credibility over just views Here is something that might help you too Reddit is powerful for reach but posting links rarely works What worked for me was sharing real numbers honest lessons and asking genuine questions This builds trust and drives engagement naturally Curious for those who launched what was the one trust factor that made people join instead of just browsing If you want to see what I am building here is Folderly Chat", "target": "positive"}
{"text": "Im building a product in the grief & memory space (basically, helping families preserve stories and voices of loved ones). The biggest challenge so far is onboarding. To make the product useful, people need to revisit hard moments and memories while theyre still grieving. Its emotionally heavy, and many drop off before reaching any value. Feels like a catch-22: without their input, the app isnt meaningful. But asking too much too early risks overwhelming them. For those whove built SaaS in sensitive spaces (health, mental health, grief)  how do you design onboarding so it supports users emotionally, instead of pushing them away?", "target": "positive"}
{"text": "Ive just launched Humen, The AI Sales Rep (Humen is an AI SDR that researches leads' info & generates highly bespoke emails for B2B cold outreach), and I thought Id do my first AMA here.  In that time, weve: Launched our first AI employee, Reached $10K ARR Built a waitlist of 150 users, Achieved all of this while being fully bootstrapped with $0 spent on marketing or product development  just a laptop and internet. Ask me anything!", "target": "negative"}
{"text": "After building multiple SaaS products as a freelancer on Upwork , here are the simple features that consistently get the best user feedback. Nothing fancy, just stuff that works. Kill the blank state 1-click starter templates: Copy this example that pre-fills a workspace. Empty dashboards scare people away. ~30 mins to build, huge lift in engagement. Smart defaults : Pre-fill sensible values instead of empty inputs. Less decision fatigue = faster first success. Reduce anxiety, boost trust Progress feedback : Checkmarks/spinners/toasts so users see saves and syncs. This alone cuts Did it save? tickets. Status indicators : Online, Syncing, Last saved 2 min ago. Remove guesswork. Auto-save everything : Draft every few seconds. Never lose work = instant trust. Undo/Restore : Let people reverse mistakes. A visible Undo or Restore deleted saves support and blood pressure. Remove friction, create momentum Google/Facebook sign-in : Skip long forms. Email + OAuth consistently bumps signups (less friction, more users). Quick-win onboarding : Set up your first project in 60 seconds with a template path. Get them to a result before they bounce. Keyboard shortcuts : Ctrl/Cmd+S, Ctrl/Cmd+Z, quick nav. Power users love when they feel fast. Personalized welcome : Hey [Name], welcome back to [Product]. Tiny touch, outsized feels premium effect. All of these have helped me drive better conversion rate & retention. Ive implemented all of them into a SaaS Im building for Instagram creators to gain followers and engagement. Happy to share access with few peeps. Keep Building", "target": "positive"}
{"text": "Hey! Im testing out a tool I built that evaluates startup ideas. If you drop your SaaS idea below, Ill: Give you an evaluation of how strong it looks (feasibility, demand, differentiation, etc.) Suggest a potential pricing range you could charge your first customers Ill reply to as many as I can", "target": "positive"}
{"text": "Hi SaaS community!  At BlipCut , we help SaaS teams translate and localize training videos, product demos, and marketing content into multiple languages more efficiently. Manual translation or outsourcing can be time-consuming and expensive, so we designed our platform to support typical SaaS workflows: Bulk Translation: Process multiple videos at once Multi-Speaker Detection: Smooth handling of meetings and discussions Long Video Support: Translate videos up to 2 hours without splitting Subtitles & Dubbing: Automatic generation for different languages Wed love to hear from the community  how do you usually handle multi-language video content for your SaaS products? Any favorite tools or workflows?  More info if interested: BlipCut", "target": "positive"}
{"text": "If anybody is looking for an influencer, Instagram account 270,000 followers and willing to promote small businesses are for personal game. Please let me know if youre interested. Ill send his IG link we can go from there.", "target": "negative"}
{"text": "I got 270,000 followers and averaging about 2 to 4000 gain per day if youre looking to purple with your business or for self gain, hit me up", "target": "negative"}
{"text": "Hey SaaS founders, Im David, a student and Growth Partner focused on helping founders scale their brand visibility and revenue . I know building SaaS is already a grind  from product to churn to acquisition  so I focus on the part that matters most: growth . Heres what I can bring to your brand:  Funnel optimization & sales systems that turn signups into paying users.  Paid ads + organic growth to increase visibility without burning budget.  Performance-based model (I only win when you win  % of sales or revenue growth).  Community-driven growth strategies (like Reddit, where many SaaS gain early traction). Im not an agency. I prefer partnering closely with founders to really grow their business long-term. If youre building SaaS and want to scale faster with someone whos hungry and fully committed, DM me. Lets make your product the next big thing.   David", "target": "positive"}
{"text": "Hey folks, Bogles passive investing (index funds, diversify, hold long-term) basically almost guarantees success in finance. Im a full-stack indie dev and Im wondering if a similar approach could work for SaaS: Multiple small products instead of one big project Keep things simple and reusable Play the long game Anyone tried something like this? Did it actually work? Any tips or gotchas?", "target": "positive"}
{"text": "Hi there, so I've been building SaaS MVPs for founders and solo entrepreneurs over the past 6 months. 3 of them are now making $500+ MRR. What I deliver:  Full-stack MVP in 2-3 weeks and maintenance after  AI tools, B2B dashboards, marketplaces, agentic workflows, automations and AI-first SaaS  Launch-ready with monetization features Recent win: a clients AI customer knowledge base tool went from idea to $1200 MRR in 90 days. Taking 3 new projects this month at a reduced rate. DM me for portfolio and details, we can book a call and discuss.", "target": "negative"}
{"text": "I spent 6 months surveying 500+ founders across startup communities (reddit, twitter, discord/slack communities, fb groups), and the results were brutal. Here's what I discovered: 87% admitted they built their product based on personal assumptions (what they thought was cool/useful), not actual market research. Even worse, 73% said they wished they had access to real user complaints to see what users would pay for before starting development. The problem isn't lack of ideas. The problem is founders are solving imaginary problems. Think about it lol. every successful SaaS solves a pain point people already experience. Slack didn't invent team communication problems. Notion didn't create the need for better documentation. They found existing frustrations and built solutions early on. There are 100s of competitors but they found out what users hate about existing solutions, and built on top of them to build a superior application. But here's where most founders mess up: they ask \"would you pay for this?\" instead of finding people who are already paying for broken alternatives. After talking to hundreds of entrepreneurs, I kept hearing the same story: \"I spent X number of months building something, launched it, and got 0 shits given. Turns out nobody actually had the problem I was trying to solve.\" This is why I started digging deeper into where real problems actually live. Not surveys or focus groups, but actual user complaints (negative reviews) on different platforms. I analyzed over 150k negative reviews from G2, scraped 50k frustrated App Store reviews, and crawled thousands of Reddit threads where people vent about broken tools. The patterns were eye-opening. People complain about the same software issues repeatedly across industries. They're actively discussing workarounds, paying for multiple tools to solve single problems, and begging for better alternatives in public forums. its actually nuts on how many ideas people miss. These aren't hypothetical problems, they're pretty much frustrations with clear market signals. People want these solutions and are WILLING to pay for it. The difference between successful and failed SaaS isn't the quality of execution. It's whether you're solving a problem that actually exists. if you want to check the data i've scraped and the analysis: Link . would love to hear your thoughts. Before you write your first line of code, ask yourself: are you building something people complain about not having, or something you think they should want? The answer determines everything.", "target": "positive"}
{"text": "As a solopreneur, every decision countsand guessing what users want is risky. The fastest way to build the right product is structured, actionable feedback . Thats why we built Refinely : Capture in-app feedback easily, without interrupting users AI organizes, filters, and prioritizes what actually matters Routes it to Jira, Slack, Discord, email and integrates with Claude Code, GitHub Copilot, or any coding agent so you can turn feedback into actionable work (or even code) quickly Instead of drowning in suggestions, you get the right insights to grow your product.  Try it here (limited free trial): link in comments  Product Hunt launch: https://www.producthunt.com/products/refinelyai?launch=refinelyai", "target": "negative"}
{"text": "I analyze pitches against patterns from millions of documented failures. Not generic advice - specific data on why your exact phrases kill deals. What you get: Death word analysis (phrases that predict rejection) Score across 5 dimensions (Clarity, Hook, Value, Believability, Memorability) Exactly what successful pitches in your space say instead No sugar coating - pure pattern matching How this works: Comment your pitch (2-3 sentences, what you tell potential clients/investors) I'll analyze it against failure patterns You get brutal truth in reply (publicly - keeping it transparent) Why I'm doing this: Beta testing PitchPyre before launch. System trained on 15+ years of pitch outcomes. Not AI hallucinations - actual correlation data. Recent example: Someone pitched \"revolutionary platform that transforms businesses\" - those three words appear in 73% of failed pitches but only 8% of successful ones. Replaced with \"I fix checkout abandonment in 48 hours\" - specific, measurable, valuable. First 10 real pitches get analyzed. No \"testing\" or \"just curious\" - post your actual pitch or move on. Your ego will hurt. Your conversion rate will improve. Drop your pitch below. Format: Who you help, what problem you solve, how you're different. Note: Analysis happens in comments for everyone to learn. No DMs. If you can't handle public feedback, don't post. (Mods if not allowed tell me but this will help the community, because I sucked at this and still do but I have improved) **edit** sorry guys I got blown up by DMs although I mentioned in here, you guys listen other subs don't aye! but IF I missed anyone please reply back to me. **Edit 2: Beta Link - https://forms.gle/US7xejMyart7R4zB9 Yeah its google... its just a form.. **Edit 3: This is not a unicorn or a golden egg, this is your business sparing partner its to train you. Defend your idea/mvp/moat or give up. Persist rise as a phoenix from the ashes. I am going to have a site up here soon, work in progress but the data is the same I am sharing manually. Cheers", "target": "positive"}
{"text": "Hi everyone! I'm a solo developer and I released this app called Lately for people who are always running late. I had some traction due to some articles a while back but now the numbers are dying off. The idea is simple: you tell it when (and if needed, where) you need to be, and it calculates travel time and helps you leave on time. The key features are: Progression bar countdown on the lock screen Live Location updates your travel time as you move Earn badges + points when you're on time Website: https://www.getlately.app/ AppStore: https://apps.apple.com/ca/app/adhd-planner-by-lately/id6740748815 I'd love to get your take on the app.", "target": "positive"}
{"text": "After 3-4 months I am done building my app (I only used Cursor to build it), and am ready to post it. It's an AI party game that lets people answer an absurd scenario with logical questions that an AI thinks of, and then the AI judges their logic and roasts them on it too. Given the vibes and the themes, how do you suggest I go about bringing users to the app? I don't think I should start with paid ads....", "target": "positive"}
{"text": "Are there any good solar system apps that show the planets and major anomalies like comets or asteroid debris clouds (such as the Perseids) in real time positions? Note, I do realize the actual scale of the solar system won't fit on a phone screen, the planets wouldn't even be a single pixel. Or on a flat screen.", "target": "positive"}
{"text": "I made an app like DoorDash but always cheaper! Only in Nashville rn trying to expand. Called Grabbl", "target": "negative"}
{"text": "basically this but customizable. the screenshot is from a random little app I found on the apple app store called challenge. its exactly what im looking for except the create challenge feature hasnt been added yet.", "target": "positive"}
{"text": "Hey everyone! Friends of mine made an iOS app called Suppi: Supplement Coach and thought it might be useful for anyone interested in health and supplements. Its an AI-powered tool that helps you figure out how to take supplements the right way, focusing on timing, absorption, and avoiding bad interactions. This is the app: https://apps.apple.com/app/id6745611073 What it does is:  Scan supplements by barcode to log them instantly  Track timing, dosage, and combinations for better absorption  Get AI-powered suggestions to avoid bad interactions  See trends in your supplement routine and consistency  Get smart reminders so you dont miss a dose I thought it was pretty cool, especially since most apps in this space are just simple trackers. Curious to hear if anyone else here tries it and what you think!", "target": "positive"}
{"text": "Hey everyone! I just launched CalmTrack , a cozy, modern habit tracker for iOS. I built it because most habit apps I tried felt either overwhelming or too clinical  I wanted something calm, minimalist, and stress-free that actually makes me look forward to tracking. With CalmTrack, you can:  Enjoy a clean, calming UI that makes daily tracking effortless  Switch between grid and calendar views to see your streaks at a glance  Personalize habits with unique icons and colors  Stay on track with smart reminders that gently nudge you  Archive past habits and stats to reflect on your journey  Edit habits anytime without losing progress What Im looking for: Feedback on usability, design, or anything that feels confusing Suggestions for features youd love to see next ( Already working on widgets and switching reminders timer from AM/PM to 24H system so soon that improvements will be available.) Any bugs or issues you run into while using it  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Would love to hear how CalmTrack fits into your routine  Ill be checking every comment!", "target": "positive"}
{"text": "All I want right now is an app that plays audio files and will show time remainaing or elapsed in a widget. Because I will be using other widgets att the same time, such as a timer for the whole show etc. I have now installed and uninstalled huge number of iPad music player apps and I can't find a single one showing song duration or position in a widget. I suspect there is something convoluted about retrieving song position in the app building framework that makes every programmer avoid it, because this should be a fairly straight forward feature.", "target": "positive"}
{"text": "Hey everyone, Ive been working on an idea and would love to hear what you think. Imagine youre traveling  say from New Delhi to New York  and you want to know something specific, like Whats the best dessert in NYC right now? Instead of scrolling through outdated blogs or generic search results, you just open an app, type your query, and instantly get suggestions/replies from nearby people and fellow travelers in real-time. Kind of like a location-based community Q&A app where travelers can ask and locals (or other travelers) can answer on the spot. Think of it as Reddit meets TripAdvisor meets local chat. Im tentatively calling it Travelgo. My questions to you all:  Do you think this kind of app would actually be useful for travelers?  Would you personally use it when visiting a new city?  What features would make it stand out from existing apps like Google Maps, TripAdvisor, or Reddit itself? Any feedback or suggestions would mean a lot  Thanks in advance!", "target": "positive"}
{"text": "Hey everyone, I built a personal inventory app to catalog everything I own with usefulness ratings and travel flags and Im sharing it with you guys. You can check it out here . Here's what it tracks: Item details - name, category, location, value, and personal usefulness rating (1-10) Travel optimization - flag items as travel-worthy and see your travel vs regular item ratio Usage tracking - mark items as used and track frequency to identify what you actually use Visual analytics - charts showing category distribution, usefulness ratings, and usage patterns Value tracking - see total inventory value and identify your most/least valuable items I'm sharing it for free - no signups or premium tiers. Just a practical tool for people who want to be more intentional about their possessions. PS: If you want to customize it or build similar tracking tools, check out r/davia_ai", "target": "negative"}
{"text": "Looking for an app for iPhone that is basically a shared brain dump. I think of a lot of random things throughout the day that I want to tell my significant other. They have a demanding job and cant answer everything I want to ask during working hours, understandable!! Im looking for something that I can basically write down random thoughts, questions, and fun things my kids do. Then at the end of the day, they can look and respond to all the things. Emphasis on all. Ive tried and did not like: Cozi, Todoist, native reminders app, scheduling messages for pm, writing an actual list, family wall,", "target": "positive"}
{"text": "The ability to say \"no, you don't want to watch that, you want to watch THIS\" is an amazing tool for focusing on goals. But I need to be the one who chooses what it's feeding me. Is there any way to do this?", "target": "positive"}
{"text": "Weve just rolled out some powerful updates to make your adventures even better:  Route history tracking  Road trips, hikes, or city exploring, every step is saved.  Photo tagging on maps  Capture memories and pin them to the exact spot.  Live location sharing  Stay connected with friends and family in real time.  Export your journey  Share as a GPX file or a simple map.  Trip Studio on the web  Sync between app and trackmyjourney.net to view and explore your trips in detail.  Were continuously improving based on your feedbackand the reviews speak for themselves!  Special Offer: Life-Time Premium Give away until August 28 . Download the app and log in. Open Settings  Contact Us and send us a message. Well grab your user ID and enable premium access for you. Start your journey today!   Download : Track My Journey on iOS", "target": "positive"}
{"text": "looking for collaborators to expand features Post Body: Developed by pharmacists in the UK to close the global medication safety gap Already being used by 1,300+ healthcare professionals. Covers AZ medicines with side effects, interactions, counselling, dose calcs, etc. Available on web , iOS , and Android . Were especially interested in connecting with AI experts and healthcare tech enthusiasts whod like to contribute to the next wave of features. Would love feedback from this community  what features would actually make this most useful in your practice or studies https://preview.redd.it/zkln3jljfjlf1.png?width=1080&format=png&auto=webp&s=622e85abf26ca1041a681c94aedddec09f6bacad", "target": "positive"}
{"text": "Hello everyone ! I am looking to automate a repetitive task. On Android, it's easy with an autoclicker, but on iOS it's complicated because apps cannot interact with each other. To get around this, I display my iPhone on my PC using mirroring software, then I want to use an autoclicker on the PC. Problem: ApowerMirror works well but is limited to 10 minutes (then you have to pay). GlideX is unlimited, but when remote control is enabled, the cursor becomes special and autoclickers (even AutoHotkey) no longer work. I'm looking for a free solution or a tip to: Control the iPhone from a PC without limits and have the autoclickers work If anyone has an idea or knows of an alternative, I'm all ears !", "target": "positive"}
{"text": "Hey all! Ive made an app special for pawrents. With this app you can track everything from your dog, like allergies, commands, habits, measurements, weight and more. Get notified for the next coat brushing, teeth brushing, ear cleaning, deworming, flea & tick treatments, potty and shower sessions. With the clicker and dog toys you can train your dog or grab their attention (also available on Apple Watch with the companion app). You have a map that marks nearby dog friendly daycares, groomers, vets, parks and restaurants. The app is free to use , where you can track one dog, and have access to one dog toy. There is also an optional premium subscription which give access to create unlimited dog profiles, 8 dog toys and create custom reminders. - Monthly subscription: 2.99$ (with 3 day trial) - Yearly subscription: 19.99$ - Lifetime (no subscription): currently on temporary sale for 4.99$ (regular price 34.99$) Download: App Store", "target": "positive"}
{"text": "Pixel 7.what are they both from? Apps?", "target": "negative"}
{"text": "Just found out about a new crypto casino called MineBit. It launched this June and already has 5,000+ games (slots, blackjack, roulette, crash, live tables). What caught my eye: Instant crypto payouts (BTC, ETH, USDT, etc.) $10 min deposit $20 min withdrawal Welcome bonus up to 680% + 400 free spins No app needed, works straight from browser Curious if anyone here has tried it yet? How fast are their withdrawals in practice?", "target": "negative"}
{"text": "My wife and I own a food manufacturing business, and although 99% of our business is distribution, we have a small retail shop in front of the production area to sell our products direct to consumer. Our plan was to scale back the distro and focus on retail, so we dumped a bunch of money into the shop, and then covid hit. So, our distro doubled during that time. It seems for the last few years more and more people have become the main character in their worlds, and it has become our duty to make every day a special occasion. The big problem we face is that no matter what we do, it doesnt live up to their expectations. Ill give an example. We have a regular customer who comes in and if were out of Product A., then she acts sad and says that was whole reason she came in. If were out of Product B.  same thing. It has gotten to the point where we tell her were out of something, so when she acts upset we say oh, actually! We DO have some!!. People come in, see our wall of products and ask what do you have special today?. Like, wtf do you mean? Youve never been here. We have 20 products out there. Our distro companies are the same. But thats a whole different story. It just seems like no matter what we do, no one is happy. We had a customer come in with his kid and ask us if we have chicken wings. Why would we sell chicken wings? Where would they have even gotten that idea? Then theyre mad we dont have chicken wings. Like, this really happened. Im so burnt out on people. Its starting to show. We debate just closing the doors to the public but we spent so much money building out the retail area. I dont know. Im mostly venting I guess. Im sure Ill get slaughtered in the comments, because its Reddit. But.had to vent. Im going to explode. EDIT wow. So much valuable info in all of these comments! Appreciate the insight and stories!!!", "target": "positive"}
{"text": "Created an account to ask this, as Im not sure how to proceed with the situation. We run a small seasonal business, and while Im not a fan of hiring friends, we hired a friend. He was a great fit for the job, seemingly had a great attitude and we made it clear that we prioritized the friendship, and if he ever wanted to step out because it was too much, just tell us and there would be no hard feelings. Lets call our friend James. He worked ran our kitchen. Hes in his 20s. James rarely showed up on time, maybe I can count on one hand him clocking in when his shift started. Typically 10 minutes late. I do all opening and closing duties for him, so all he has to do is show up to a fully stocked and ready to go kitchen, work his shift and go home. He gets an hour break daily, sometimes longer if its a hot day (2-3 hours). He works 5 days on 2 days off. When its busy I step in to help and only leave again when its slowed down and I confirm hes all good. The last few weeks James has been incredibly miserable. Constantly saying fuck this fuck me this is stupid in front of the other staff and in earshot of the customers. Other comments were made by him that I had to speak with him about last week, I tried to have a productive conversation about how these comments were rude and offensive and asked him if hed like to be done for the season, no hard feelings, if it was getting to be too much for him. I got a plethora of excuses for why he said what he said. And he didnt mean it. And that he will push through until the season is done (a couple more weeks) and he left. I didnt feel the conversation went poorly, but I also didnt feel it went well. I told him Im not a push through for work type of boss, if you need the time off you need the time off. But he said nothing. He came in for his next shift (late) and worked it until about 5 hours in, which is when he started making the comments above, to which I sent him home. I said okay I think you can go home for the day, you cant be speaking like that at work, we have talked about this He said okay and left. Came in the next day in a decent mood. All was fine. The day after is when shit hit the fan. Myself and the other owner had an engagement we had to be at, we would be gone for 3-4 hours at most, and I overstaffed with completely confident team members so there would be no reason to worry. He had fully trained help in the kitchen, as well as two other staff in the building. I let him know I just needed him until we got back, and then hed be free to have the rest of the day and he agreed that sounded good. When we came back to the premises, I was notified that he had walked out an hour previous, telling no one he was leaving. He just walked out. I messaged him and received no answer. My partner did the same, and didnt get an answer. I worked the remainder of the day. Next day he didnt show up for his shift, still no response when I inquired. He responded two hours later saying he was sore and wouldnt be coming in. I let him know I was disappointed he felt he couldnt communicate any of that with me and that I feel he showed how little respect he had for me and my partner. But to take care of himself and let me know how he gets on. He claims its not disrespectful to walk out and then not show up for a shift with zero communication. And that hes sorry he handled it the way he did, but he didnt disrespect us. Now Im feeling the friendship is strained, and quite honestly Im genuinely angry. Im not sure how to proceed. Is this him quitting? Does he expect to go on like nothing happened? He has yet to respond to any other messages from us. BUT I do know hes doing well because he has responded to mutual friends, as I was concerned about his mental health. Looking for any advice? Ive already taken responsibility for all of his upcoming shifts, because he hasnt responded to anything else. So technically Ive got it covered, even though its going to create 14-16 hour work days for me until end of season and put a strain on my other staff. Do we just pretend nothing happened and give him an ROE saying end of season? Or do I put down he quit and screw him out of any employment insurance opportunities. I dont feel right doing that, so I likely wont, but Im at a loss at what to do.", "target": "positive"}
{"text": "[Question] It's amazing how often businesses lose trust for the same exact reasons: over-promising, under-delivering, or just completely ignoring feedback. It makes you wonder if they're even paying attention. Whats the #1 thing a brand has done that made you instantly lose all trust in them?", "target": "negative"}
{"text": "Honestly once you start growing sourcing turns into a very different game like when i first started picking up a few laptops or trading cards here and there was doable but once you try to keep up with lots of products across categories it feels like you spend more time filtering than actually buying stuff. Margins get tricky too like the market changes and categories you used to make a killing at start filling up with competition quick. What works for 5 deals a week doesnt hold up when you suddenly got 50 of them. Like how are you keeping your sourcing efficient as you scale??", "target": "positive"}
{"text": "I feel like a lot of people get stuck either not having enough people coming in the door, or having leads sign up but never actually show up and turn into paying clients. Which ones tougher for you right now?", "target": "positive"}
{"text": "I'm a big believer in automation but, as many of us do, I kept trying to overengineer automations and would waste my time doing things that either weren't possible or weren't meaningful. I had a bit of an epiphany today that my favorite automation is probably my simplest one. Every time someone fills out my contact form, Zapier adds their info to a spreadsheet that I use as my to do list. That's it. My email inbox is a mess and before when I'd get an email from my contact form it would get lost in my inbox fairly often. I'd say a good 30% of the time I was forgetting to respond until I saw it like a week later and by then it was too late. Now part of my routine is going in the spreadsheet every morning and replying specifically to those inquiries. Anyone else have some stupidly simple automations that they love?", "target": "positive"}
{"text": "How do you handle Employee scheduling/work order scheduling. If we have our maintenance techs work from 8am-4pm, currently they get to the shop at 8am and then head to their first work orders from there. We service a 1 hour radius. How do you handle Employee Scheduling and Work Order Scheduling? Should they be at the shop at 8am or their first work order at 8am and when do they clock in?", "target": "positive"}
{"text": "started a medical clinic 4 years ago. We are currently making maybe 5k profit per month.operating revenue of about 40k a month but most of it goes toward survival. I'm so tired of not bringing home much money and constantly problem solving /putting out fires all day every day. Even after performing the job, we have to wrestle the money from insurance which makes this whole process soul churning. To give a deeper idea, we are seeing around 30 encounters a day and billing 1.5 mill yearly. National average collection is 30% of what is billed. Growing at about 6% monthly in number of patients but still I can't understand the math because if I did this for salary, I'd be taking home 400k $ at a minimum. We made 120k last year and I sank all of it for down-payment and financed the rest of a 1.2 million$ location at 5.75% before interest rates went up. I don't think we would've survived otherwise as rent for clinic space nowadays is like 12k$ /month. I dunno if the boost in motivation paying myself is worth the slowing of our growth but I can't shake the thought that something doesn't add up and I'm paddling the wrong direction while slowly running out of motivation. Anyone who pulled this off who remembers this stage-what would you do?", "target": "positive"}
{"text": "Ive been researching small businesses that dont need a big upfront investment, and digital products (like ebooks, printables, templates, etc.) keep coming up as an option. I get the part about creating them, but my biggest question is:  How do you actually get those first few customers when nobody knows who you are yet? If anyone here has experience, Id really appreciate hearing what worked for you.", "target": "positive"}
{"text": "Hello everyone, Im writing this post on behalf of my mom and wanted to thank you in advance for taking the time to read and share any advice. We truly appreciate it. My mom is a small business owner in California. She works 7 days a week, 1012 hours a day, and recently received notice of an ADA lawsuit. As far as we know, it hasnt been officially filed yet because she hasnt been served, but she did receive a letter/email from a law group stating that a lawsuit has been initiated. The claims in the letter include: Parking slopes being too steep Inadequately marked accessible parking spaces Lack of accessible dining surfaces Dining surfaces without required clear ground space Transaction counter too high Floor mat not secured properly The letter also stated that these issues violated ADA and UCRA, and that they denied the plaintiff equal access. Most of these are relatively simple fixes that my mom is willing to address, except for the parking lot slope, which is the landlords responsibility. From what I can tell, this letter serves as both a lawsuit complaint and a solicitation from a defense firm. When I looked up the plaintiffs name, I found multiple articles showing that this person has filed over 500 similar lawsuits. My questions are: If my mom corrects the issues, does that remove the risk of the lawsuit moving forward? Does she need to hire an attorney to fight this, or is there a simpler/less expensive way to resolve it? We called the law group that sent the letter, but they asked for a lot of money up front, which my mom cannot afford. What are the realistic next steps? Any advice or shared experiences would mean so much to us. My mom is doing her best to run her business, and were just trying to understand how to handle this situation without going into debt. Thank you again.", "target": "positive"}
{"text": "I bought a domain for my shop, and now Im stuck on the email part. Everyone on YouTube says I need to set up MX records and all these DNS settings way over my head. Is there a simpler way to just get a business email that I can just start using?", "target": "positive"}
{"text": "In light of all the gloomy posts over the last few month I wanted to see if we are somehow on an island. I'm in home services business and we have having the best year ever. Right now tracking about 15% ahead of last year. While residential customers are slightly up commercial have in on-fire. Also hiring has been a little easier (about 1/3rd of the applicants actually show up for an interview and on-time, compared to 1/5th last few years).", "target": "negative"}
{"text": "My father ran a refrigeration and hvac business, long story short now I do the same. I stayed to help my dad and ended up doing it for longer than I expected. You have your ups and downs with hvac. My dad was always stressed but loved what he did. I have gone through jobs that give me so much trouble and jobs that are great and profitable, but this one I currently have is beyond that. I am stressed out things are not going well. Its a long time coming for me, I have been wanting to just quit for a while but I haven't because I am the only one working. But last night I cried in my car, I prayed and I let it all out. The only thing that made me smile was imagining myself deleting my number and never looking back. I dont have a back up at all. I feel stuck with an immense amount of pressure. My heart aches and the bills are piling up, and a whole family to care for... in the meantime I am suffocating. Has anyone gone through something similar, if so, what did you do? I am truly gasping for air.", "target": "positive"}
{"text": "I would like to start a startup on SME consulting in the area of supply chain management. I will very much appreciate the help in getting the website created for free!", "target": "positive"}
{"text": "Hello everyone! I wanted opinions from people who have experience or know someone who has experience running a low-cost carrier store like Metro or Boost. I recently came upon an opportunity in the South to invest in some stores for Total Wireless. The master franchiser gave a really good sales pitch and I wanted to get other opinions on this. Thank you for your time!", "target": "negative"}
{"text": "I went to eat at this relatively new (2 years?) restaurant and started a discussion with the owner because I was curious about starting a business. Turns out the restaurant is a small franchise and the owner shared his struggles with opening a franchise. I gave him my contact information and he asked if I wanted to be an investor. I am considering but want to do more due diligence. What are important questions to ask him? What are important information to know about the franchise?", "target": "negative"}
{"text": "Is it a normal thing to be provided with a batch of sample inventory to test on the shelf? I ask because as a side project, were working on a non-perishable household food item and exploring initial distribution options on top of our own e-commerce. I would love to provide a batch to stores at no cost and work out an initial revenue split that makes it worthwhile. Is this a normal thing? Is there a specific way to get a conversation going when it comes to these things? I should mention, if youre based in the US and this is relevant, Id love to discuss if this something you may be open to!", "target": "positive"}
{"text": "What are some of the biggest issues you see in the sports networking and media industry. In my opinion it is the push of non sports stuff being on company's like ESPN try to push on there viewers. Does anyone feel the same? I am a entrepreneur looking into some possible solutions to this issue and just wanted to get some opinions on this or any ideas you have.", "target": "positive"}
{"text": "Say i have a coffee shop. I wanna make a deal to incentivize people to buy something else with the coffee cup, like a water bottle, and a donut! For example, each item costs 1 usd in this shop If a customer buys these today. They would pay 3 usd Now i want to make an attractive deal, reduce my profit per item while lifting up the number of sold water bottles and donuts. I have the basic thought. I am wondering how people executed this decently I must say im new to all of this", "target": "positive"}
{"text": "I heard a lot of professionals who have the option to relocate to major cities and get paid large salaries, but choose to stay or move back to their home town/country to stay close to family or just to live comfortably. Is this true? What do you guys think of hiring remotely for your small business? Does anyone have tips for this?", "target": "negative"}
{"text": "So this week I launched a digital product low ticket offer for a workbook I created for aspiring entrepreneurs & start ups who need clarity on their offer Im an occupational therapist turned online clarity coach and guide And yes I am a Solopreneur. I am in networking groups. Im active on social media. I just announced my product today among my various groups But feeling discouraged no bites, no comments, no likes And look, I know these things take time. But I guess Im wondering if there are other ways to get in front of buyers that I could try or any other tips for digital products and marketing that I may be missing. Would love to hear some feedback and recommendations.", "target": "positive"}
{"text": "Hi everyone! I was wondering if you had advice and tips of how to find manufacturers for creating custom items, currently I've been doing a bit of searching and haven't found anything that matches what I'm looking for, most of search results are just \"custom logo printing\" and that's not what I'm looking for, I want to make a new product from scratch.", "target": "positive"}
{"text": "Hey everyone, Im looking for the best-priced source to buy digital gift cards (Steam, PlayStation, Xbox, Google Play, etc.) for reselling individually in my online store. A few requirements:  I dont mind if the supplier charges a subscription or registration fee, as long as the final price makes sense.  I want to avoid situations where a $5 Steam card costs me $6 for example. (that kills the margin).  Payment methods like Visa/MasterCard.  Instant delivery is very important.  Ive already checked well-known sites like SEAGM, CoinGate, etc., but their prices arent competitive enough. If anyone knows legit distributors or marketplaces with better pricing for bulk or semi-wholesale (even for small quantities), Id really appreciate your suggestions. Thanks!", "target": "positive"}
{"text": "I run a small digital marketing business and specialize in search engine marketing. My background is in Google Ads, YouTube, and other paid media platforms where Ive helped brands scale with enterprise level strategies. The challenge Im running into is convincing small mom and pop shops that they can benefit from this level of SEM expertise at a rate they can actually afford. I price my services lower than most agencies because I want small businesses to have access to the same quality of advertising that bigger companies pay top dollar for. That said, even when I explain the value, many small business owners dont seem interested. Some feel digital ads are out of reach, others think word of mouth is enough, and some just dont want to spend money on something they cant fully see the return on immediately. For those of you who have successfully sold marketing or professional services to local small businesses: How do you make the value resonate? Are there specific angles or pain points I should be speaking to? What has worked for you when trying to turn skeptical business owners into paying clients? Any insights or experiences would be hugely appreciated", "target": "positive"}
{"text": "I've been in the web design/marketing industry for awhile now, but have only been freelancing/running my own business for the past 1.5 years. This week while generating a proposal for a client, I was struggling with whether or not I'm quoting the best way. My goal is to have a standard way of quoting that I can use/adapt for every project so I know I'm not underselling my services or underquoting a project. Currently, I'll look at a client's website and trying to calculate how many hours it'll take to do what they need me to do, multiply that by my hourly and there is the project cost. But what if it takes longer because of unforeseen circumstances? And estimating the exact hours of a task is always a crap shoot before really getting into the weeds of the site set up or marketing needs. How do others handle quoting their services like this? I've read a lot about value-based pricing rather than hourly. Where you take into account the monetary value you're providing the client. So if 40 hours of my time on a website improves your lead conversion, which equates to another $200k in revenue for that client that year, I should charge $50k for that because I'm generating substantially more value for them with my time than a hourly rate of $100/hour (that's just a random example so you get the idea). My recent thinking has been to offer clients four options: Offer to bill hourly. Get paid for exactly the time I work. This is variable and the client could end up paying more than they want. This also requires diligent time/task tracking so the client knows they aren't getting screwed over. Project-based cost. This is a set price ahead of time, but is inflated by some percent to account for unknowns, delays, extra meetings, etc. The idea is to add enough buffer to ensure I don't get underpaid and the client at least knows the total ahead of time. Some sort of value-based pricing like I mentioned above. But this requires truly understanding the financial picture of the business and what the services are going to do for their bottom line (which may not always be possible). Offer a more risky outcome-based pricing, such as getting 20% of all sales from the first year after a new ecommerce website launches. This is the most risky for me, which would mean it's going to cost the company the most. But it's a delayed cost and if it works out they should still make money on the deal. I would love to hear thoughts on these ideas or other ideas/strategies people have used that seem to work well.", "target": "positive"}
{"text": "Enough with all these $10k, $100k mrr posts. It is all getting very bland and pointless. Who has $0 mrr? :D I do.", "target": "negative"}
{"text": "What started as convenience has turned into a system that drains money from every side: Restaurants get extorted with 1530% commissions per order . This forces them to either raise prices or bleed out slowly. Drivers are paid scraps . $11.77/hour before gas on average . Its poverty wages, subsidizing billion-dollar corporations. Customers (thats us) get gouged with hidden fees, inflated menus, bogus service charges. sometimes paying 30%+ more than the food is actually worth . The apps dont create value. They leech it. They take money out of Toronto restaurants, out of workers pockets, and out of your wallet (and funnel it straight to Silicon Valley). So I built something simple: SkipFees . Its a completely free, community-driven directory of Toronto restaurants that deliver themselves . No parasites, no inflated prices, no middleman. I've added a few restaurants manually to get things rolling, but this is first and foremost a community project: Find restaurants near you that deliver directly. Dont see your favorite? Add it in seconds. Every listing is one less order encouraging the exploitation. P.S. Its very simple right now (and might be buggy!), but Im actively working on making it better. Im just a university student who got fed up watching local restaurants and customers get squeezed by billion-dollar bloodsuckers. SkipFees is free, and open to everyone. Check it out here: https://skipfees.com", "target": "positive"}
{"text": "What are you building today any personal projects share in comments with link if finished? I have been working on www.ReelStash.com a add free YouTube video library to watch your favorite YouTube videos.", "target": "positive"}
{"text": "Long story short, I launched my tool as a side project on May 22. It was what I needed back then, and still using it to schedule all my social media posts. Quit my 9-5 like a month ago and I made $932 so far. Mostly focusing on marketing & distribution lately to grow it even further. You can also check it out here if u want: postplanify.com", "target": "negative"}
{"text": "I suck at marketing. Ive tried learning, Ive tried applying - it just doesnt click. My social media communities are tiny, and honestly Im done fighting it. What I am great at is coding. Really great. Thats my strength, and its time to double down on it. They say master one thing - so I will. This year alone Ive built 5 (maybe 6, Ive lost count) products. I even posted daily. Zero traction. Either Im cursed, doing it wrong, or both - but it doesnt matter anymore. And you know what? Its fine. Ive seen worse. But this hustle culture where you plan, build, market, and maintain everything alone? Thats just too much. Screw it. Next time I build, I wont do it solo. Ill find a marketing partner and grind together. For those still pushing - I hope you get results. It didnt work for me, but it might for you. Love ya all:) As for me, Ill stick to what I do best: building. I know how, I love it, and it works.", "target": "negative"}
{"text": "Hi all  Id like to introduce QuickSummary , my first AI summary app. I built it because I couldnt find a good AI summarizer on the market  most were missing key features or locked everything behind high paywalls. As someone who uses AI summaries a lot, I really wanted something better. What makes QuickSummary different is that its completely free, lightweight, and utility-focused : Summarize from anywhere in any apps AI chat to ask question Lightning fast & smooth performance Free forever + you can even bring your own Gemini API key After just a week since release, the app has already reached 7k+ users . I honestly couldnt believe it! I think its because QuickSummary makes a good tool that really fits the needs of many people  and I believe it might even be the first truly free AI summary app on the market. Since its free & open source , anyone can try it out, give feedback, or even contribute to development. Id love for you to check it out and help shape where it goes next.  App Store: https://apps.apple.com/us/app/summary-ai-quicksummary/id6748961856  GitHub: https://github.com/spaceman1412/QuickSummary Thanks for reading", "target": "positive"}
{"text": "i made a quick website to help solve a problem i have. i usually read about some things in the news or stuff which i have no clue about, the most recent example was the enron scandal. I had always heard of it but never really knew what it was and I never felt like searching it on google and reading a bunch of articles etc, i like learning through videos or podcasts. so i made a website that solves this for me, it includes videos, articles (wikipedia for now) and podcast related to the search topic. I have loved listening to podcasts about these things since they go much more in depth and give me a better understanding, heres the link: https://kno-three.vercel.app/ corny name ik, im not super creative please leave feedback, i have no clue what im doing as you can guess by the long rant", "target": "positive"}
{"text": "Hey everyone! Im working on a bookmark manager app, inspired by Ra*ndrop.io. I really like their service, but every time I used it, I found myself wishing for more attention to UI and small details. Right now, I already have the core app running, a few integrations in place, and the Chrome extension is almost finished. Already done: - persistent copies - automatic categorization (yes, thanks to LLMs) - nested folders and tags - flexible sharings with realtime updates - comments/notes - Telegram integration and a lot more. My goal is to make this something truly great - and Id love to shape it further with your feedback. So, Im looking for a few early testers. If youre interested in trying it out, please DM me - Id really appreciate your thoughts.", "target": "positive"}
{"text": "Hey Folks Ive been flipping electronics on the side for a while, mostly electronics from Facebook Marketplace that I resell on eBay. Its decent side income, but the process was inefficient. Every time I saw a potential deal, I had to: Manually search the title on eBay Estimate the resale price Factor in shipping, eBay fees, and desired margin Do all the math to figure out what I could offer and still make a profit Too many tabs. Too many missed opportunities. So I built something better. Introducing Flipr Flipr Overview Image A Chrome extension that simplifies the decision-making process. Heres how it works: Browse Facebook Marketplace with Flipr extension active. When you see an item, hit the \"sold listings\" button  it opens a new tab with a pre-filled eBay sold search for that items title. Based on the eBay sold history, pick a target resale price , plug it back into the extension, and enter: Your estimated shipping cost Your desired profit margin (%) The product category Flipr runs the numbers and gives you:  eBay fee breakdown  Profit estimate  A suggested maximum offer you should make to hit your margin goal Its clean, fast, and already saving me time while increasing ROI. Why I'm posting here: Id love feedback from folks. especially those whove built Chrome extensions, pricing tools, or anything related to ecommerce/marketplaces Curious what features would actually make this more valuable Also open to monetization input (freemium extension vs standalone SaaS dashboard?) Heres the landing page if you want to check it out:  https://fliprtool.com Happy to answer questions or go deeper on the tech behind it. Appreciate any thoughts!", "target": "positive"}
{"text": "I have created a news digest tool that turn clickbait news headline into honest headline ( https://www.oneminutenews.org ). The tools has no monetization implemented for now, and I need a revenue model to cover for the hosting and API cost The thing is I am not sure what features would people want to pay for. Love to listen to any idea!", "target": "positive"}
{"text": "It is always difficult to find and reach customers, so I thought why not build for an audience that is all in one place. I built a Micro SaaS specifically for a 12K member Subreddit - People were sharing certain information regularly in that subreddit, I simply took it and put it in a website in a directory format - which is secure, easy to search and filter. I got 600 sign ups with just 2 posts, ~130 people started creating content directly on my site, and I got 7 paying customers since I added monetization a couple of weeks ago. It could have been more, but I gave extended free trial for all existing users till Sept 1st. So, hoping they would convert from Sept. Just wanted to share this here like a playbook that maybe you can try as well: Two biggest problems - Finding an idea to build, & Marketing it. My advice - Choose a Subreddit with 10K to 30K members and build a product around it. Why? - because each subreddit is already a niche, and if it has at least 10K members then I would consider it validated - people have gathered there because of a problem - either they need information or a community support. How to start? - look at the subreddit communities that you are already a part of for personal interests, not for business purpose, and choose one. Since you would already have a good understanding of the problem/needs of that subreddit community, you can start helping them by providing valuable information and slowly mention your newsletter/directory, and build an audience. Then you can expand into discord/webapp/micro SaaS/mobile app etc. If you can build and own your audience, then you can think of hundred ways to monetize it. Here is the best part, all the information you need to start would already be present in that subreddit itself, you just have to curate, organize it, maybe add your perspective, and make it easier to read/search/filter. Also, all your 'target audience' are in one place, so you can do cold DMs to reach them for free. Imagine a 50% sign up rate from a ~20K member highly engaged community! (..of course it won't happen in one day). Here are some things you can target to get good results: The subreddit should be between 10K to 30K members (these smaller subreddits are more engaging, and are not heavily moderated, you can promote your links as long as you are sharing information or helping the community.) Choose a Sub which is Non-tech and B2C. The subreddits should not be related to 'money making'/'finance'/'business' etc., because it's too competitive and also they don't allow promotions or linking your product. Find such communities which are just regular people who came to discuss their common interests, talk about their issues, or maybe just for community support online because maybe they can't share this with anyone in their real life. (People say all the good ideas are already taken etc. but you would be amazed to see what kind of niches exist in Reddit, which are completely untapped! And am not even talking about NSFW category.) Think of this as a long-term project, don't rush in to promote your product. First establish foundation and trust, and REALLY help the people (I can't stress this enough) - Money will come eventually if you provide enough value over time, but don't focus on it. I built so many products but nothing worked. But then, I tried this approach and it is working for me so far.", "target": "positive"}
{"text": "Im working on a SaaS idea that Im pretty confident solves a real problemIve seen tons of people complain about it on Reddit and in Google reviews. But instead of burning a few thousand building it out, I decided to put together a quick MVP to test the waters and see if anyone would actually sign up. After launching, I tried everything I could think of to get traffic to the landing page: Google Ads  got clicks but literally zero signups X (Twitter)  everyone says its a goldmine for startups, but with no followers my posts just get buried Reddit  posted in relevant subs without shilling, but no real engagement TikTok  a few short clips, only 50100 views each So now Im stuck. Do I keep pushing the MVP even though it feels like Ive hit a wall, or do I take the leap and actually build the tool? With just a landing page, its hard to do proper outreach or let people try anything. If the tool existed, I could start showing it around, maybe even get UGC creators to make content with it. What would you do if you were me? Would you risk building without much validation, or is there another way youd test demand before committing?", "target": "positive"}
{"text": "Now OBVIOUSLY... Everyone wants to have their work make a profit, whether in the actual bank or the mental bank. But when building a project.. Do you start with the end goal in mind? Or are you building it because you have a passion and hope people will see the passion you have with it I know passion is more of a flare word that has a deeper meaning that is only tied to the person who has the idea/passion for something.. But when it comes to something with a complex build that takes the passion you have for something and puts it in the palm of your hands.. How do you walk that line of \"Doing this for the love of the game\" opposed to \"doing this because I love the game, but I also love being able to pay to eat, and this thing i've invested a year in, doesn't fulfill the passion anymore and i'm broke....\" What is some advice on being able to sustain both?", "target": "positive"}
{"text": "Hey everyone, I recently launched a simple unit conversion website and would love some feedback on the site itself. My goal was to make it lightweight, fast, and easy to use on both desktop and mobile. Things Id especially like feedback on: Overall design and usability Clarity of the interface Mobile experience Anything that feels missing or unnecessary Heres the link: unitsandconversions.com Thanks in advance for any thoughts. Both positive and critical feedback are welcome!", "target": "negative"}
{"text": "Heres the truth: Notion is amazing, but its heavy to set up. FlowTask is my attempt to simplify - one prompt, instant workspace, with an AI (FlowBot) that actually works inside your docs and tasks. But I dont want to waste years building if the market doesnt care. Do you think theres space for this alongside Notion, or is it a dead end? Brutal honesty is welcome -if its not worth it, Id rather hear it now. If you're curious: link", "target": "positive"}
{"text": "I built something using only free AI tools heres what I learned along the way Body: Hey everyone  Ive been experimenting with free AI tools to build something meaningful no budget, no ads, just creativity and automation. Over the past few months, I designed a system using: ChatGPT for content and outreach Canva for visuals and branding Notion AI to organize and streamline workflows Gumroad to share what I built I documented the entire process, including the tools, templates, and lessons learned. If you're curious, the full guide is pinned on my profile. Here are a few things I discovered:  Minimalist branding and emotional storytelling resonate more than flashy tactics  Free tools can go surprisingly far if you combine them strategically  Reddit and Pinterest were my most responsive platforms  Automation without clarity leads to burnout  Trying to be everywhere at once weakens your message Im happy to answer questions or share templates if anyones building something similar. Always open to feedback and new ideas", "target": "negative"}
{"text": "Ive been working on a service API that deals with very large JSON payloads. My non-technical colleagues struggled to read or edit JSON directly, and most of the existing tools were either clunky, outdated, or ridiculously overpriced. So I built Jsonite  a lightweight, free JSON grid editor. Instead of working with raw JSON, you can view and edit documents in a clean spreadsheet-like editor with: Keyboard shortcuts youd expect (copy/paste, undo/redo, find/replace, etc.) Instant editing with possibility to switch between grid/text view Privacy by design since your data never leaves your browser and nothing is sent to a server Although I originally made it to help my teammates, I soon found myself using it too, and I've been finding it pretty useful when dealing with large and complex data. Its completely free to use (both personal and commercial). Hopefully it can save you some headaches!", "target": "positive"}
{"text": "I'm a developer who listens to music 8+ hours a day while coding. My static wallpaper was depressing me. So I built MuMood - it changes your Mac wallpaper to match whatever you're listening to on Spotify/Apple Music. The results have been surprisingly mood-lifting. Jazz = warm tones, electronic = vibrant colors, lo-fi = soft gradients. It's subtle enough for work but makes the desktop feel alive. Been using it for months, figured others might enjoy it too. Free download: mumood.com Anyone else obsessed with their desktop aesthetic?", "target": "negative"}
{"text": "Hi everyone, Im currently based in Belgium and have been thinking a lot about potential business projects here. I dont have a specific sector in mind yet, but Id love to connect with people who are also interested in entrepreneurship, exchanging ideas, and maybe even collaborating on something in the future. One advantage I bring is that Im already legally established in the country, which makes things easier when it comes to the practical/administrative side of starting a business. If anyone is exploring opportunities in Belgium or simply wants to share experiences about the local startup/entrepreneurship ecosystem, Id be happy to chat. Thanks!", "target": "negative"}
{"text": "Guys, gotta ask the room. Solo founder of an AI startup here. After a long grind, I've finally gotten this thing profitable, and honestly, it feels incredible. But man... is it just me, or is this path insanely isolating? I've been trying to find like minded people to connect with, and it's been rough. I feel like I keep running into the same types of people: The \"idea guys\" who have a million-dollar plan but have never shipped a single thing. The people who are just kind of half-assing it, without any real commitment. The founders who are so stuck on their own idea or ego that you can't have a real, honest conversation. I'm just looking for other people who are actually in the trenches, building and debugging and grinding it out. Is this just a normal part of the process that nobody talks about? lol. Seriously, anyone else going through this, or is it just me?", "target": "positive"}
{"text": "I just launched my SaaS called WaitLess, and Id really love to hear your thoughts. Its a queue management system for any business, salons, clinics, restaurants, auto shops, offices, you name it. How it works: A customer calls or checks in  theyre added to the queue. They instantly see their position and estimated wait time via a live link. They get notified 15 minutes before and when its their turn. This way, businesses reduce walkouts and keep customers informed without crowded waiting rooms or frustrated lines. Heres the live demo if youd like to try it: www.getwaitless.com Since this is my first SaaS, Id really appreciate your honest feedback: Does this solve a real problem for businesses? What would you expect in terms of features or pricing? Thanks in advance", "target": "positive"}
{"text": "Me and my two team members have been building for about 13 months now. We had to pivot a few times. the bugs, features, mismanagement of time and resources, state of something or the other always not working - I have felt when we did have people trying us out, they probably could not achieve what they set out to do. Now, a little exhausted but am feeling confident of the state we are in, progress has been a lot slower than I anticipated and we are at 0$ MRR but I think think we are back on track, now I can really start to market it as I had envisioned. I did feel we loose precious time but - I am hopeful of things getting better now. Step 2: Market, events, posts and continuous engagement --> feedback, bugs --> fixes, and repeat. Goal is to get to 500$ MRR, wish me luck!", "target": "positive"}
{"text": "Hello everybody, I've been developing a utility piece titled FlowTask, and I am completely torn about decisions now. The general concept is: Instead of spending hours coming up with systems (as in Trello, ClickUp, Notion), you just type one prompt  FlowTask generates a structured workspace with tasks, docs, deadlines in a snap. Example Write \"Plan a Black Friday sale\", You are given a plan deadline, checklist for marketing, and copy prompt samples. Write \"Research competitor pricing\", You receive a workspace for notes + tasks to accomplish in an organized manner. On top of everything else, I just made FlowBot: It is a context-sensitive AI residing within your workspace. Rather than canned responses, it reads what is already on the page and responds specifically. Example: Upload a contract, Click \"highlight risky clauses\", it highlights problems straight in the doc. Or: Ask it to \"summarize these meeting notes\", it condenses them into neat bullets in real time. Where Im stuck is this: Some folks show me this is a productivity game-changer, \"skip the setup, start executing.\" Others comment, \"All it does is what it does now.\" So let me ask in complete sincerity: Would you really use some such service as FlowTask in everyday life? If yes, whats the #1 use case where it saves you time? If no, whats missing or what would stop you? I do not wish to invest my time in developing something nobody cares about. If this has legs, I'll double my efforts. Otherwise, I'll pivot. Any real feedback (good or harsh) is gold for me. If you're curious: link Thanks,", "target": "positive"}
{"text": "None of us can stick with calendar apps. Tried everything, same story every time. The problem hit me late one night. Want to add \"lunch with mom tomorrow\"? Suddenly you're filling out forms. Title, time, location, alerts... I just want lunch on my calendar. When did this become paperwork? AI calendars were supposed to help. Now you type \"lunch with mom\" and get restaurant suggestions, weather updates, traffic reports. The lunch still isn't scheduled. So we built Trace differently. One input box. Say whatever. It handles the rest. \"Team meeting tomorrow 2pm\"  done. \"Cancel Friday's workout\"  gone. \"Move dinner to 7\"  updated. Making it simple was brutal. Users see one text box, but multiple models work behind it figuring out what you mean, when you mean it, what conflicts. Here's what I learned: people don't want to see your AI work. They want their stuff handled. Every time we showed off the tech, users got distracted. People don't want revolutionary planning. They want their current process to suck less. Since launching paid in February: 400 subscribers, zero ads. Anyone else noticing this? Users seem to prefer when AI just shuts up and works. We're on Product Hunt today - curious to see how this approach resonates with a bigger audience. Kind of nervous but excited to get it out there. Product Hunt: https://www.producthunt.com/products/trace-16 Download on App Store: https://apps.apple.com/us/app/trace/id6503812022", "target": "positive"}
{"text": "A few years back, a small VC firm thought theyd found a winner. The SaaS they invested in was pulling in $60,000 a month in revenue not bad, right? Thats over $700k a year. On paper, it looked solid enough. Customers were paying. Growth seemed possible. And the market was hot. But underneath the hood? It was a ticking time bomb. The company was burning $170,000 every month to keep the lights on. That meant for every $1 coming in, almost $3 were going out. Still, the investors told themselves: Growth will fix this. Just give it time. At first, churn was under control. Customers were sticking around. But then, net retention slipped from over 100% down to around 85%. Instead of asking Why are people leaving? Whats broken in our product? the leadership blamed the customers. And instead of cutting burn, laying people off, slashing spend, forcing a reset they said: Well grow our way out of this. It only got worse. One co founder left. That should have been a wake up call. A chance to reset. But nothing changed. With cash dwindling, they did a least worst merger with another struggling SaaS, hoping two weak companies could magically become one strong one. You can guess how that ended. Equity holders? Wiped out. The company? Gone. The Lesson Revenue isnt enough. $60k/month looks great on a tweet, but if your burn is triple that, youre dead man walking. Retention is oxygen. When it slips, fix the product, dont blame the customer. Culture  survival. Sometimes you need to make brutal cuts to live another day. Even with $60k coming in every month, this SaaS collapsed in slow motion simply because nobody had the courage to slam on the brakes. Source: Autopsy of a SaaS Death  Blossom Street Ventures", "target": "positive"}
{"text": "Looking for what others use for their apps and why ? To create my own stack based on the needs of my app.", "target": "positive"}
{"text": "We tried so much but dont know whats the best most scalable way to do it. Cold email? Cold call? Conference? Industry meetups? Were building AI tools for a legacy vertical.", "target": "positive"}
{"text": "People are addicted. Heres the deal: every productivity app swears itll make you more organized. Tags, colors, subtasks, Kanban boards, recurring reminders. You end up spending more time organizing than actually doing. So I flipped it. You add a task. It auto-deletes in 24 hours. Gone. Forever. \"Finish investor pitch\"  better hurry. \"Buy groceries\"  or youre eating rice and ketchup tonight. \"Clean bathroom\"  too late, now you live in filth. The app doesnt care. Its brutal. It makes you care. We called it \"Amnesia.\" Heres the insane part: people love it. Turns out nobody wants eternal lists of guilt staring at them. They want consequences. Urgency. Survival. Making it work was harder than it sounds. Phones try to save everything. Syncs, backups, archives. We had to fight the entire software ecosystem just to let you forget. Now users brag about it. \"I crushed 10 tasks today because otherwise my phone was going to wipe them.\" In three months: 1,200 paying users Zero features added Negative roadmap (we delete ideas before building them) -$5k MRR Heres what I learned: sometimes the dumbest, most hostile idea is exactly what people stick with. Should we even launch this publicly? Or just keep it underground for the productivity masochists?", "target": "positive"}
{"text": "Been looking into B2B SaaS self-serve onboarding recovery. The gap with e-commerce is confusing. E-commerce (Klaviyo benchmarks): Abandoned cart recovery: $3.65 per recipient 3.33% conversion from recovery alone Top performers: $28.89 per recipient B2B SaaS: User abandons onboarding... \"We miss you\" after 30 days Detects where they got stuck... Nope Recovery metrics... \"We don't do that.\" Does anyone have a tool that actually solves this for B2B SaaS?", "target": "positive"}
{"text": "I am building a end to end encrypted zero knowledge file management system. Here you can store your data and only you can read the date even we can't. https://doclet.app", "target": "positive"}
{"text": "I mean the scrappy, weird, or creative moves that actually worked for you. Could be anything from random chance encounters to quirky marketing experiments that somehow brought in real business. Curious to hear the stories- whats the most outside-the-box way youve ever landed a customer?", "target": "positive"}
{"text": "Version 1 was built by me. Version 2 was built by employee #2. Version 3 was built by employees #2 and #3. We just went live yesterday, and any additonal hires will be \"core employees\". They were important to the build but not critical. Like I could get other people to build at this level too for the same market rates. Do emoployee #2 and #3 get co-founder title? I've already given them the max equity for such a situation at 2% each, even though they didnt request it, nor was it promised. I think we really trust each other at a very high level so I treat them like family. Also, do I give the current main engineer CTO title? I was hoping to poach someone with a lot of pedigree to match our vibe and get the max valuations every round. Afterall, I want their 2% to count. In the space, we won on branding, product features, team and solution. As opposed to typical LLM companies, we dont serve customers our solutions. We use APIs, prompt management, query orchestration etc to serve the best industry solutions. Kinda like if Kaggle, Hugging Face and Wolfram Alpha had a kid. We create pipelines to do everything from fraud detection to cancer research. Our TAM is massive with B2C, B2B, B2E, B2G implementations. I feel a CTO thats ex-faang or something close would bring a lot of \"brand\" value. We are already positioned to deliver the best product to the market. How do I make the optics match? P.s I'm hiring exceptional MLEs, Data Scientists, Developers. We are building a \"calculator on steroids\" in the Data + AI space. DM me for more details!", "target": "positive"}
{"text": "Hi everyone, I have recently launched my product and got a few users. Now, I want to inform them about new features, but I am new to marketing and have no Idea how this actually works. So, what tools do you use to send product update emails? How often do you send them? What do I need to keep in mind to get the best out of it?", "target": "positive"}
{"text": "Aven Technologies Inc. is a global technology company focused on building enterprise-grade solutions that enhance business communication, improve customer engagement, and support scalable growth. Our products range from CRM platforms to advanced communication tools, all developed to meet the evolving needs of modern businesses. We work with organizations to create solutions that deliver measurable impact. Connect with us to explore how Aven Technologies can support your business goals. AvenTechnologies #EnterpriseSolutions #BusinessTechnology #CRM #BusinessGrowth #DigitalTransformation", "target": "negative"}
{"text": "Hey there! - Pretty new to this SaaS space but have been fascinated with computer science and AI as a whole not to mention the potential for revenue. Just looking for some people to collab with! Hit me up if you're interested. Maybe we could start something awesome!", "target": "negative"}
{"text": "I feel like a pile of sh*t when I see someone elses habit tracking app makes some profit and my app just sits there like like a door stopper everyone walks past and doesnt even look at it. Here are some of my thought after building three product. ticketing app (1 year) (launched but removed) - failed becos I suck at marketing and no one needed my app but I kept building but it works and shows myself what I am really capable of doing. Started from frontend to writing backend to hosting to writing cron jobs and all from scratch - learned to not waste time - learned the hard way that people wont come if u just build it. session recording app (1 month+) (launched) - https://recordy.dev/ - recently completed it, but it seems big companies like posthog etc already solves the issue enough to kick micro saas like mine out of the niche. - people didnt actually need it. In my opinion - learned to validate my idea first before building - learned to utilise AI to build fast - learned new existing tools(nextjs, supabase) to build fast - launched on product hunt example api data app (1 week) (launched) https://apiexamples.com/ validated first in Reddit (few people actually said that they have these issue that I am trying to solve) maximising full potential of AI to generate and review code in short amount of time. learned different business model (Adsense) learned that having the knowledge to build doesnt equal to have customers. learned t do SEO optimizing with, google search console and keyword ranking and stuff. What do you guys think? I didnt make a single dollar here but still I am proud of what I have learnt along the way. What is the journey for you guys like? Tell me in the comments :).", "target": "positive"}
{"text": "Executive Summary The SaaS community is actively seeking solutions to critical challenges in market validation and customer acquisition, particularly in the rapidly evolving AI-driven landscape. A dominant theme is the frustration with ineffective cold outreach and the need for more targeted, personalized, and automated marketing strategies. Many founders also struggle to identify genuine market problems beyond their own developer-centric issues, leading to product saturation and a lack of clear differentiation. Furthermore, there's a recognized need for tools that streamline internal business operations, such as tracking software subscriptions and managing user feedback, to reduce costs and improve product-market fit. 1. Top 5 User-Stated Pain Points Ineffective & Time-Consuming Cold Outreach: Founders perceive cold emails and DMs as a \"huge time sink\" with low reply rates, and struggle with the effort required for genuine personalization at scale. Quote: \"cold outreach feels like a huge time sink. Some say writing the first message takes forever, others say getting replies is the real struggle.\" Lack of Market Insight & Product Validation: Many \"indie hackers\" build products based on their own problems or without deep industry experience, leading to generic \"dev tools\" and a struggle to find genuine, paying customers. Traditional validation methods like landing pages are seen as insufficient. Quote: \"a lot of indie hackers / build-in-public folk often haven't had actual deep industry experience in anything, they aren't exposed to any vertical-specific pain points.\" Difficulty Acquiring First Customers & Achieving Distribution: Technical founders often excel at building but significantly underestimate the \"grind\" of marketing and distribution, struggling to get their product in front of the right audience. Quote: \"It doesn't matter how good your code is if you can't distribute it or sell it.\" Information Overload and Disorganized Data: Users, especially solo founders and small businesses, are overwhelmed by the sheer volume of information (emails, social DMs, internal documents) and struggle to filter what's truly necessary. Quote: \"we are building LM-powered software that will help people with information overload and presents the necessary information only like in emails, social DMs.\" Inefficient Management of Software Subscriptions: Companies (from small teams to agencies) waste money on forgotten or unused software subscriptions and struggle with manual tracking methods like spreadsheets. Quote: \"Im thinking of building a lightweight app for teams/companies that subscribe to a lot of software and struggle to keep track of whats still in use.\" 2. Validated Product & Service Opportunities AI-Powered Outreach & Lead Generation Platform The Problem: Founders waste significant time and effort on cold outreach (emails, LinkedIn DMs) that often results in low reply rates and difficulty personalizing at scale. The Opportunity: A SaaS platform that automates the identification of high-intent leads from social media (e.g., Reddit, LinkedIn), crafts personalized messages, and facilitates multi-channel outreach campaigns. Key Features / Deliverables: Keyword-based social listening (Reddit, LinkedIn), AI-generated personalized message drafts, automated DM/email sequencing, lead scoring/prioritization, integration with CRM/outreach tools. Evidence from Data: Directly addresses \"frustrating part of sending cold emails or DMs,\" \"personalization at scale,\" and \"getting any reply at all.\" Mentions Reddit Notifier, F5Bot, and SourceGeek as existing/similar concepts. Market Problem Discovery & Validation Toolkit/Service The Problem: Technical founders often build solutions without deeply understanding specific market pain points beyond their own developer challenges, leading to products with low demand or high competition. The Opportunity: A service or tool that helps founders systematically identify underserved market niches, extract validated pain points from community discussions, and conduct effective demand validation before extensive development. Key Features / Deliverables: Reddit/community scraping for pain points, structured survey/interview templates for validation, \"fake checkout\" or commitment-based validation methods, market size estimations (TAM, SAM, SOM), ICP definition guidance. Evidence from Data: \"Im confused about what kind of startup to build  where do people actually find real problems to solve?\", \"Landing pages don't validate ideas. They validate your marketing copy,\" \"Reddit Idea Scraper\" (a user-built tool) and explicit requests for market research. Collaborative SaaS Subscription Optimization Platform The Problem: Companies, especially small to mid-sized teams, struggle to keep track of their numerous software subscriptions, leading to wasted expenditure on unused tools and inefficient budget management. The Opportunity: A lightweight, collaborative SaaS application that centralizes all company subscriptions, allows employees to mark active usage, provides renewal reminders, and suggests cost-saving opportunities. Key Features / Deliverables: Centralized dashboard for all subscriptions, employee-driven usage status updates, automated renewal alerts, spending analytics by category, AI-powered cancellation/optimization suggestions. Evidence from Data: \"Would your company use a simple app to track software subscriptions?\", \"spending over $200 a month on subscriptions I barely used,\" and a direct mention of \"SubBuddy\" as a solution built to address this. 3. Target Audience Profile The primary target audience consists of solo founders, indie hackers, and small to medium-sized business (SMB) owners and managers , particularly those with a technical background (developers, engineers) who are building or running SaaS products. Likely Job Roles: Software developers turned founders, startup CEOs, marketing leads in small teams, sales development representatives (SDRs), recruiters, and operational managers. Tools They Currently Use: Spreadsheets, Notion, Discord, LinkedIn, Product Hunt, GitHub, generic AI content tools (ChatGPT), Apollo, existing outreach tools (e.g., SourceGeek), and basic monitoring tools. Many are also familiar with modern tech stacks like Next.js, Supabase, Stripe. Primary Goals: Increase revenue, acquire first customers, validate product ideas quickly, reduce marketing costs, optimize operational efficiency, avoid \"building in a vacuum,\" and manage financial outflow effectively. 4. Potential Monetization Models AI-Powered Outreach & Lead Generation Platform: Subscription (tiered based on lead volume, features, or team size), Freemium (basic features free, advanced paid), Pay-per-lead, Enterprise licensing. Market Problem Discovery & Validation Toolkit/Service: Subscription (tiered for tool access), Fixed-Price Service (for custom research reports or validation sprints), One-time License (for template libraries or specific datasets), Consulting packages. Collaborative SaaS Subscription Optimization Platform: Subscription (tiered by number of users or tracked subscriptions), Freemium (limited tracking for free), Enterprise plans with advanced integrations. 5. Voice of the Customer & Market Signals Keywords & Jargon: indie hacker, build-in-public, dev tools, SaaS, MRR, MVP, Product Hunt, cold outreach, DMs, personalization at scale, churn, retention, product-market fit, bootstrapped, solo founder, AI, LLM, vibe coding, distribution, moat, GTM, TAM, SAM, SOM, ICP, ATS, freemium, LTDs, Appsumo, webhooks, analytics, database latency, UI/UX, conversion funnel, NPI/NDA, SDR, cross-promotion, lead generation, API, boilerplate, no-code, micro-SaaS. Existing Tools & Workarounds: Reddit Notifier, Apollo, SourceGeek, GoAgentic, Posthog, Hotjar, Appsumo, Saaszilla, Google search ads, Meta ads, LinkedIn, Twitter/X, Notion, spreadsheets, Discord, Gmail, Stripe, Paddle, Lemonsqueezy, Bubble, n8n, GitHub, Figma, Spotify, Netflix, Shopify, Magento, Canva, ChatGPT, Gemini, Claude, Perplexity, Deepseek, Grok, F5Bot, Zluri, Torii, SubBuddy, Snyk, Checkmarx, Mailchimp, SendGrid, Postmark, HubSpot, Vue, Pinia, Loom, Dadan, AppearOnAI, Perplexity Collections, SerpAPI, DitDo, AICarma, Syndr AI, PureVPN. Quantified Demand Signals: Numerous threads and comments on the frustration and low success rates of cold outreach, indicating a persistent, unsolved problem (\"Comments (28)\" on \"Most frustrating part...\"). High engagement on posts about achieving early MRR, even small amounts like $608, showing strong interest in growth strategies and validation (\"Comments (57)\" on \"$608 MRR\"). A post specifically offering to \"research leads and fine-tune your marketing\" received \"Comments (78),\" demonstrating a clear demand for lead generation and marketing support. Mentions of tools like \"Reddit Notifier\" and a \"Reddit Idea Scraper\" built by users underscore the perceived value in leveraging community data for market insights. The \"SubBuddy\" app, built to solve a personal pain of wasting \"$200/mo on forgotten subscriptions,\" highlights a relatable and quantifiable financial problem. The \"AI Sales Rep\" SaaS, Humen, achieving \"$900 revenue 30-day span\" and a \"waitlist of 150 users\" in a short time demonstrates demand for AI-driven sales automation. Discussion around \"distribution is the only moat left\" with \"Comments (49)\" reflects a widespread concern about competitive advantage in a crowded market. I just want to see if this is somewhat near accurate? are you really facing these problems? and if you like it, would you like it to see for other subs, as reddit posts, or a newsletter maybe?", "target": "negative"}
{"text": "Have you used explainer videos mid-funnel with your brand? Does it actually help with conversions?", "target": "negative"}
{"text": "I'm a solo founder who has invested over $1 million to build a fully-functional edtech platform serving Pre-K through 5th grade . The curriculum is meticulously aligned with Bloom's Taxonomy , a key selling point for a sophisticated educational audience. I've already successfully launched the curriculum for Pre-K through Grade 2, and the rest is on track to be completed by the end of September. We also have a free, live Spell Bee feature for the entire Pre-K-5 range that is already building a user base. As a product-focused founder, my expertise is in building, not scaling. The platform is now at a point where it needs a partner with the resources and experience in marketing and sales to unlock its full potential. I am not just looking for an investor, but a partner who sees the immense value in acquiring a launched and validated product and has the ability to take it to market. If you have a background in scaling SaaS or edtech products and are interested in learning more, please DM me. A confidential pitch deck with further details is available for serious inquiries.", "target": "positive"}
{"text": "There is one thing in automation that is rarely discussed, when AI can do everything quickly and efficiently, will we stop thinking? For example: the CV screening process in the Alurai l tool, there you can sort, m based on the CV, as HR will you lose the 'feel' or intuition in finding the diamond in the rough? The candidate may not fit the machine's criteria, but has great potential. Or in terms of market research, if AI analyzes raw data, will we lose the opportunity to understand the nuances of the story behind it? Is that true: - At what point does it automatically backfire and cause us to lose our human touch and creativity? - How to balance between AI speed and human institutions? - Have you ever had an experience where automation actually made you feel like you were being controlled by a machine?", "target": "positive"}
{"text": "I've been running FanCircles.com for the past eight years. It's a specialist SaaS product that costs around $60,000 per year. It's aimed at music artists and celebrities who have large audiences. For example, a music artist may use this if they're already playing 2,000 people per night. In those situations, we've consistently earned music artists $100,000 per 1,000 fans per year. The problem is the addressable market is much larger than this very difficult-to-reach niche. Don't get me wrong, we have over 100 creators already signed up. However, it's not been my most successful company. For example, my last company Awin.com was sold with a turnover of $150 million. In January this year, we began building what I thought was going to be a 2-3 month project. We call it FanCircles PushPass. Essentially, it's a way to push mobile notifications without the use or need of an app. It's priced at $24.99 a month, and I call it the \"MailChimp of notifications\" - it's a mass-market product. It took longer than 3 months. We're now 8 months later, and we're a week or so away from launch. It not only serves every size of music artist but also influences YouTubers and the whole creator economy, providing them with a way to reach their audience directly while collecting data (including email and location). Notifications can be pushed to their followers after a simple click or scan of a QR code. These notifications can either be simple messages or messages with links to anywhere. So for our YouTuber, it could be a message saying \"Hey, I've posted a new video\" or \"Hey, I have a 10% discount in my store right now. Click here\". For a music artist, it could be \"Listen to my new album on Spotify\" with a link to Spotify. With our 8-year history, I've got a massive database of artists and influences who didn't fit our $60,000 superfan app. And with my affiliate marketing history, the key behind this is a 30% ongoing lifetime commission for every new subscriber referred. I think for any SaaS model, affiliate marketing needs to be built into the P&L. And that's always been my aim from day one. The creator economy is huge, of course, and I want to take advantage of using YouTubers, TikTokkers, and Instagram influencers to promote the product, but it has to be worthwhile to them. And so the 30% lifetime commission is key to building lifetime partnerships. I'm very excited about getting this product launched - there's so much effort being put into it, and with a team of 12 people, we're ready to go. Wish me luck!", "target": "positive"}
{"text": "Building voice agents is easier than ever. There are plenty of no code tools that help you get something up in just a few minutes. The real challenge is making an agent that can survive all the edge cases that show up in real conversations. And thats before you even get into latency, model choice, and scaling to thousands of calls. When we first started building voice agents, this became painfully obvious - so much that we started building quite a lot of observability tooling around our own agents. It got to a point where we realized that making voice agents reliable might be a more interesting problem then building the voice agents themselves. My cofounder and I set on this journey last year - since then weve been through the YC winter batch, had countless sleepless nights building product, handled over 10M+ minutes in audio, and helped several voice AI teams fix the weak spots in their agents. We've built three core features that cover the development cycle of a voice agent - we let voice builders monitor live calls through integrations with all the popular voice agent platforms, catch failures as they happen through custom and pre-built evaluations, and then turn those failures into repeatable tests by simulating real phone calls with customers. That loop helps teams spot issues early, fix them fast, and keep agents from breaking in production. The lesson for us has been that sometimes the side problem - the tooling you build just to survive - turns out to be the bigger opportunity. We're live on Product Hunt today ( https://www.producthunt.com/products/roark ) - would love to get any feedback on our launch page or here in the comments. Have you built voice agents before? How did it go? Did your agent ever make it to production?", "target": "positive"}
{"text": "Ive always wanted to start a business or build an app for 15+ years. Now Im almost 40 and still without success. Fear, laziness, overthinking & worrying what others think always held me back. But today that changes. This is Day 1. Ill prove to myself that I can do it. As for now; i will be starting on 2 projects and working on ideas to: 1. Build an app/ SAAS using No code tools 2. Build a 1 product webpage First step is to learn and improve as i go and not about making money right now. Its about overcoming my fear of failure, overthinking and getting things to work. That will my first success. Ill share it all here and on X  the struggles, the small wins, the lessons. If youre reading this, join me. Reply, engage, give feedback & encouragement. Anyone else struggling like me can also share with me their journey and lessons. I really want to get this done for myself and my lovely family. Please also follow me on X: https://x.com/Startingat_40", "target": "positive"}
{"text": "I need a portfolio site fast for freelancing but dont want to hire anyone or wrestle with WordPress. Are there any quick solutions for non-technical people?", "target": "positive"}
{"text": "I dont need anything fancy, just a proper business email and a one-page website for my handyman services. Feels like every platform wants me to juggle 34 different tools. Is there an option that is easy to set up?", "target": "positive"}
{"text": "I recently realized my mission. I figured out what I love most. It was when I was watching a video about time of negative. I was more excited than hearing about someone's exit, and the thrill might have been even more intense than when I have my own exit. I realized it along with another video I experienced at that time - a video about how the unified field theory of gravity might be completed. At that moment, I realized what I want is to see \"the edge of the universe.\" Gravity distorts space, and observing time might finally bring it into a realm we can control. Then, maybe, just maybe, we could experience leaving our galaxy and traveling to another universe within our generation? You might know this, but the Earth-made object farthest from Earth is Voyager 1. But it hasn't even left the solar system yet. The thought of surpassing that - my heart races just writing this. Of course, when I told my girlfriend about this, she thought I was absolutely crazy lol. Some of you here probably think the same. But I'm convinced this future will come someday, and I'll work to bring it within my generation. That's why I want to focus the ultimate goal of all my business capabilities on helping with that. After taking care of myself, I'll help maintain Earth as our cradle and then help those who can work on this. Sadly, I'm not that smart, but I can still help them. That's my story. Do you guys have a mission like this?", "target": "positive"}
{"text": "Hi mates, I am a 30~ish Male trying to go solo for the first time after being employed at big companies. I am currently working after daily work routine, on a couple of products, trying to resolve some problems I am aware of on the first one, and help a niche I love to expand their knowledge. 1st one is going fine, even if the product seems to be much difficult to develop than the idea I had of, so I am trying to cut features for future development, if ther product goes well, meanwhile the 2nd one is just a POC right now. My question is: how do I \"promote\" my first product? I mean I know the audience, it's a difficult one but still manageable since I may have contact to bypass some procedures, and I am sure my product will impact the life of lots of people, since it first solve a problem myself and my family do have most of the time. Other than this way? Which requires time and probably me leaving my current job, what can I do? Asking on reddit if it could work (for now it's a very country specific, because it should be a way to bypass our slow burocracy) Should I publish a landing page first? What can I do on the landing page or what can I explain without exploiting my idea to others, while receiving feedbacks? Is it useful to do a landing page first eventually before landing the MVP? I am genuinely asking to expand my knowledge. Thanks everyone and cheers.", "target": "positive"}
{"text": "Were handpicking a small circle of creators to represent OmniAi our AI recruiting software. If youve got a real audience and a reputation for being solid, this is your opportunity to work with us. Limited spots. No gimmicks. Youll get a personal code, rev share on every sale, early access, and a direct line to the team. If you believe like we do that AI is rewriting how sales gets done, feel free to apply as top affiliates will receive equity in our company when we go public. comment to apply and we will get on the phone and figure out details!", "target": "positive"}
{"text": "As small business owners, many of us know the feeling: you build a great business, but you feel completely invisible. Often, the first thought is paid ads, but that quickly turns into a costly price war with the giantsa dead end. The second path is SEO, with the hope of outranking the market leaders for broad keywords. Unfortunately, both of these paths are the wrong battle . Instead of fighting for expensive, broad traffic, the key is to target the customers who are already at the finish line, wallet in hand. Heres the playbook on how to 'steal' them from the competition. Here are 3 simple plays: 1. The \"Us vs. Them\" Page ([Your Brand/Product] vs [Competitor]) Customers searching for this are ready to buy. Create an honest comparison page with a feature or service table. Don't just trash your competitionsimply show where you are the better choice (price, quality, location, customer service). 2. The \"Alternative to...\" Page (alternative to [Competitor]) You're capturing people who are actively dissatisfied with the market leader. Create a page that focuses on their pain points and shows how your business solves them. 3. The \"Best for...\" Page (best [product/service] for [niche]) This is the key to success for SMEs. Instead of fighting for broad keywords, dominate your niche. For example: Local Services: Instead of fighting for \"cleaning company,\" dominate \"office cleaning company in Boston.\" E-commerce: Instead of \"running shoes,\" target \"lightweight running shoes for pavement.\" Professionals: Instead of \"lawyer,\" try \"estate planning lawyer in Chicago.\" Position yourself as a specialist for a specific group, and you'll win their trust. 4. So, what's next? (Seriously, do SEO ) In small teams, there's often no time for this, but warring over paid positions in Google Ads is probably an even worse tactic. Besides, there are no excuses these days. If you don't want to hire an agency and don't have much time, there are tons of tools that let you get really good results with a very low investment of time and money. You basically only need a three-app stack. For mapping out user questions, use AnswerThePublic . Next, for the actual content creation, use tools like Verbite to generate solid, ready-to-publish drafts from your keywords. Finally, to monitor your results and your site's technical health, hook up the free Ahrefs Webmaster Tools .This stack lets you cover the key bases by investing about 1.5 hours a week, and month over month, you'll build more authority and gain more organic traffic. TL;DR: Stop fighting giants for broad keywords. Instead, \"steal\" high-intent traffic by creating 3 types of pages: [You] vs [Competitor] , [Competitor] Alternative , and Best [Product/Service] for [Niche] . Once you have these pages, continue your SEO efforts. Don't have time? Use simple tools for research and quick content creation. Month after month, you'll gain more and more traffic. What's the most effective (and maybe underrated) growth tactic you've found for your business? Let's share some knowledge.", "target": "positive"}
{"text": "I work for myself and sometimes I let client emails sit for too long, which I know is a bad habit. I want to find a way to track my own average response time so I have a number to focus on improving. Is there a personal dashboard for this?", "target": "positive"}
{"text": "When I started building my travel-tech idea, I got pulled into startup paperwork mode:  Should we register as Pvt Ltd or LLP?  What about compliance costs?  Do we need a CA on day one? It felt like progress but really, I was just paying for a very expensive hobby. Thats when it hit me:  Validate your idea with cash, not compliments. Because: Compliments dont pay your server bills. Compliments dont prove demand. Compliments dont save you when things get hard. Cash does. Thats why I started thinking in terms of Funding-Market Fit :  Product-Market Fit gets you users. Funding-Market Fit gets you survival.  Its proof your product deserves capital  not just code.  Until you hit it, your company is just paperwork. Heres what it looks like in practice: 1 Build an MVP. 2 Market it before launch (Twitter, Reddit, LinkedIn are free). 3 Get paying users  even if its 100, even if its ugly. 4 Only then, register the company or think about raising. Because at the end of the day: Compliments are free. Cash isnt. Thats Funding-Market Fit.  So if youre building, dont just chase users. Validate your idea with cash, not claps. Because Product-Market Fit gets you traction. Funding-Market Fit gets you survival.  Now tell me  did you register your startup before your first rupee of revenue? Worth it, or just expensive paperwork flex? #StartupLife #EarlyStageStartup #FoundersJourney #BuildInPublic #StartupLessons #FundingMarketFit #ProductMarketFit #StartupFunding #VentureCapital #AngelInvestors #Entrepreneurship #BusinessGrowth #StartupCommunity #IndianStartups #TechStartups", "target": "positive"}
{"text": "been a fullstack dev most of my career, worked on a couple of startups, launched tens of products. but i was never the centre nor the main person responsible for the launch. Recently I have been focusing on building a tool that I genuinely thinks it would be useful, but i have been stuck at this 90% stage for a while. its not that I cant finish the job, its just this time I am the person solely responsible for it and i keep having this feeling of what if, what if people dont see the value in it, what if theres bug people find and it doesnt worketc so I have been dwelling on it, making so many changes that dont really matter, like change the color of this line of text, change that comma to fullstop, just keep pushing back the launch i know i should just do the launch anyway, whats the worst can happen, right? but just let me move that image 5px to the left and Ill do it", "target": "positive"}
{"text": "Hey! I built an app for solopreneurs to work \"together\" on their projects and launch them, it's completely free. Would be good to see as many of you on there as possible and work alongside you building your dreams :)", "target": "negative"}
{"text": "Not gonna lie, the usual suspects like ChatGPT and Claude get all the hype, but these ones dont get enough love. Sudowrite  If you ever hit a blank or want to improve your draft, this is great for brainstorming, rephrasing, and wild creative suggestions. Their Expand feature is super useful. Notion AI  It's really much more than just note-taking. I love that it turns messy thoughts into organized outlines and you can even use it to write first drafts for blog posts or newsletters. Grammarly  Old but gold. I really like the real-time feedback that prevents embarrassing mistakes from slipping through (especially on late-night edits) and their suggestions get specific about tone/clarity. Walter Writes  Still pretty under the radar, but its amazing for rewriting AI drafts so they read more naturally. I use it to humanize posts and avoid that generic robot feel (detect dot ai is a close second). ClosersCopy  Great for marketers who want extensive copywriting frameworks/templates tailored for ads, emails, blogs, and SEO. It's got over 700 frameworks made by pros and helps create highly targeted marketing copy with SEO built in. Which lesser-known AI writing tool do you keep coming back to? Drop suggestions. I love finding hidden gems and will try anything once.", "target": "negative"}
{"text": "Did anyone ever tell you hard work makes you rich? WRONG. Thats the biggest scam society has ever sold you. Look around: cleaners, labourers, waiters, delivery riders theyre hustling harder than CEOs. A construction worker probably works harder than all of us combined. Are they rich? No. Theyre broke, exhausted, and stuck in survival mode for their families. Working harder doesnt make you rich. Working smarter does. More smart work = more money. Build systems that make millions for you. Read the full blueprint that will make you discover the Lazy Millionaire hiding inside you.", "target": "negative"}
