{"text": "Is there a learning theory that has any popular following that does not believe in homework? Or rather, homework just to have homework? I see what all my nieces and nephews have to do these days, and it seems ridiculous. I'd rather my son experience other things after school than more coursework when he's school age.", "target": "positive"}
{"text": "Not just where youre involved in the story. Is there a movie out there where you are the main character, and its made like you are seeing the events out of your own eyes, like you would look down and see your own hands or something? Where the whole thing is from your point of view.", "target": "negative"}
{"text": "Im looking for something that works like the OG iTunes. I would like to organize my music on my computer and then sync my music to my phone. I dont want to use any sort of streaming service since I have already bought all my digital music over the years. I know there are apps for android like Samsung music but these lack the ability to organize and sync from a computer.", "target": "positive"}
{"text": "I'm looking for a completely free software that could capture live audio from a webpage and translate it in real time into text. Nothing fancy, simple GUI and easy to use (I don't want to code anything, you should click on an exe and that's it). It should run in Windows, it has to be software for a desktop PC, not a cell phone app.", "target": "positive"}
{"text": "Like a mini washing machine for clothes but similar to a spin mop bucket. I couldn't find one. I found mini washers and they're all under 5 gallons and flimsy but expensive considering they're so flimsy. I'm kinda surprised I couldn't find this. I'm also surprised there's no mini washers that are like 5 gallons. That's small enough to make it portable but maybe big enough to do more than the flimsy 2 gallon ones I'm seeing for 50-150. I know about the plunger thing. That and some weird little plastic thing you stick in your sink are the only things I can find at all that are made to agitate laundry without a machine.", "target": "positive"}
{"text": "You know that thing handymen unroll and it's got all their tools right there https://www.ridemore.fi/images/products/travel-tool-wrap-with-tools-1000x_orig.jpg Does that exist, but as a USB cable organizer?", "target": "positive"}
{"text": "Our car, which I share with my wife, is new enough that it has Bluetooth to connect to the audio system, steering wheel controls, etc. but old enough that it only allows a single device to be stored in its memory. It's impractical to delete and store a new device every time we swap over between the two of us so our solution has been that my wife has the Bluetooth slot while I have a Bluetooth adapter that transmits to an FM channel that I use when I am driving. This is a suboptimal solution because the audio quality is bad, there is regularly interference from random radio stations on long journeys, and I can't use the steering wheel controls to answer calls, change tracks, etc. What I am looking for is a Bluetooth bridge device. Something that stays connected to the car, and which we both can pair to easily. Something that would relay the audio from our phone to the car and signals from the steering wheel controls to our phones. But it seems like a really niche thing. Do you think it might exist? Looking around I can find plenty of Bluetooth FM transmitter devices, or devices that operate either on TX or RX mode, but nothing that fills this two way passthrough function that I want. I should add that I'm not looking to have both our phones connected at the same time necessarily. Just something that is easy to pair with. It may be that we could find something that we can both connect to and then easily flip between which device is connected to the car, a bit like an HDMI switch. Any ideas?", "target": "positive"}
{"text": "I'm in the UK. I'm looking for something I can use to turn a bedroom light on to help me wake up. There are lots of lots of plug in timers but a lot of them seem like they'd be complicated to use - I'd be able read the instructions and use them while I remember but then I'd forget, and having to keep the instructions around and re-read them repeatedly would get really annoying. I think I may not great at learning things like that, and also a lot of products are just badly designed and cheaply made. Something like this would be pretty much perfect: https://www.tradesparky.com/heating-and-ventilation/hvac-controls/programmers-and-timers/timeguard-ts800n-time-controllr-24hr# - it uses an electromechanical mechanical timer and pins in holes to tell the mechanism when to turn off or on. I particularly like that there's no \"hidden state\" - if you want to know how the device is set you just have to look at it, you don't have to press buttons or anything to find out what settings are stored on internal memory. But as its mechanical I expect it will be audible, which I don't really want next to my bed. (I don't mind an audible sound when it turns the power on and off, I just don't want a constant noise) I also want the feature that you can turn the power on or off with the switch on the bottom left corner and it doesn't change any permanent setting - the timer continues to work and sets the output to what its programmed for at the next pin position. Effectively for each time position in the circle there are three options - turn power on, turn power off, and maintain current state. Lots of other alternatives have little switches instead of pins but those all seem to only have two positions available, on and off, instead of the three that I want. Something like this https://www.argos.co.uk/product/9822911?clickPR=plp:2:3 looks like it will be too hard to use. I see one reviewer wrote \" It was initially a bit complicated to set up but once I got the hang of it, it was no problem at all \" and I fear I would get the hang of it and then forget and have to go through the process of learning multiple times, which means keeping the manual around, especially since the buttons don't have full words on them. I have no idea what \"CD\" means in that context. Another reviewer said \" I managed to throw away the instructions before programming these and have found it impossible to do so despite looking at you tube etc. \" It also clearly has lots of hidden state, so I wouldn't be able to make a habit of glancing at it to check what time its set to go on in the morning before I sleep. I think my ideal would be something like the one I linked at tradesparky, except instead of an electromechanical clock and rotating rings it would have a silent electronic clock, either with hands or an LCD display to show the time, and a microprocessor programmed so that every 15 minutes it checks whether there's a pin in the relevant hole and turns the power on, off, or maintains the set position as appropriate. The current on/off position should be visible, ideally also feel-able like in the one I linked but it could be a display on the LCD with a button to flip it. Options to stay permanently on or off are probably unnecessary, since I can make the device always off using the switch on the device, and I can make it always on by plugging it in to a different socket.", "target": "positive"}
{"text": "Can you buy foil that is like the foil on cream cheese? It's flexible and rebendable.", "target": "negative"}
{"text": "I have a really hard time waking up, like will turn off the alarm in my sleep, wake up exhausted, tried every app hard. Does anything like the title exist?", "target": "positive"}
{"text": "I'm looking for a 360 protractor that is in a shape of a ring, not 2 half circles joined together.", "target": "negative"}
{"text": "Hello! I'm looking to see if there's a website where you can collaborate with multiple peiple on something online like aggie.io but for music !", "target": "positive"}
{"text": "Is there any high fantasy rpg game where you can make a bunch of decisions that impact the story, that let you make a bunch of builds like dnd and let you play multiple characters at once?", "target": "positive"}
{"text": "So I'm into this oddly specific thing.. elongation of genitalia specifically, and I'm wondering if there's media involving that specifically? I know there's tons of media with elongation, but usually of arms and legs and stuff, im wondering if there's anything out there with parts elongated to unnatural lengths but like.. genitals specifically, I tried to use Google search AND talked to a chatbot (it's slim but there is always a small chance they'll give an answer with something real) and didn't find any useful results, maybe I didn't dig deep enough but.. well, reddit has never failed me yet so here I am, desperately seeking to see if this is a thing (it's fine if not I just need a damn answer) And just know I will settle for ANYTHING if it involves that (preferably no live action is my only preference, but as said, I WILL settle for anything at this point)", "target": "positive"}
{"text": "Hear me out, theres some wild subreddits for things like selling media of all kinds of things (both sfw/nsfw). Theres also a few subreddits where people who need a parent for a moment. I know Facebook has something similar but is there a subreddit where you share a post as to why you need financial assistance and (often but not always) rich folks with disposable income will look over different causes and donate pity money to people who need it? Like a go fund me or crowdfunding subreddit that donations go directly to the person?", "target": "positive"}
{"text": "From a fashion standpoint, it would look like a nice analog watch, but inside are some smart elements that allows it to track your steps, heart rate, and sleep cycles, and then send that data to your phone.", "target": "positive"}
{"text": "I'm looking for something with a hair trigger and not smart phone based. 2 \"things\" that just beep immediately when more than 5 feet apart. They're only paired to each other and nothing else, and the key feature is the immediacy of their reaction to being separated. You might describe this as a \"wireless tether\". All of the the trackers and tag systems seem to be built around bluetooth and phone apps as the anchor. They're more geared towards finding something after it's allowed to separate in the first place; they don't immediately notify you within seconds of separation from the phone. I'm wondering if this exists, but perhaps built for a different purpose than what I intend (put one on a phone and one on a wallet)? Maybe an industrial solution exists?", "target": "positive"}
{"text": "I'm looking for a drinking cup not cooking type of measuring cup but with ounce measurements on the inside of the cup only. It has to be solid and not see through. So you can measure and drink liquid out of the same cup without anyone knowing.", "target": "positive"}
{"text": "I did a light Google search and didn't find what I was looking for so I'm asking here. Dishware like bowls, small plates, large plates, but with an enclosed kitchen scale that can track how much food is in or on this dish and then how much was consumed. I'm monitoring calories right now for weight loss and health related reasons, and I'm finding it really frustrating to have to spend a lot of time guesstimating the exact calories consumed from a meal when I inevitably am unable to finish the meal. I know I could use a standard kitchen scale but I find eating off of one to be kind of annoying and if I weigh my food, remove it to eat it and the try and weigh it after the scale has timed out. I know I can also just write all the measurements down but why do extra work when a simpler solution could exist. My picture of this in my mind would be like a plastic bowl shaped shell with a scale in the base of the bowl, with either a screen on the side of the bowl to display weight or an app that can link to it to track the measurements. I dont think it would need to be dishwasher safe and likely wouldn't be microwave safe. It could come in a few different sizes and potentially in different dishware styles as mentioned before like plates and cups. Does this exist?", "target": "positive"}
{"text": "Im wondering if this thing I remember playing once really exists. I swear I remember a long time ago playing this game of my favorite show as a kid, call Blaze and the monster machines I think, and it was in the style of subway surfers, but it was before subway surfers came out in pretty sure. If you guys can figure it out, then thanks! But if not, it was probably a dream lol", "target": "negative"}
{"text": "Has anyone created an app or website that would allow you to create an account, connect with friends, upload a list of the books you own, and see your friends' books. You could search for a book you want to read, see who in your community has it, ask to borrow it, and track through the app who you've lent books to and whose books you have borrowed. Basically a library for friends groups or communities who want to connect and share books.", "target": "positive"}
{"text": "Basically I was watching a tier zoo video and I thought is like this fictional game of life their talking about kinda exist??? Like is there a online game where you can play as a bunch of different animals like squids insects that kinda stuff and it works like real life and every player is like an online thing like doe stgat exist something like that at least? Like it seems so fun", "target": "negative"}
{"text": "I'm looking for women's underwear OR women's boxers that are: -100% cotton -NOT high-waisted -if underwear, 100% seamless -if boxers, anti camel toe", "target": "negative"}
{"text": "In my experience, wallpaper websites tend to be sketchy and filled with poorly upscaled or downscaled images. AI images are everywhere these days too, and it wouldn't surprise me if these sites were filled with them. I'm wondering if there's a high quality wallpaper site that isn't filled with scaled images or AI junk. EDIT: I'm not here to debate the merits of AI image generation. If you're here to promote it, go away.", "target": "positive"}
{"text": "They're impossible to moderate and will no longer be allowed what so ever. Any post or comment in this sub not from either app store or a few common image hosting sites (ie, imgur, reddit, twimg/twitter) are automatically removed. Certain domains that are frequently spammed here are marked for either spam or banning of accounts (I won't list these domains for obvious reasons).", "target": "negative"}
{"text": "M19), Im having a PWA developed for this idea I have, the developer quoted me 20k, broken up into 4 payments of 5k, 5k for each deliverable, started exactly a month ago today, and the progress so far is the UI & UX almost done, but still has revisions in the works, is this very little work & progress for the first 5k payed or is this pretty normal pace and arrangement?", "target": "positive"}
{"text": "Im looking to create community and wonder what is better element, discord or what up app?", "target": "negative"}
{"text": "Hi, I want to make AI app like other. Most people earn millions by building AI apps but I don't know why users pay them and not use GPT for free?", "target": "negative"}
{"text": "Is there people who use Cal AI and why do you do thatz there is gpt.", "target": "negative"}
{"text": "Hey everyone  Ive been working on a little side project called Loopday . Its basically a focus + habit tracker that leans heavily on widgets . You get a clean heatmap of how many minutes you studied each day The widget shows your progress right on the homescreen (no need to open the app) Inside the app, you can run simple focus sessions without distractions Its still super early, but I just put it on TestFlight and Id love to get some honest feedback from you all. Also, Im looking for ideas on new widget designs and features. Would love to hear what kind of widgets youd find useful.  Heres the TestFlight link Thanks in advance!", "target": "positive"}
{"text": "Download app from Appstore for Free: https://apps.apple.com/app/id6744612926 Use Promo Code to unlock premium features BREATHEINNR or use the direct redemption link : https://apps.apple.com/redeem?ctx=offercodes&id=6744612926&code=BREATHEINNR", "target": "negative"}
{"text": "I need an app that solves any subject and any problem. Like Photomath but this only solves math problem. Is there any app that do this?", "target": "positive"}
{"text": "Hi everyone! Im working on a new app called Donut. The core idea:  You can create photos, short videos, and text posts.  Content is shared live via Bluetooth to nearby users, completely offline  no Wi-Fi, no cloud.  Likes, comments, and reactions are also synchronized offline when devices meet.  Posts can hop from device to device like a social virus. In short: Its like Instagram/TikTok offline, private and local for people around you. Im looking for feedback on:  How cool do you find the concept?  Would you use something like this?  Any suggestions to make it more fun or engaging? Thanks a lot for your opinions!", "target": "positive"}
{"text": "It is an intro to coding type of game that involved collecting fruit balls and feeding them to their respective monsters as payment for their specific task. It was quiet and had an overarching goal to find seeds and replant the environment. It was on my school computer and now theyve wiped it bc I changed schools. There were aliens/creatures were called diggers, movers, seekers, and a few others. I only reached the stage where you have to get your friend, another bipedal parsnip hat wearer, out of this blue force field. There is a rule where you cant get too far away from a body of water or you will collapse and have to start over the round. I cant for the life of me remember its name or what studio it was from. It had to be cheap bc my school had it. All searches have been to no avail so far. If anyone thinks this sounds familiar or knows another subreddit to post this to, PLEASE,PLEASE,PLEASE let me know. Im starting to think I created it as a powerful delusional coping mechanism.", "target": "positive"}
{"text": "What is a lesser known app we all should be using?", "target": "negative"}
{"text": "There are so many like Lovable, Replit, Base 44, Flutterflow. Can you guys speak about your experience using these and which one would be best if I want to create an app for Android or iOS? My app uses some graphics and calendar view.", "target": "positive"}
{"text": "Pyramid solitaire games like kings corner, Russian solitaire Chinese solitaire, so many I hadn't played them all more than once, it was free, it was on my old phone and now I don't see it in the play store", "target": "positive"}
{"text": "https://apps.apple.com/in/app/lockin-daily-track-time/id6743713321", "target": "negative"}
{"text": "As the title above says domains are so costly,not able to get .com domain.ai seems out of budget(i am broke) does .io or .in be a problem from any aspect like target market,seo,aso for in app thing. first time builder can anyone help here", "target": "positive"}
{"text": "Meu spotify premium web no roda nenhuma msica: coloco a playlist para rodar e o site comea a pular todas as msicas at chegar em uma e tocar apenas 10 segundos dela. O que pode estar acontecendo?", "target": "positive"}
{"text": "Im a college student and solo founder who recently launched Revast , an AI-powered app aimed at simplifying how students and lifelong learners study. The app lets users upload PDFs, PowerPoint presentations, or link YouTube videos, and instantly transforms them into organized notes, flashcards, quizzes, and summaries. Weve also integrated an AI Chat feature that allows users to ask questions and get instant help based on their study materials. Creating Revast has been a challenging but incredibly rewarding 1.5-month journey. Balancing schoolwork and building the app meant many late nights debugging and refining features. The most important lesson Ive learned is focusing on simplicitybuilding something that solves real pain points without overwhelming users. Right now, Im eager to hear from this community on a few things: What features would make you use a study app like this daily? Any UX/UI tips to make learning smoother and more engaging? Have you faced hurdles building apps on your own? How did you overcome them? Suggestions for growth or marketing focused specifically on student users? Building an app that genuinely helps learners is my mission, and Id love your insights to make it better. Thanks for reading!", "target": "positive"}
{"text": "Hey yall, made this app so you can follow your friends and see what their fave orders are- so you could not text them \"what do you want from ___\" and just know and pick it up. -- would love any feedback and you can search myordr on the app store- thanks! https://preview.redd.it/r3mqxe6qsskf1.png?width=710&format=png&auto=webp&s=374c31817aa61128d893d445fd1b1c571e5b20ff", "target": "positive"}
{"text": "IT'S a sex activity and sex partner management app. IF you like it please give me", "target": "negative"}
{"text": "I know you can usually save and organize posts in the app itself but I use multiple social media platforms and my favorites are saved across different apps e.g YouTube, TikTok, X and LinkedIn. Is there an app where I can save and organize all these posts in one place?", "target": "positive"}
{"text": "Mabye using tiktok interface for scrolling to learn", "target": "negative"}
{"text": "Hey folks  Im thrilled to share JigSwap  Photo Puzzles , my newest game for anyone who loves puzzles and beautiful imagery.  Over 1,000 stunning HD puzzles across themes like nature, art, travel, animals... No timers or gimmicks just pure, peaceful puzzling fun Works offline , so you can relax your mind anywhereeven when youre offline Difficulty levels from easy to legendary; plus helpful hints, smart saving Let me know what you thinkbugs, feature ideas, anything at all. Enjoy the calm!", "target": "negative"}
{"text": "Hey everyone, I just finished building an app called HUE and Id love for you to check it out! What is it? HUE is a dating & friendship app built around culture. Instead of swiping endlessly on people with no context, HUE helps you meet, date, and make friends with others who share (or are curious about) your cultural background. You can connect with people from 20+ different ethnicities, explore prompts that highlight identity & interests, and join group chats to build real communities. Why did I build this? As a Nigerian American in the diaspora, Ive always loved Nigerian culture - Afrobeats, Nollywood, and everything in between - but I realized I didnt have a big enough community around me to share that love with. That gap inspired me to create HUE. I wanted a space where people could celebrate who they are, meet others who share their interests, and form relationships rooted in authenticity. Why HUE is different: Culture-first profiles (show who you are & where youre from) Meet people for friendship, dating, or networking Group chats to easily form communities with the people youve connected with Built-in icebreakers so conversations flow naturally Download link (iOS):  HUE on the App Store This is still early, so any feedback is super appreciated. If this sounds like something youd use, please give it a try - and if youve got feature ideas, Id love to hear them. Thanks for reading  https://preview.redd.it/hpillu4pyrkf1.png?width=1290&format=png&auto=webp&s=37fb0f269d978c446270426bce15275570b00cf6 https://preview.redd.it/d8ruhy4pyrkf1.png?width=1290&format=png&auto=webp&s=2a3c6e3d6e00e1dae6b03c9e649ae242405835dc https://preview.redd.it/241fou4pyrkf1.png?width=1290&format=png&auto=webp&s=a5c94b3de933ef6a87ccf31c90fc62190c74e795 https://preview.redd.it/0fcasu4pyrkf1.png?width=1290&format=png&auto=webp&s=5fc0742513be67529944417f839118280a360923", "target": "negative"}
{"text": "Hey Reddit! I just released Mindcast  Self-Talk Journal , an app that helps you understand yourself better through the power of voice journaling. Instead of typing, you just speak your thoughts  the app instantly transcribes, analyzes your mood, and organizes everything for clarity and growth.  Key features:  Voice journaling & transcription  Speak your mind, let the app write it down  Mood analysis  Detect emotional tone and patterns from your words  Categories & tags  Organize your thoughts with ease  Mood charts & insights  Track emotional trends over time  Milestone tracker  Celebrate growth and progress  Export audio  Turn multiple entries into podcast-like episodes Mindcast is built for people who want to self-reflect, track emotional well-being, and grow without the hassle of complicated journaling apps. What Id love from you: Feedback on the design and usability Suggestions for features or improvements General thoughts on voice-first journaling  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Actually working on translation, soon app will have 10 additional languages. Would love to hear your feedback, bug reports, or ideas  and if you try it out, let me know how voice journaling feels compared to traditional journaling!", "target": "positive"}
{"text": "This post welcomes and is dedicated to: Your business successes Small business anecdotes Lessons learned Unfortunate events Unofficial AMAs Links to outstanding educational materials (with explanations and/or an extract of the content) In this post, share your small business experience, successes, failures, AMAs, and lessons learned. Week of December 9, 2019 /r/smallbusiness is one of a very few subs where people can ask questions about operating their small business. To let that happen the main sub is dedicated to answering questions about subscriber's own small businesses. Many people also want to talk about things which are not specific questions about their own business. We don't want to disappoint those subscribers and provide this post as a place to share that content without overwhelming specific and often less popular simple questions. This isn't a license to spam the thread. Business promotion and free giveaways are welcome only in the Promote Your Business thread. Thinly-veiled website or video promoting posts will be removed as blogspam. Discussion of this policy and the purpose of the sub is welcome at https://www.reddit.com/r/smallbusiness/comments/ana6hg/psa_welcome_to_rsmallbusiness_we_are_dedicated_to/", "target": "negative"}
{"text": "Post business promotion messages here including special offers especially if you cater to small business. Be considerate. Make your message concise. Note: To prevent your messages from being flagged by the autofilter, don't use shortened URLs.", "target": "negative"}
{"text": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well. Now with all this talk of a 25% tariff on furniture imports, Im just exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I dont even know how to answer them. What makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported. Instead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin. This could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me?", "target": "positive"}
{"text": "So I just landed an exciting contract with a local gift shop and wanted to create a custom bundle, one that includes a handmade candle by myself paired with a toy bus. I am going to tie both together with a nice ribbon so it looks like a nice gift set. The gift shop told me it would better if I source the toy buses myself. So I am a little lost and wanted advice on how to procure something that is not cheap or flimsy. I want something that feels more like a gift and not a party favor, so what are somethings I should look out for in regards to paint, size, and finish? Have any of you created bundled candle gift with non-candle items and have a specific vendor or site where you can order these items at a reasonable price. I was thinking of Alibaba, because I ordered a bunch of candle making supplies from there. Any other sites that I can use to order wholesale toy buses from? Should I prefer die-cast metal over plastic or is plastic okay if its good quality. Are there certain types of paints or coating that may be more likely to chip or smell that I should avoid? I don't want them to look like dollar-store junk.", "target": "positive"}
{"text": "Hi everyone, Ill keep this short: I see a lot of fast money hype online, but Im more interested in what actually brings lasting success as an IT expert. Right now Im experimenting with automation workflows, and while it works to some degree, I also see how hype can destroy real opportunities when everyone suddenly jumps on the same trend. So my question is: Where do you think its truly worth investing time and energy in IT right now? What areas or skills do you see as a good long-term investment that will still matter in 510 years? Id love to hear your perspectives.", "target": "positive"}
{"text": "Hey everyone, I run a small family business (appliance repair in California) and Im struggling with a customer who keeps editing her review about us. The problem is her review is just not true. She claimed we charged her $250, when in reality it was $95 (I have the invoice). We did the full repair, her appliance is working, and then we even gave her a full refund. So basically, she got the repair for free. But in her review she forgets to mention that part. I tried replying publicly with the facts, but she keeps editing her review in a way that still makes us look bad. And after checking her review history, its obvious this is a pattern  she leaves bad reviews for lots of businesses, even for places she hasnt actually been. She even left a negative review for a restaurant next door, just because she doesnt like the owner personally. It feels less like feedback and more like someone who just enjoys damaging other peoples reputations. So Im wondering: -Have any of you dealt with people like this? -Can I even get a review like this removed if its clearly false? -At what point is it worth talking to a lawyer about defamation? Running a small business is stressful enough without people like this trying to tank your reputation for no reason. Would love to hear how others have handled it.", "target": "positive"}
{"text": "Hey guys, Im in my 30s and honestly just trying to start over. I dont really have much right now. No siblings, no financial safety net, just my senior mom and my dogs. My long-term relationship also just ended, so it feels like a big reset in life. Ive always liked business and want to start again. I dont have much money, so Im thinking of starting small while keeping my job on the side. For anyone whos been in a similar place, what are some small business ideas or tips for starting on a really low budget?", "target": "positive"}
{"text": "idk if anyone else noticed but polished content feels sooo fake now. e very brand ad looks like the same ai filter or stock template. but lately i find myself stopping on like blurry pics, messy vids, stuff that clearly wasnt staged. it actually feels more real. so maybe the future is unpolished? like bad photos, awkward angles, grainy phone vids could that actually be the new good? curious if anyone else feels this or if im just going nuts scrolling too much lol", "target": "positive"}
{"text": "Thanks for reading. I'll try to keep it short. My family has a small tire shop / auto repair business. It used to have multiple locations all over our city. It now only has two locations. My uncle (68yo) is pressuring my Dad (71yo) to retire and sell his location. My Dad is now pressuring me to find partners and buy his Tire Store / Repair Shop. He hasn't given me a number but I am guessing about 1.1 Million. He seems to think that me and my friends/partners should easily be able to come up with a loan to purchase it. He hasn't been managing it too closely the last couple years and it takes in about 5k-9k or more in revenue a day ( this is based off anecdotal evidence when I was doing the deposit at the end of the day last year). I am currently employed as a teacher (probably one of the few with a State Inspection and Emission license) and finally reached the top of my pay scale (about 110k a year). The only debt I have is about 50k left on my home and about 40k left on my wife's student loans. I (43yo) have worked here continuously since I was 15. Even being a teacher for the last 20 years I came in after school and have run the counter, changed tires, done inspections and light maintenance. I am mostly terrified of having to pay for auto maintenance that I can't do in my drive way. Does anyone think that if I got at least one if not two partners we could secure a small business loan? Might there be another way to finance this? Thanks, I am clueless. Addendum: My Dad and uncle are on the outs. He has been told he can retire and collect a paycheck but he is not welcome in his store. So my dad is kind of hoping I can buy his location so he can have both the money and the location to have his car and tires serviced.", "target": "positive"}
{"text": "Feels like everyone I know is pushing their biz on Instagram or TT and kinda ignoring their websites. Some even say why bother if 90% of customers come from socials anyway... Do you think having a proper website still matters for small businesses? Or is social media + a linktree good enough in 2025?", "target": "positive"}
{"text": "I have physical niche store. 90% of my customers know find and purchase the same products online. The benefit I provide is that they can see and experience it in person before buying. For that experience I charge $10-$15 more. It's the only way I can make a profit. Instead I am thinking to lower my prices to capture a large amount of orders from my customers and make them repeat customers. I can either lower my pricing to be $5 within the Amazon or online pricing. Or I can incentivize by creating Buy 1 Get X % off offers. Is there a recommended sales strategy for pricing based on psychology of purchasing?", "target": "positive"}
{"text": "I run a small catering business, and lately its been picking up more than I expected. Between invoices, supplier payments, and tracking deposits from events, Im realizing my spreadsheets are getting messy and Im probably missing things. For those of you whove been here when did you decide it was time to hand off the books to someone else, and how did you find the right help? Did you go with a local bookkeeper, an online service, or just keep pushing through until revenue got bigger?", "target": "positive"}
{"text": "I (22) currently have a small videography business, just me and my own equipment & software working on videos for local businesses/organizations/etc. This isnt a full time gig since Im not busy enough with it to be working every day and my main job is being a freelance part-time production assistant for a corporate news entity. Im applying for other positions elsewhere but Im not sure what to put as my job description for the business I started. I know president indicates that I have employees so I wont be using that, would owner/operator be my best bet? TIA!", "target": "positive"}
{"text": "im a 2d illustrator with not many pieces in my portfolio but the ones that are there are incredibly whimsical detailed very character design oriented i wanna know what can i do? i want to polish up my art and create a portfolio and then should i use that art for stickers prints keychains and small things like that? i also want to start a clothing business but idk if it should be street wear (i dont wear it) or semi formal boutique type clothes (i wear this) which i can design. im also considering tote bags but like jeans or courdroy type of cloth. argh so many ideas so little time", "target": "positive"}
{"text": "Lately Ive been realizing that one of the hardest parts of running a small but growing business isnt the sales or the bookkeeping its the emails. When I first started, I could get by replying to everything myself; late at night, on my phone, in between tasks. But now that things are picking up, the inbox is constantly filling with customer questions, supplier updates, and even staff stuff. The problem is, every email feels like a mini mental workout. I catch myself rewriting the same message five times just to make sure it doesnt sound curt, unprofessional, or worse, like Im annoyed. Half the time I sit there staring at the screen, knowing I should move on to bigger tasks, but feeling guilty if I dont answer right away. Curious how others here handle this: * Do you personally write every email, or have you found ways to streamline it? * Do you rely on canned templates, an assistant, or just sheer willpower? * Do you block out time for email, or reply as things come in? Feels like one of those invisible drains on energy that nobody talks about, but adds up fast. How are you all managing the inbox without it taking over your day?", "target": "positive"}
{"text": "so ive done a lot of research after the fact that i signed up and paid for zenbusiness but is it worth it and will it help my business or should i switch elsewhere? should i terminate it? any suggestions are helpful, so thanks in advance  pls b nice in the comments lol", "target": "positive"}
{"text": "We wear ten hats. What worked for me: tiny wins  auto-responses for FAQs, batching content with GPT, and simple Make/Zapier flows to sync CRM + email. I put the methods into Athenero for solo owners who are not tech people. No link unless mods allow  happy to share examples/checklists. Whats the most repetitive process in your shop right now?", "target": "positive"}
{"text": "for those of you running a small business, how do you actually keep track of what your competitors are doing? do you have some kind of system, or is it more like random google alerts and stumbling across their updates by accident? feels like every time a competitor changes pricing, launches a new product, or announces something big, i only notice weeks later. curious if other smb owners actively track this stuff or if most just focus on their own thing until it becomes a direct threat.", "target": "positive"}
{"text": "Anyone need of Shared server or VPS. DM me. I will provide low cost Shared Server at 2000/- annually with 1 cpanel and 5 mail with unlimited bandwidth. We will provide free migration. If you can provide 10 leads I will provide you free Server..", "target": "positive"}
{"text": "Running a consulting team and wish to work with founders at early stage startups to help them launch/raise funds/grow. A mutually beneficial collaboration, would love to hear more from founders who have a solid plan and are in pre-seed, seed or series A stage. Strategy, consulting, marketing, execution, would love to hear and discuss more on this.", "target": "positive"}
{"text": "Hi - i just attended the vegas magic fashion tradeshow. I may want to exhibit in february as a brand selling sunglasses. It was great but i got some intel it has slowed down. Are retailers really placing orders? Also, I met with the boutique hub about selling on their platform. Any other vendors feel its worth it? Thanks!", "target": "negative"}
{"text": "Im launching my own small healthcare practice (solo telehealth) and could use some perspective from other business owners. Ive handled most of the basics (LLC setup, business licenses, insurance credentialing, website, and initial marketing). Im now considering hiring a support service that offers one monthly meeting + unlimited email questions to help me navigate practice management. No contract, just month-to-month. Its healthcare-specific (Duet NP), but I imagine many industries have similar services. My questions are: If you used something like this for your small healthcare business? Was it worth the investment for ongoing support, or do you feel ad hoc consulting/resources were enough? Any red flags youd advise me to look for? Would love to hear how others balanced the costs vs benefits of this type of service.", "target": "positive"}
{"text": "I just turned 25 I have over half a million saved up because I started a business when I was 20 and it became semi successful my business is now faking and Im shutting it down , my goal was to have millions by 30 but now Im lost on what to do next . Someone recommended insurance brokerage business could I attain this goal from starting an insurance brokerage", "target": "positive"}
{"text": "I am the owner and am heavily involved. However I have a team of 4 that can virtually run everything without me (one in particular that operates as the COO). I mainly generate sales and am linked to the brand reputation. Our client base is mainly 5-10 customers annually given the high-end homes we build. How do I build on the value of the business? We have consistently strong revenue and EBITDA but we are very specialized doing a handful of high-end homes a year and reliant on myself landing clients. I worry that if I ever wanted to sell, the business valuation wouldnt be huge due to these reasons. Are there logical ways to expand? Do investors or private equity firms buy businesses like mine? How can I ensure valuation of the business brand beyond assets? I want to ensure I have a good exit and target as the business evolves.", "target": "positive"}
{"text": "As of Friday I'm in discussions to buy a local repair shop. The purchase will be the assets under a new LLC that I have yet to form. I have an experienced CPA in my family that will review and I am currently seeking a transaction lawyer and bank. The owner has repeatedly told his acquaintances in front of me that I am the one buying the shop and has expressed to me various other parties have been very interested including an offer over his asking price and stated he informed them I was already \"the buyer\". There are a few problems so far, one being my inexperience. The other is the seller is a boomer and is sort of handwaving the whole thing in the most literal \"I know what I got\" sense. To wit the only numbers I have are a profit and loss statement from 2023 and 2024. I've requested the to date 2025 p&l plus balance sheets from the same years and tax statements from 2022-2024 and gotten no response (not unreasonable as it is the weekend over which all of this has occurred). In addition I've asked for an asset list but instead got walked around the shop, told of a few issues, shown the on-hand inventory room and had it handwaved as \"all this\". It's a viable business doing poorly but on top of my agenda is a true asset list because I have to know what I'm buying. I mean there are literally no details, such as is there a shop owned vehicle? Is the wall art included? I mean there is literally no way to value the assets without knowing what they are. At the very least it seems like I'd need this information for the bank as I intend for the assets to be the collateral under the LLC. There are many other open boxes on my checklist such as key employee retention and ensuring the landlord is going to honor the existing lease, and the actual lease details which I have yet to even get verbal details save the dollar amount. US state, \"at-will\" employment. When I mentioned reviewing a purchase agreement contract he seemed like that is something I would be providing, which to me was just insanely weird. As far a a training period, as I have no experience in this industry, he has repeatedly stated that he is just going to stay on and keep doing the exact same things. That's a whole other issue as I intend to change everything and not just be some wallflower intern holding the bag while he continues to pretend he owns the business. Just a red flag for later, I don't intend to press the point until we have a contract which I believe should include his ongoing involvement. I'm convinced he would void the whole transaction if he knew I planned to change anything if not everything. In addition I am recalcitrant to share my ideas for improvement before obtaining ownership. In the most mundane sense it seems like he would expect the aforementioned wall art to remain, but also himself remain in ownership of it. At leat that's my impression, and I don't want to test that this early in the process. I mean this to be an anchor post for what I assume are many, many questions during the process as I have never owned a business. I feel like I'm buying a truck from this guy and he doesn't want me to look under the hood. I expect it's bad based on the P&L but how bad and is it fixable are outstanding questions. The biggest sticking point I have right now is the lack of financial documentation and the asset list. The few most pressing questions are: What do I look for in a bank or credit union, or is there a service that will shop around for my loan? Apart from business loan is there any type I should be seeking (analogous to 30 year home mortgage)? What will they likely want apart from my information? Realistically what kind of timeline should I expect, assuming the financials are provided, from setup of the LLC to loan application to legal issues?", "target": "positive"}
{"text": "I live north west of Baltimore and am looking for an accountant who could help with both my small business taxes and personal. I've worked with another firm that I've felt underwhelmed with in regards to personal taxes so I am looking to explore my options. If you could also post how much these firms charge for filing that would be awesome Thanks in advance", "target": "negative"}
{"text": "READ FIRST: I'm not hiring an email marketer. I'm doing research. As a small business owner, what's stopping you from hiring an email marketer to help you build an email list, manage it, grow it, write emails, and set up sequences for it for you? Share your genuine answer or any past experience. Thanks in advance,", "target": "negative"}
{"text": "For all career related questions - how to get into product management, resume review requests, interview help, etc.", "target": "negative"}
{"text": "Share your frustrations and get support/feedback. You are not alone!", "target": "negative"}
{"text": "Question: You're a PM at Trader Joe's. We've been losing revenue to a new entrant, which is a meal delivery service like Blue Apron / Hello Fresh. How would you counter this competitive threat? I had a really hard time with this, because I kept gravitating towards segmenting by the reason the user would have left Trader Joe's in favor of meal delivery (eg convenience, no car, urban dweller, etc.), but that meant jumping to the problems section prematurely and really limiting myself once I got there. How would you approach this?", "target": "positive"}
{"text": "Large Tech company involved in B2B software development. Due to a hiring freeze at my company and an immediate requirement for BAs/Proxy POs, I had to recruit 3 folks without product management experience. They are essentially from the business development side of our org and have good PM and communication skills (reason why I was okay with them). I have personally trained them on Agile, Scrum and Product Management over a series of 9 x 1-hr sessions focusing on the fundamental concepts and specific practical knowledge about product management practices with this client. I am wondering what resources I can share with them that focuses less on processes and tools and more on experiential learnings specifically in a B2B environment and in T&M projects where we dont really own the scope.", "target": "positive"}
{"text": "I've been at my current PM role for a few years now and have the opportunity to accept an APM offer. Current role has been ok but I'm tired of it The offer is not exactly FAANG or even F100, but it's an F500 software company with global presence. I'm less worried about title and comp but want to make sure I don't screw myself due to it being an employer's market", "target": "negative"}
{"text": "I have been a high performer for a product area. The other product manager (went to another org) under the same manager of mine has left, my Dir of Product has asked me to take over this person's product area and engineering team but asked me to hand over my area to a current Associate PM as his promotion. I was been told the new product area and squad is a good team. Two weeks after taking over the area, I found that things were buried under the rug like 1)features done but never released to production for 1/2 year. 2) initiative spanned 3 quarters never had MVP defined and kept getting delayed.", "target": "positive"}
{"text": "I keep seeing people compare Al to the dot-com bubble, and I don't think that's the right analogy. The dot-com bubble was due to companies not having any real revenue model that worked. Eventually we figured it out. But Al is actually being adopted and there are real productivity gains. If anything, Al looks more like the early cloud days. At first, the cloud was pitched as cheaper, but once everyone was hooked, the bills exploded and it became a permanent line item. Even Elon Musk had X/Twitter ditch parts of the cloud to save money. claiming 60% lower storage costs and $100M a year in savings by moving back to servers. Eventually these Al companies will have to make serious returns and jack up the price. Don't get fooled by the current price and know that this will not last forever.", "target": "positive"}
{"text": "Here's my experience: Dev Lead was always talking down any suggestions I make, I involve devs early as it gives shared ownership and quick buy-in, and when i tried asking their opinion during discovery on inputs we have about a potential feature, here's what i got from dev \"This is something you should tell not us\", which technically is true but i think it set a tone in the room and didn't know how to handle it; i knew if i said something in the moment it would end up becoming bigger than what it should be; I stopped asking open ended questions for sure and stopped involving dev in discovery as they felt that its waste of time and although i tried to tell benefits in retrospective meeting, nothing worked how would you handle such situations? i tried looking up web and tired of bookish answers, not just this scenario but how to handle such situations say with stakeholders and others?", "target": "positive"}
{"text": "Hey fellow PMs!  Working on understanding real CRO workflows. Quick questions: How much time per week** do you spend brainstorming/researching A/B test ideas? How many tests** do you typically launch per month? Where do you get your test ideas?** Analytics deep dives? User feedback? Competitor research? Team brainstorming? Other sources? What's your biggest bottleneck** for launching more tests? Coming up with ideas? Getting dev resources? Analysis paralysis? Tool limitations? No sales pitch ( yet.. WIP) - just trying to understand if there's a real gap between \"knowing we should test more\" and actually doing it. Thanks!  *Feel free to DM if you prefer !", "target": "positive"}
{"text": "There's research and anecdotal data saying that the use of LLMs like ChatGPT is making you think less, like written here - Is ChatGPT really making us dumb and lazy? . I'm a heavy AI-x/y/z products user (ChatGPT, Perplexity, Loavble, Gemini, V) and use it for almost everything. I've noticed recently that something changed for me in the past year, I've been \"seeing things\" differently, in a more systemic and \"1st principals\" types of ways, helping me cut through the noise in my day-to-day corporate PM job.. and my hypothesis is that these tools helped (substantially) with it. On one hand, they help a lot, on the other, they do a lot of garbage-in garbage-out, and I'm hyper-sensitive to people thinking I did a poor job at something, making me really think with the perspective of someone reading the output and is objecting to it and thinking it's trash/written by AI - and it makes me very aware at whether the output of the LLM is true and makes sense, forcing me to see the deltas between my thinking and the output in a very nuanced way, so I add context and repeat it again and again. At the end, I spend more time on refinement with AI compared to just writing it. But when I'm done with the refinement, I feel like I have a very good sense of what I want to do, and especially what led me to it (tracing it back to the source, the ground truth). So, it's not all bad, at least for me. Wonder if anyone else noticed it.. it's a bit unexpected since it does most of the \"heavy lifting\"", "target": "positive"}
{"text": "I'm a highly experienced technical project manager (digital transformation, cybersecurity, web product development) in the DC area looking to get formal product training, since my experience has been much more heavily weighted to the project side of things than product. I'd prefer fully online coursework, but I would also highly value the strength of the networking opportunities, since this is currently a weak point for me. Any insights on the pros / cons of the two options below would be greatly appreciated. Background: I have an undergraduate degree in cybersecurity, and will complete an MS in Cybersecurity Management & Policy soon. This is at an online school (UMGC), which does not have a strong alumni networking presence even here in the DMW. Certified Scrum Master, Advanced Certified Scrum Master, and I'll most likely have the PMP this year, but nothing specifically product-focused. Undergrad GPA is terrible, grad school GPA is 4.0 so far. I also have three cybersecurity certs in my pipeline for this year, but as with my degree, nothing product-specific. Option 1: UIUC's MS. Management or MBA. The MSM degree stacks into the MBA if I wanted to add that next year. Business degree from a strong engineering school, great global alumni network (they have alumni meetups here in DC, alumni are engaged and available to chat with prospective students, everyone I've talked to has repeatedly mention the value of mentorship, job referrals, etc). Has an opportunity for an annual in-person alumni networking event that everyone raves about, plus in-person project groups at US and international locations once or twice a year. This is a general-purpose management degree. The global exposure and networks are of interest me as much of my career has been international, and I'm extremely interested in working internationally again in the future. Option 2: University of Maryland's Product Management Master's. Also a great engineering school. Uncertain how engaged or active the alumni network is for referrals, but here in the DMV where the next several years of my career will be, UMD grads are absolutely everywhere. Very good local reputation. I'm also just outside campus and on their shuttle route, so it'd be really nice to be back in an academic environment again, have access to student groups, have spaces to work or work out, and just be more engaged and out of my house, even though the program itself is entirely online. The professor who founded the program did an in-depth career call with me, was extremely well-prepared, and is someone I'd love to have as a mentor or in my network. I've attended a couple of their alumni presentations as well, and they're impressive people. This is a much more focused degree specifically on product management. Thoughts? Which of these would you consider the better learning opportunity?", "target": "positive"}
{"text": "Quick sanity check from the CS trenches. Ive been living in health-score dashboards with a bunch of CSMs, and were deep in data but still getting blindsided by churn. The patterns that are too consistent - Validation grind, testing every potential churn trigger one-by-one is a month-long process to get right. - Context black hole: a 30% usage drop might mean champion left or the feature is fully automated. data never tells the story. - Scaling wall: The \"just talk to customers\" isnt a strategy past a certain number of accounts. All these make it incredibly challenging to give the product clear, actionable signals on what to focus on to prevent churn proactively. What signal has earned a spot on your roadmap and beat a shiny new feature in prioritization? How do you convince your leadership? Have my own thoughts from the CS side, but I'm here to learn yours first. What worked?", "target": "positive"}
{"text": "Hi All, As a product manager. You always have to keep learning. However, I always find myself reading lot of stuff but not able to retain them. I will forget articles or books days or after a month. I try keeping notes and flashcards but I find myself not visiting them again. I am curious to know how others retain stuff they read / learn.", "target": "positive"}
{"text": "I am in the early stages of developing a new product and recently reached out to a local design agency. They had a solid portfolio and seemed genuinely excited about the idea, but the quote they gave me was much higher than I expected. I have also tried going the freelancer route online before, but the experience was not great. Communication was patchy and the final design did not really match what I envisioned. Now I am exploring options like Product Innov, where the team can handle the whole process from design through prototyping. For anyone who has gone that route, did you find working with a dedicated product development team worth the cost compared to piecing it together with different contractors? Did you work locally so you could meet in person, or was remote collaboration just as effective?", "target": "positive"}
{"text": "I'm looking for some other opinions here about my post title. TLDR: Our engineering lead has been running PI planning each quarter, I (PM) manage bringing our product teams together during PI planning and create our main PM deliverables that the engineering team uses to create their plans for the quarter. Our engineering lead wants me to run it. Personally, I hate PI planning, partly because the things I manage are on a 9-12 month release cycle and quarterly rituals don't always have any impact/change.. Part of why I don't want to lead is I feel like I already do a lot of work during the process. I manage bringing the product groups together to capture and ensure we have detailed requirements where needed. This ends up being a 10-15 page word doc with links and resources that the engineers use for their part. Frankly, I don't want to have to manage everything. We are 100% remote and the process covers 2-3 weeks of hour long meetings so it is a drag and not just knocked out at once. When I have looked around about who fills this role, I saw the \"standard\" is that there's an engineer who focuses on facilitating collaboration across the groups. I'm curious if other PMs have been made to run the process or if its reasonable to push back and have someone else help out.", "target": "positive"}
{"text": "I just finished watching Lennys interview with the intercom CEO, Eoghan McGabe. Its a pretty insightful watch to hear about how a 14 year old company is transforming their product from a legacy to AI-first system. He was honest about the changes he felt needed to happen because it was existential, even though it was painful for all involved. One thing I learned was that he had returned to the company as CEO and now considers Intercom as founder-led (aka in founder mode). For PMs that are working or has worked at a company that are in founder mode, whats the experience like as a PM in that environment? Eoghan described Intercom went from gentle democracy to top down decision-making in this transition. Im curious whats that looks like in terms of the level of autonomy PMs get. https://youtu.be/0_opWSfmN8M?si=uDk8tdw95SLIN88c", "target": "negative"}
{"text": "Digital Twin is one of those product categories where the definition feels fuzzy. Some see it as visualization and monitoring, others push for AI-driven insights and optimization. If you were building or evaluating a product in this space, where would you put the emphasis? Accessibility and ease of adoption? Deep customization for specific industries? Or positioning around security, data ownership, and pricing model as the differentiators?", "target": "negative"}
{"text": "Company is less than 5 years old and has a team of two full time engineers that include the technical cofounder. Leadership has decided we need product management and Im leading the charge. I feel overwhelmed going through the backlog in jira trying to rate and scope feature requests while bugs just pour in. We have such limited technical resources that prioritization is so important. What frameworks should I be using? How far out is reasonable to plan? What should I be thinking about that Im not!? For further context, leadership all just agreed on what our ICP is about a month ago.", "target": "negative"}
{"text": "Can anyone help tutor me on making a Smartsheet fowllowin SLA practices? And help me understand Stan", "target": "positive"}
{"text": "There are a lot of people here working on projects of some sort - side projects, startups, podcasts, blogs, etc. If you've got something you'd like to show off or get feedback, this is the place to do it. Standards still need to remain high, so there are a few guidelines: Don't just drop a link in here. Give some context This should be some sort of creative product that would be of interest to a community that is focused on product management There should be some sort of free version of whatever it is for people to check out This is a tricky one, but I don't want it to be filled with a bunch of spam. If you have a blog or podcast, and also happen to do some coaching for a fee, you're probably okay. If all you want to do is drop a link to your coaching services, that's not alright", "target": "negative"}
{"text": "Hi, Im looking to learn more about Jiras ticketing system. Heard that keeping Jira aligned with the actual roadmap is a challenge; however, Im not sure how true this is. Some people claim they dont get the toxicity around Jira, while others are pulling their hair out. My question is: what is the problem with Jira? Is it that youre losing context that doesnt make it to Jira? (I dont have a product to pitchnot much came up that directly answered my question upon searching Reddit multiple times)", "target": "positive"}
{"text": "I think this sub believes Marty Cagan's views work in an ideal organisation where the CEO is bought in, and that there are people who are doing real product work but not posting about it on social media. But keeping those aside, what are your thoughts about these (or other) product managers and what they write/say/do? And who is the better of the lot? Marty Cagan, Aakash Gupta, John Cutler, Teresa Torres, Shreyas Doshi, Sachin Rekhi, Janna Bastow, Jason Fried, Julie Zhuo, Chloe Shih, Scott Belsky, Diego Granados, Melissa Perri, Mahesh Yadav, Hiten Shah, Ryan Hoover, etc", "target": "negative"}
{"text": "Weve been discussing this in our team recently and realized were not even sure how other companies handle it. Im not talking about the usual marketing emails or password resets, but the in-product notification emails  the ones triggered by real events in the product (process done, process failed, new comment, confirmation, etc.). Who in your company actually owns those?  Engineers?  Product managers?  Ops/Support?  Or no one really? And how are they usually managed? Do you have a proper workflow/tool for editing them, or is it more of a just update the template in the codebase when someone screams? Were curious because these emails are super important for users, but it feels like they often fall into a grey area where no one clearly takes responsibility. Would love to hear how your team deals with it", "target": "positive"}
{"text": "I wont say the name of my firm as I want it to remain unknown, partially for privacy and partially because I feel many companys may have a similar identity issue. The company I work at is an independent broker dealer. The primary metrics which drives the stock prices are Assets Under Management AUM and the number of advisors at the firm (both growth and attrition). This leads me to believe we are a through and through sales driven org. Where I get confused is, leadership calls us a fintech company (our tech is pretty crummy). If it was only communicated externally as market I would be okay with it, but its not. The tech and product org truly believe we are a fintech product driven org. It creates a lot of confusion between business, product, design, and tech. As Im one of the few people that see the misalignment, I feel I have a clear and powerful opportunity to align myself to sales leadership and be one of the few product people driving the sales led vision. My only worry is this will annoy tech and product leadership. Anyone else work in a sales driven org where tech and product think its product driven?", "target": "negative"}
{"text": "Im looking to improve how I approach roadmapping and make sure I dont have blind spots. Id love to hear how others think about building product roadmaps. My product domain spans 3 verticals. When I stepped into the role, each vertical had its own roadmap but no shared vision or alignment to company goals. I reset things by creating a long-term vision for each vertical, building product strategies, and then combining them into one roadmap that balanced customer needs, technical feasibility, and company strategy. Heres how I approached it: Partnered with sales and customer success to understand and develop conviction for real customer problems . Conducted competitor analysis and stakeholder interviews to find gaps and opportunities. For each vertical, set a long-term vision and broke it into phased roadmaps, sequencing initiatives by customer value and feasibility. Rolled these into a unified roadmap by: Identifying cross-team dependencies, prioritizing by user value and strategic alignment, and using theme-based planning and buffer zones instead of rigid deadlines. Curious on how would you approach building roadmaps for your product domains?", "target": "positive"}
{"text": "I'm a product manager with 3 years experience as PM (20 in total YOE). I'm building a new product now and is expected to build at least 3 more new products. I'm in B2B SAAS for dev tools. I asked to be evaluated for a senior PM role but I've been told I'm not ready yet. Somehow I'm expected to do the entire strategy and lifecycle from scratch several times. Is this a reasonable expectation for a product manager? If you are a senior product manager, what are the additional expectations for you?", "target": "negative"}
{"text": "Im HoP at a startup (early but funded). Our context is atomized: Linear for eng (source of truth in theory) Slack for cross-team decisions/drive-bys Figma for design comments + approvals Attio/HubSpot for sales asks where design/product gets pulled in (design as sales) Result.... important decisions and next steps are scattered. I lose latency between signal  decision  follow-through. Half my day is did I miss something critical? What has actually worked for you to centralize context without introducing yet another inbox? Examples Id love to copy: opinionated Slack conventions (e.g., #project-x-decisions with required message format) Linear issue templates/automations that hoover up Slack/Figma links Zapier/Make routes that turn specific Slack reactions into Linear updates Weekly state of decision log ritual that isnt busywork Happy to share back anything that sticks. Just need something that reduces coordination tax, not adds more.", "target": "positive"}
{"text": "A couple of months ago, I released Wallper . Its a native live wallpaper app for macOS. At first it was just something I wanted for myself because I couldnt find anything on Mac that felt right. Either the apps were ugly, or slow, or locked behind subscriptions. I thought it would stay a small side project but it grew way faster than I imagined. Heres where things are right now  8,367 active users  742 paying customers  $6,761 in revenue  33,000 visitors and 62,000 page views on the site I spent nothing on ads. All the growth came from Reddit, a couple of posts going semi-viral, and people sharing it around. At one point it even got picked up by 3 Telegram channels with over 2M subscribers , which brought a huge wave of new users. Some takeaways so far  Free plan matters more than you think. People want to try without limits before committing.  Subscriptions are a dealbreaker for something like wallpapers. One-time payment works much better.  Distribution beats everything. You can have the nicest product but unless you share it in the right spots, no one finds it. This is still very early but Im curious how far I can push it. I didnt expect a project I made in my room to turn into thousands in revenue in such a short time. Makes me think the ceiling is way higher than I thought.", "target": "negative"}
{"text": "I keep downloading fitness apps and never using them. tried everything - myfitnesspal, nike training, all of them. download, use twice, delete. so im building something different. app tracks your actual workouts using your phone camera (works offline, no cloud bs). when you skip workouts it roasts you. when you try to open instagram or tiktok it makes you do pushups first. ( i have integrated like 28 exercises) still early but the camera tracking works pretty well. reps get counted automatically and it knows if you are cheating, will also detect bad posture etc. Curios to see your comments, roasting etc. If you want to get involved in this project, please dm me.", "target": "negative"}
{"text": "Supereddit is an all-in-one Reddit OS for founders & marketers. It helps you: Auto-post & schedule content Discover subreddits with an AI recommender Track keywords & brand mentions across Reddit Manage everything from a single dashboard Its free for everyone right now. Would love feedback from this community .... what features would make this more useful for you?", "target": "negative"}
{"text": "Hey guys so I've made this free app where you can store your websites, social media posts and online content together in one space, rather than keeping all your bookmarks on like 10 different platforms. And I've just got the collaboration feature with live updates done, so you can now store and share everything with your friends too! So you can use it as a shared information hub to store Tweets, youtube videos, websites, Instagram posts, tiktoks, blogs etc, to plan together for a trip or just to keep content organised together across platforms. Again, free to use, and if interested, here's a demo on how the collaboration feature works, and here's the App Store , Play Store and web app links too if you want to check it out!", "target": "negative"}
{"text": "Ive been coding for about 20 years, and for the past year Ive been building most of my projects with AI. Honestly, AI has given me a massive productivity boost, taught me tons of new things, and yeah sometimes its been a real headache too  I thought Id share some lessons from my own experience. Maybe theyll save you some time (and stress) if youre starting to build with AI.  Early Lessons Dont ask for too much at once. One of my biggest mistakes: dumping a giant list of tasks into a single prompt. The output is usually messy and inconsistent. Break it down into small steps and validate each one. You still have to lead. AI is creative, but youre the developer. Use your experience to guide the direction. Ask for a spec first. Instead of just code it, I often start by having AI write a short feature spec. Saves a lot of mistakes later.  Code & File Management The same file in multiple windows = can be painful. Ive lost hours because I had the same file open in different editors, restored something, and overwrote changes. Commit and push often. Watch for giant files. AI loves to dump everything into one 2000+ line file. Every now and then, tell it to split things up, create new classes in new files and keep responsibilities small. Use variables for names/domains. If you hardcode your app name or domain everywhere, youll regret it when you need to change them. Put them in a config from the start.  Working with Chats Going back to old chats is risky. If you reopen a conversation from a few days ago and add new requests, sometimes it wipes out the context (or overwrites everything done since then). For new topics, start a new chat. Long chats get sluggish. As threads grow, responses slow down and errors creep in. I ask for a quick summary of changes so far, copy that, and continue fresh in a new chat. Much faster. Try different models. Sometimes one model stalls on a problem, and another handles it instantly. Dont lock yourself to a single tool.  Safety & Databases Never just run it. A careless SQL command can accidentally delete all your data. Always review before execution. Show AI your DB schema. Download your structure and let AI suggest improvements or highlight redundant tables. Sometimes I even paste a single tables CREATE statement at the bottom of my prompt as a little P.S. , surprisingly effective. Backups are life-saving. Regular backups saved me more than once. Code goes to GitHub; DB I back up with my own scripts or manual exports. Ask for security/optimization checks. Every so often, Ill say do a quick security + performance review. Its caught things I missed.  When Youre Stuck When I hit a wall, Ill ask AI to list possible steps. I dont just follow blindly, but it gives me a clear map to make the final call myself. And if things really start going sideways, dont wait too long, restart from scratch, get the small steps right first, and then move forward.  Wrap-up For me, AI has been the biggest accelerator Ive seen in 20 years of development. But its also something you need to handle carefully. I like to think of it as a super-fast medior developer : insanely productive, but if you dont keep an eye on it, it can still cause problems  Curious what others have learned too :) EDIT  A couple more things I forgot earlier:  If Im starting a bigger project , I sometimes kick it off with a system like Lovable, Rork, or Bolt to get the structure in place, then continue on GitHub with Cursor AI. This workflow has worked well for me so far , less cost, faster iteration, and minimal setup.  Sometimes I even ask AI : If I had to make you redo what you just did, what exact prompt would you want from me? Then I restart fresh with that   In Cursor I also upload extra context when needed , a screenshot, a code snippet, or even a JSON file. It really helps guide the AI and speeds things up. And if something still cant be solved in Cursor, I restart in Max Mode. It often produces smarter and more comprehensive solutions. Then of course I switch back to Auto Mode so I dont burn through all my tokens  Every now and then I ask the AI to  explain the whole system to me from scratch . It works as a memory refresh both for myself and for the AI. I sometimes copy-paste this summary at the beginning of new chats and continue from there.  One of the most effective ways to spot errors and keep track of the system is simple console log tracking . Just copy-paste the errors you see into the chat , even without extra explanation, AI understands and immediately starts working on a fix.", "target": "negative"}
{"text": "For the past 2 years Ive been building in silence for a while now. Watching others launch, scroll-building late into the night, dreaming but not shipping. 2 months ago, I finally launched my tool. Its called Tydal( https://www.tydal.co ) and its a Reddit marketing tool that helps people get customers. I expected crickets. But something happened that has blown my mind. Heres what happened in the past 2 months: 670 total signups 29 paid users 13.5K website visitors Total revenue: $714 Its not life-changing money. But to me, its proof. Proof that strangers care.Proof that something I made can bring in real users.Proof that Im not wasting my time. Still early. Still messy. Still learning.But Im not stopping. Current goal: $1000 MRRLets see how far this goes.", "target": "negative"}
{"text": "Happy to share: My website just crossed 600+ active users this week! Grateful for all the support and excited to keep growing.", "target": "negative"}
{"text": "I have the worst habit of starting a project, getting halfway through, and then switching to something new that seems more exciting. I love the start of a project but never get to the finish line. Looking for any practical tips that actually work.", "target": "positive"}
{"text": "Hello! I made an app that helps you preview social media assets. Originally I made one for Linkedin only to help my partner serve her clients at her ghostwriting agency. And few months later I hired a designer for one of my clients and noticed that we have no way to preview assets before actually publishing them, something the designer brought up so I decided to facebook and instagram. I would appreciate some feedback. It's free for now: https://sopree.app/ Thanks!", "target": "negative"}
{"text": "Well I'm very happy, BeeNet the open source perplexity alternative just got released yesterday and there's 7 users using it. BeeNet built on top of Langgraph and Copilotkit \"For bidirectional state updates\", BeeNet can plan, search and it's very powerful to understand and get results with the possible minimum credits. BeeNet allow you to use your own preferred model, easy installation and doesn't require any investment to run it locally. BeeNet is now still in testing, you can use it totally for free on https://bee4chat.online/ If you got any features in mind just DM me and I will make sure to add them, the repo will be available on GitHub soon, thank you again you really made my day", "target": "negative"}
{"text": "About a year ago, after a close friend moved away, I got back into letter writing as a simple but meaningful way to stay in touch. That gave me the idea to build a service where people can exchange letters with strangers around the world. The system matches users randomly and anonymously, so you can share thoughts, stories, or just whats on your mind without the pressure of instant replies. Its a slower, more personal way to connect. I built the project in my spare time, and now it feels ready to share with others who might enjoy it too: it's called Silent Ink", "target": "negative"}
{"text": "it's a place where people team up around startup ideas.", "target": "negative"}
{"text": "I dont know where it came from but its been hours since its all over my Mac screen", "target": "negative"}
{"text": "Needed something like this to do everything quickly just by using the keyboard. So I am building a small tool that acts like a command hub with powerful(programmable) shortcuts, fast search, and simple controls all in one place. With it, I can: Launch apps, files, or websites instantly Create workflows (open multiple things with a single hotkey) Control general system actions (Mic, audioSources, volume, brightness, shutdown, etc.) A better and more rapid search Stay fully in keyboard mode without reaching for the mouse Its free and made to just get out of your way. Still Building it but soon it will be the daily driver. Would love to hear your thoughts and advice If youd like to try it early or help shape the direction, Ive put up a waitlist here: [getriser.app] r/SideProject", "target": "negative"}
{"text": "Hey folks, I launched a simple receipt scanning app called Receipto back in May  it was a chill weekend build, meant to work completely offline. No cloud, no fancy AI, just scan and organize receipts locally. I honestly forgot about it for a few months while focusing on another project. A while ago, I posted about Receipto here on Reddit, even though the app wasnt in the best shape back then. But I got some super helpful and constructive feedback from the community, which motivated me to improve it and push a much better version. Fast forward to last week: I won a free promo spot on Indie App Santa (shoutout to them), and as I was prepping for the launch, I dropped the price to free for a few hours. Somehow, AppRaven (and maybe AppAdvice, too?) picked it up. In just 3 days , Receipto hit 19,000 downloads , mostly from Asia. The promo ended, the price went back up, and people actually started subscribing. It made $275 , which is more than what my main app did recently  That gave me the push to properly update it  I added AI-powered scanning (OpenAI & Gemini), optional cloud sync, export/import, recurring transactions, and fixed a bunch of bugs. If youre building something and feel its not perfect yet  just ship it. Talk about it. Reddit helped me a lot.  Try it and give me your feedback : https://apps.apple.com/us/app/smart-receipt-app-receipto/id6745450337 Happy to answer any questions about what worked, what didnt, or anything related to the tech side.", "target": "negative"}
{"text": "I realized that every movie night with my friends or family turned into half an hour of endless scrolling through Netflix, Disney, Prime and others. We would go back and forth between posters and lists and by the time we finally decided most of us were not in the mood anymore. That frustration made me build a tool called MovieLoop. Instead of browsing posters or long trailers you swipe through very short clips until you find a film that matches the vibe you want. Here is the link if you want to try it: https://movieloop.eu I would love to hear your thoughts from a startup perspective. Do you see this solving a real pain point or is it just a nice to have?", "target": "negative"}
{"text": "Built this because my 11yo kid was missing effective ways to practise for her exams. I made her flashcards and quizzes by hand like it was 1995. She sure learnt that way too, but that got me thinking that not every kid have parent with that much free time on their hands. So I started building what I wished existed: kid takes picture of geology notes about plate margins, gets immediate practise that expose gaps in understanding. The photo constraint isn't just better UX, it's the only way to get usable output from that age group. They don't understand prompting. They'd type \"make quiz plz\" and get confused when it asks for context. So point phone, get quiz. The app takes 44 steps (AI prompting, context explanation, output formatting) and makes it one step (point camera). Consistent format, calibrated difficulty, no hallucinated facts. Kids 10-15 get the worst deal in edtech, even when this is the age when learning habits actually form. They are too advanced for baby apps, too young for adult tools. They get gamification theater instead: points, streaks, engagement mechanics that feel good but teach nothing. I stripped all that out. Photo determines content, AI determines difficulty, testing reveals gaps. No escape routes. Also, no ads, no trackers, no data selling. Photos stay on device. Making money from subscriptions, not from kids. Lexie is available on iOS lexielearn.com/app if you or your kids or your friends kids wanna test it out. Would really appreciate the feedback!", "target": "negative"}
{"text": "Me and my friend created this new side project over the last couple weeks. Finally got a domain and released it today. It sort of works, a long way from done, but would appreciate any thoughts/feeback!", "target": "negative"}
{"text": "Quick update on Rheia, the AI agent builder Im building in public: Today we shipped Realtime. Runs now: Update status, output, errors, and timestamps instantly Stay reliable with dual redundancy (event bus + direct channels) Show polished UX with spinner, disabled button, retry flow Support Cmd/Ctrl + Enter shortcut for quick runs Deliverable: a fully polished realtime run experience. Next up: Supabase logs so Rheia remembers everything your agents do. Would you prefer logs inline in the run detail view, or a separate activity history tab?", "target": "negative"}
{"text": "The idea is actually quite simple. As a Japanese learner and a coder, I've always wanted there to be an open-source, 100% free for learning Japanese, similar to Monkeytype in the typing community. Unfortunately, pretty much all language learning apps are closed-sourced and paid these days, and the ones that *are* free have unfortunately been abandoned. But of course, just creating yet another language learning app was not enough - there has to be a unique selling point. And then I thought? Why not make it crazy and do what no other language learning app *ever* did - add a gazillion different color themes and fonts, to really hit it home and honor the app's original inspiration, Monkeytype? And so I did. Now, I'm looking to find contributors and testers for the early stages of the app. Why? Because weebs and otakus deserve to have a 100% free, beautiful, quality language learning app too", "target": "negative"}
{"text": "Hi all  I built Flagsy , a world geography quiz app for iOS. The idea came from wanting something fun (and useful!) to play when traveling without internet.  Quiz modes for flags, countries, and capitals  100% offline  play anywhere, even on a plane   Keeps track of your progress so you can challenge yourself  A quick, fun way to brush up on geography Its on the App Store - https://apps.apple.com/us/app/flagsy-world-geography-quiz/id6737687944 Id love to hear your thoughts, and if you spot any bugs please let me know", "target": "negative"}
{"text": "Hi everyone, I've been a webseveloper for the past 10 years, and am trying some new things (now AI can help out). I wanted to build a 100% offline localfirst (only actually) mobile app. I decided to go with Ionic Capacitor, Biometric Authenticagion, SQlite and Vue 3. It became a sophisticated habitat tracker app which is in internal testing phase and I'm quite happy with it (some improvments still need to be done). Now comes the bummer.. I just discovered I need 12 different testers testing my app for 14 consecutive days! Omg. How do others get them? I'm I solo dev and find it sort of awkward to ask close ones  Like to hear what others do to get this part done!", "target": "negative"}
{"text": "I built Permutify, a free tool that enumerates all possible accumulator/parlay combinations from your match picks (win/draw/lose, BTTS, over/under, combos). You can try it here: https://permutify.com . l'd love your feedback and suggestions.", "target": "negative"}
{"text": "Hey everyone! I wanted to share a cool platform Ive been working with  CharmReads . Its an AI-powered invitation creator that lets you design wedding, birthday, corporate, and family event invites quickly and effortlessly. Just in starting stage. No designers, no waiting  just upload a photo or logo , and our AI crafts a beautiful, personalized invitation in minutes. Perfect for personal celebrations or professional events! Check out some examples and get inspired here: Instagram", "target": "negative"}
{"text": "Hello fellow SaaS builders. My names Rob & I just added $1k MRR in 24 hours after 5 failed attempts. A couple weeks ago was launch day for my 6th SaaS attempt. After building in stealth for 6 months, I went from $1,600 to $2,500+ MRR in a single day. I started my SaaS journey 2 years ago. Failed 5 times. Lost money, time, and almost my sanity. But with attempt #6 I did a few things differently. First off, I faced the pain-point myself. Every SaaS \"guru\" preaches build in public, launch fast, get feedback. But launching broken products never worked for me. Too much noise, too many opinions, too much damage to first impressions. So I tried something different. My secrets to a successful launch day: Building in Stealth: I still posted publicly, but kept the product private until it was ready. Posted screenshots asking \"who wants to try this?\" - no product links DMed interested people to join private beta Got 30 paying users before anyone knew what I was building Their brutal feedback made the product 10x better Built hype so launch day went that much better Launch Day Momentum: When you finally launch, ride the wave HARD. Posted a curry selfie celebrating 26 trials  50,000 views Screenshot PostHog analytics  20,000 views Screenshot Lemon Squeezy dashboard  10,000 views Every win becomes content that drives more wins Why Photos Matter: Text gets lost in the AI slop on X. But by showing you are a real human being with a real story, you stop and grab peoples attention. People root for underdogs (probably you) Authenticity beats polished marketing (especially in AI era) The Numbers Game: 70 free trials in 24 hours 50% trial conversion rate (industry average is 15-20%) 200,000+ views on X in 24hrs 95% of traffic from organic X posts Over 6 months of private beta, I built to $1,600 MRR. Then added $1,000 more in 24 hours. A couple weeks on, Im at $4,500+ MRR with another 150 trials pending. Ask me anything about: Failing 5 times and what I learned Building in \"stealth\" while still posting publicly Getting 30 people to pay for a private beta Launch day execution Why posting a picture of me eating a curry converted more users than anything else Goal is $10k MRR well before the end of the year. After 5 failures, it finally feels possible. Happy to share specific tactics, screenshots, or just commiserate about the SaaS grind :) Let's gooo! (I'll be sticking around most of the day to answer questions. And I'll try my best to answer any asked even after today, so don't hesitate to leave your question!) EDIT: This was a lot of fun, thanks so much for asking all of your questions - there were some really great ones! I'll have to bookmark this myself so I can come back and re-read my answers, since I dropped most of my brain in here today haha. Catch you all next time or on X (hopefully past $10k MRR)! :D", "target": "negative"}
{"text": "This is a weekly post where you're free to post your SaaS ideas, products, companies etc. that need feedback. Here, people who are willing to share feedback are going to join conversations. Posts asking for feedback outside this weekly one will be removed!  P.S: Check out The Usual SaaSpects, this subreddit's podcast!", "target": "negative"}
{"text": "A good friend of mine who's been in B2B sales for over 20 years recently shared something with me that completely shifted how I see prospecting and outreach. He didnt get a reply. He didnt have a meeting booked. There was no introduction or referral. Just a single like from a prospect on one of his LinkedIn posts. That was it. From that tiny moment of engagement, one that most salespeople would ignore, he ended up closing a $72,000 deal. What struck me wasnt just the outcome, but the way he explained the process. Hes no longer chasing people with cold DMs or relying on generic filters to build lists. Instead, hes paying attention to what he calls dynamic social signals. Little behaviors that indicate interest, curiosity, or intent, even if theyre subtle. He looks for signs like someone viewing his LinkedIn profile. Liking a competitors post. Following someone in his space. Commenting on a post related to the problem his product solves. Attending an event. Engaging in a niche discussion. To most people, those dont feel like leads. But to him, theyre the start of a conversation. When someone interacts with something even loosely related to his offer, he uses that as context to send a thoughtful message. Not a pitch. Not an automated sequence. Just a relevant piece of content, a short insight, or a question tailored to what the prospect showed interest in. He told me about a VP who viewed his profile after reading a post about ROI in telecom. Instead of pitching right away, he connected with that person and then 3 days later dropped a short message with a case study on how his product increased ROI for a similar client. The VP replied the same day. In another case, a director liked a post by an influencer talking about a problem his product solves. He followed up with a simple value-first message offering help, no strings attached. That turned into a call the same week. This method gives him four times more replies, four times more acceptance, and over 90 percent of people who respond are actually qualified. Its a simple formula. High intent plus perfect timing equals real conversations that convert. This kind of sales isnt loud. Its not spammy, based on listening, not chasing. And it works ! Good luck. Romn (building gojiberry.ai )", "target": "negative"}
{"text": "Ive built enough SaaS products for clients to know that this is probably the most misunderstood piece of advice in the entire industry. It sounds right. It feels right. And it leads more teams down the wrong path than almost anything else. I know, it sounds like heresy. But let me explain. Every client I work with has a backlog full of feature requests straight from their users. \"We need a dark mode.\" \"Can you add a CSV export button?\" \"We want more dashboard widgets.\" The impulse is always the same: \"Our users are asking for this, so we have to build it.\" And so they do. They build the dark mode, the export button, the extra widgets. And nothing changes. Engagement doesn't go up. Churn doesn't go down. The product just gets more bloated and harder to maintain. Here's the problem nobody talks about: Users are experts at their problems, but they are terrible at designing solutions. When a user asks for a feature, what they're really doing is describing a symptom and guessing at the cure. Your job isn't to be a short-order cook and build whatever they ask for. Your job is to be a doctor and diagnose the underlying disease. I had a client whose users were constantly asking for a \"better way to export data.\" They were convinced they needed more formats, more options, more filters. We spent weeks going back and forth on the design. Finally, I got on the phone with five of those users and asked a simple question: \"What do you do with the data right after you export it?\" Four of them said they manually clean it up and import it into QuickBooks. The problem wasn't the export feature. The problem was they couldn't get their financial data into their accounting software. The real solution wasn't a better export button; it was a native QuickBooks integration. We built that instead, and it became their single biggest driver of upgrades. Here's the framework I use now that saves my clients from themselves: Treat every feature request as a starting point, not an endpoint. The request is the beginning of your investigation, not the conclusion. Always ask \"why\" five times. \"Why do you need a CSV export?\" \"So I can get my data out.\" \"Why do you need to get your data out?\" \"So I can put it in another system.\" \"Why do you need it in that system?\" You get the idea. Watch what they do, not just what they say. Session recordings are gold. You'll often see users struggling with a workflow they can't even articulate properly. Solve the problem, not the request. A user asking for a faster horse doesn't actually want a faster horse. They want to get from point A to point B more quickly. The solution might be a car. I'm not saying you should ignore your users. You absolutely should listen to their problems, their frustrations, and their goals. But the moment you start letting them design your product roadmap, you've already lost. You're the product expert. They're the user expert. Your job is to translate their pain into an elegant solution. Stop taking orders and start diagnosing. Your product will be a thousand times better for it. End of rant. Edit: Damn, this post blew up! If you're struggling with feature bloat or need help building an MVP that actually solves real problems, I'm taking on new clients. Hit me up if you want to cut through the noise and build something people actually need.", "target": "negative"}
{"text": "Every single day I see more proof that AI is completely changing how fast products get built. A friend told me about someone who took an existing SaaS product and rebuilt most of the core features in just one weekend using AI tools. I read about another guy who launched a Chrome extension in 24 hours, and it actually made it to the front page of Product Hunt. There are stories about small teams cloning full YC startup products just for practice, sometimes even adding a little twist and putting it live the same week. This used to sound impossible. Before AI you needed months of planning, a dev team, and funding just to get something usable. Now one person with no budget can sit down, use AI to generate code, use another AI for UI design, and have a working product in less than a week. Hosting is free, domains are cheap, and marketing is just posting online. The cost of failure is basically zero so people do not even care if an idea fails anymore. They just try again and again until something sticks. The scary part is not just speed. It is that ideas no longer feel safe. If I can make something today, there is nothing stopping ten other people from rebuilding the same thing tomorrow, polishing it a little more, and pushing it with better marketing. Even established companies with money and teams can clone and launch something at insane speed. Execution speed is becoming more important than originality itself. To see how real this is I decided to test it myself. In just 2 days I built an MVP with AI guidance. It is live right now. It reduces heavy manual compliance work for firms and anonymizes data before AI processes it so privacy stays protected. I did this with zero budget, just AI and free hosting, and it actually works. This made me stop and think. If an MVP like this can be built in 2 days, what is the point of spending months building something from scratch. Are products even safe anymore when AI has lowered the barrier this much. Maybe the real challenge is not building but getting attention fast enough before someone else copies the idea. I do not know the answer but it feels like we have entered a new era where speed and distribution beat almost everything else.", "target": "negative"}
{"text": "Absolutely zero moderation! Today Ive read the last massively exaggerated fake post that I can bear. $0 to $12k in 2 Weeks was a personal favourite BS tale that I trudged through recently. Its getting absurd! The issue is that as a founder, I really love SaaS as a subject. The intricacies of the business model are one of my favourite things to discuss and unfortunately theyre not exactly subjects to discuss socially at a party. Which is why this Sub is important! But recently, this Sub has just eroded into a flood of absurd stories - one after another - with zero evidence that it is going to slow down! Clearly the hustle bros have worked out that the narrative of vibe coding + TikTok can be turned into a semi-believable story that can hook a SaaS newbie in. The problem is that anyone who is  in it  or  has done it  knows exactly how difficult SaaS actually is and as a result - sees straight through this garbage. Not every problem requires a just market more - bro answer. - MVP types - Pricing strategies - Product market fit - Sales - Retention mechanisms - Design - Scaling systems Etc etc, all of these are roadblocks that founders deal with on a DAILY basis and it is clear that the only place that these problems can be discussed communally (here) is (and has been) failing for a while now. So this morning I made this community for anyone that is as passionate about this subject as I am. This community only costs me $9 to host every month - which is a BARGAIN if it means that I can chat freely with people that prefer actual discussion instead of having to spend half-an-hour - sifting through posts for sneaky sales tactics every day. Feel free to join if you feel the same way as I do! :) It will always be free and for the purposes of community / discussion ONLY ! (No self promotion / fake story BS will be tolerated) If you disagree and think that what I am saying is incorrect and that this sub is suitable for mainstream SaaS discussion - please let me know below! I'd like to hear your argument because I just can't see it.", "target": "negative"}
{"text": "We just launch a new IaaS to help builders playing with AI agent to have an agentic way to change their IP. We call it VaaS . VPN as a Service. It's free and opensource.", "target": "negative"}
{"text": "When I launched my first SaaS, I thought content marketing would solve all my problems. I wrote 10 blog posts and waited, but nothing happened. It wasn't until I started submitting my site to directories and launchpads that I saw real progress. In just three weeks, my Domain Rating (DR) increased from 0 to 6, and I attracted over 1,000 targeted visitors all before writing a single blog post. Frustrated but determined, I compiled all my client SEO notes into a Notion document that includes:  A list of the Top 100 Directories (covering SaaS, Tech, AI, and B2B)  My exact submission checklist  Common mistakes that can ruin your submissions  A few niche-specific bonus sites I discovered buried in backlink reports These are the same strategies I used for clients who paid $1,500+ per month. This isnt just generic advice; its actionable tactics that helped early-stage SaaS companies gain visibility without having to wait six months. If youre struggling to get any traffic or youre tired of doing SEO the hard way, this could be just what you need. Drop a comment with \"directory\" or \"SEO list,\" and Ill send you the full Notion document.", "target": "negative"}
{"text": "Hello everyone I just completed a LinkedIn outreach experiment for my SAAS that yielded impressive results: 50%+ acceptance rate and 60% response rate from connections. Here's exactly how I did it. Step 1: Find Your Ideal Prospects Target people who would genuinely benefit from your service. For example, lets say youre aiming at marketers, but this works across industries. The LinkedIn Events strategy: Go to LinkedIn search and type your target industry (marketing) Click on the Events tab Find large events with 10k+ attendees Click Attend Browse the attendee list to identify potential prospects Pro filtering tips : Prioritize younger professionals, who are often more open to trying new tools Step 2: Send Strategic Connection Requests Always use desktop. It lets you add a personalized note, which improves acceptance rates. Keep the message short and simple. Example: Hey [Name], saw we were both in the [industry] space, would love to connect. Best, [Your Name] Step 3: Build Rapport Before Pitching Dont pitch right after someone accepts. Wait. Sometimes theyll even reply first. The next day: Check if they posted recently Like their post and leave a thoughtful comment Make it meaningful (avoid Great post) Step 4: Craft Your Outreach Message Use the problem-first approach. Structure it like this: Greet and reference the connection Mention your app briefly with 1-2 features Ask about their daily challenges Offer value, such as early access, free trial, or a discount Example: Hi [Name], thanks for connecting! Im working on [brief app description]. Im always looking to make it more valuable for [their role]. Whats something you struggle with day-to-day that you wish there was a better solution for? Your insights would be very helpful, and Id love to offer early access if it could help. Step 5: Handle Responses Perfect match: Theyre interested, and your app fits their need Feature opportunity: Theyre not a fit now, but their feedback gives you valuable insights No response/not interested: It happens. This approach still outperforms most others Bonus: Optimize Your Profile Use a clear, professional-looking photo (doesnt need a studio shoot) Write a strong headline and About section that explain what you do Make it easy for prospects to understand your expertise and story Have a website in your bio so prospects can book calls without talking to you Key Takeaways : Quality over quantity: Target the right people Build relationships first: Engage before pitching Focus on problems: Lead with their challenges, not your features Be patient: Genuine outreach takes time Stay authentic: People respond better to real conversations than to polished scripts This system has consistently delivered better results than any other outreach method Ive tried. While no approach works 100% of the time, focusing on relationships and problem-solving creates connections that often turn into long-term business. You can do this 100% manually or automate it at scale. Good luck ! Romn from gojiberry.AI", "target": "negative"}
{"text": "We recently made a SaaS explainer video that outperformed every previous one on metrics: 2.4x longer average watch time 30% higher conversions from landing page What changed? We showed real product UI , not just illustrations The script started with a relatable pain point , not a feature dump The pacing was tight and clear  under 90 seconds Ive made 1000+ videos for SaaS and tech companies, and these 3 levers consistently outperform everything else. If youre working on your own explainer or landing video, Im happy to review it or break down what might work best for your niche. Drop a link or comment what you're building  Ill reply with real feedback Lets make your product pitch unforgettable.", "target": "negative"}
{"text": "Ive been working on an agent that might be useful if youre in the early stages of building. Its called the AI & SaaS Leads Reddit Hunter, basically an automated market research analyst that scans key Reddit communities and pulls out real business opportunities from live conversations. How it works: You describe a problem area youre interested in  the agent scans curated subreddits  it runs a two-stage AI analysis (pain points  strategic synthesis)  then delivers an actionable report in Markdown + Google Sheets, complete with trends, pain points, and opportunity mapping. Currently opening free beta testing. If youre actively working on SaaS projects and want early access codes, drop a comment below and Ill send them your way. Would love to get feedback from the community before launch.", "target": "negative"}
{"text": "Last week I found a thread where someone was asking about alternatives to our product. Three competitors had already commented helpful responses. The person chose one of them. This happens constantly. People are online right now asking for exactly what you sell. And if you're not there to answer, your competitors are. I started tracking this. We miss 5-10 posts per day where people mention problems we solve. Most already have competitor responses within 2 hours. These aren't cold leads. These are people literally asking what tool they should use. They have budget. They have the problem. They're ready to buy today. But they'll never find you because you weren't in the conversation. Your competitors know this. The smart ones have systems to monitor and respond fast. They're not necessarily better than you. They're just present when it matters. You can have the best product and perfect pricing. None of it matters if you're not there when someone's asking for you. I'm curious how others handle this problem. Do you have alerts set up or just randomly check communities when you have time.", "target": "positive"}
{"text": "Im currently working on automation tool and would love to hear what others are building as well. Let's connect together. Twitter/X Automatic Posting Tool Go to my site  Login via X  Write once (Any topic posts you want to expand on your Twitter)  Start auto-post  My tool will generate tweets based on your Input (Easy right?)  Timer runs (towards zero)  Tweet posts on X (automatically)  Cycle repeats (automatically)  Posts on X grow non-stop while you are busy vacationing or sleeping. If youre interested, feel free to DM me and I will send out early invites to join as one of the f irst beta testers. FYI : You can check content on @ MoodTalesAI for the non-stop posting.", "target": "negative"}
{"text": "Guys, I need your opinion: Would you blow $10-$20 on a custom domain in the beginning, when you only have a landing page, or would you stick to the free one in vercel for example? Because of your startup falls or you lose interest you would lose those $10-$20 Whats your opinion?", "target": "negative"}
{"text": "Ive been building something to make Reddit a proper growth channel for founders & marketers, and I just launched it today. Its called SupeReddit  an all-in-one Reddit OS. Heres what it does: Auto-posting & scheduling AI subreddit recommender Client dashboards & analytics Its 100% free . If you use Reddit for growth, Id love your feedback and ideas on how to make this even better.", "target": "negative"}
{"text": "It took a month from concept to launching next week. Im just so happy I wanted to share. I work in retail full time so its been challenging finding time to learn this and make it a reality. After weeks of late night grinding I can final say I did it! Just wanted to share the joy", "target": "negative"}
{"text": "What are you building this sunday? I'll go through the comments and give feedback. Here's mine - Earn $2000+ a month training AI agents and selling specialised datasets to AI companies, for extremely rare specialised datasets (like medical field expertise) you could earn tens of thousands and get lifetime royalties. Here's a link for the waitlist - https://quantumverse.cloud", "target": "negative"}
{"text": "An AI Growth Engine that helps your community before you even ask with daily challenges that boost engagement, retention, reactivation and revenue up to 5x.", "target": "negative"}
{"text": "Serious question: if $10,000 landed in your lap todayno strings attachedwhat wild business or side project would you throw it into? Would you try flipping something online? Open a tiny coffee cart? Build an app? Or just YOLO into crypto and hope for the moon?  Im curious what people would actually risk it on. Drop your ideas below  and upvote the most creative ones. Who knows maybe someone here will actually make it happen.", "target": "negative"}
{"text": "I read lot of posts here in reddit and I'm a new user here.every post tells I built this and that and I got interested about sass and business but nobody tells how they validated their ideas.i sometimes think i got idea and when I check Ai platforms like chatgpt,Perplexity and grok.it says your idea is good and you have similar ideas in market and all.do everyone validating you ideas like that ??.I want honest opinion", "target": "positive"}
{"text": "Everyones busy chasing the perfect product. Truth is, building isnt the hard part. Marketing is. Heres the proof: I saw a guy launch a simple site where you add text behind an image. Thats it. Nothing new. Free versions already exist everywhere. But he slapped a new name on it, shared it smartly, and built a brand around it. - Made $250 in his first month - Picked up 8K followers on X Meanwhile, dozens of better free tools are out there collecting dust. People rarely dig deeper. They go with whats marketed well and easy to find. So heres the real lesson: dont just build. Market the hell out of it. If youre stuck on that part, I can help. Just a DM away.", "target": "negative"}
{"text": "While experimenting with pricing for my AI platform, I realized most people dont want yet another monthly subscription. ChatGPT costs $20/month (thats $240/year). I decided to offer a $59 lifetime plan  unlimited access, all future upgrades included, and ChatGPT 5 will be live soon. My question to the community: as a user, what gives you more confidence  paying monthly with the risk of price increases, or paying once and knowing youre covered forever?", "target": "negative"}
{"text": "Someone is saying validate first someone else is saying don't. Someone is saying certain way is bad someone else is saying good. It all makes me think about free will and stuff. We all read what everyone else is saying but we do what we would do anyways as if we did not read at all. So maybe we are all programmed to follow what we know is the best. Anyways, Let's just keep doing what we do, because what else would we do?", "target": "negative"}
{"text": "Hey everyone, Im currently building a small micro-SaaS project and considering using Gumroad as my payment provider instead of Stripe or Paddle. I like the idea of handling one-time payments or subscriptions without setting up a complex backend. Im curious:  Has anyone used Gumroad for a micro-SaaS long-term?  How well does it handle subscriptions (cancellations, renewals, reminder emails, etc.)?  How do fees and payouts compare to Stripe/Paddle?  Any issues with refunds, taxes, or support?  Would you still recommend Gumroad in 2025, or go straight for something more professional? Id love to hear honest experiences, lessons learned, or things youd do differently when starting out. Thanks in advance!", "target": "negative"}
{"text": "After a lot of ups & downs, Im finally launching ytorganize.com  https://ytorganize.com/ Tired of saving YouTube videos to Watch Later & never finding them? With YTorganize you can: 1.Add notes & timestamps under the video 2.Set reminders 3.Import your playlists from YT in 1 click & more!", "target": "negative"}
{"text": "Hey everyone, Im working on building a self-hosted CRM solution designed for organizations that want: Full control of their data (no third-party platforms involved) No recurring per-user costs (just a one-time setup/investment) Secure, private, and tailored to your organizations needs Scalable for teams without paying extra memberships for every new user The goal is to let companies keep their CRM data within their own infrastructure , without depending on external SaaS platforms that lock you into subscriptions. Id love to connect with people who are interested in: Exploring a one-time cost CRM alternative Avoiding vendor lock-in and hidden costs Having peace of mind about data privacy and security If this sounds interesting to you (or your organization), drop a comment or DM me  Id love to chat and share more details!", "target": "negative"}
{"text": "There are various types of solopreneur / self employed. What do you do? Is it consulting/ one person small business / YouTuber? I am a w2 worker & itching to work for myself. Thanks", "target": "negative"}
{"text": "A lot must have changed, what are the biggest differences? Could you share your story in 2-3 sentences? Would love to see interesting stories, and I will share mine first. Used to be a VC backed founder with near $10m funding, business didn't take off, and the team went down to just myself forcing me to do most things on my own. Then I launched a few software and e-commerce projects in the past 6 months, and about to reach the point that the profits cover my expenses. What is your story? and what are the differences between now and then?", "target": "negative"}
{"text": "You might think you need more experience, better brand recognition, and more trust in your business to succeed. These big businesses seem to own a monopoly and have complete control over the market. What do you have, as an underdog no one knows, that can beat these bigger and better businesses? Underdogs have freedom to experiment - You arent big enough for people to care about you. This means you can test and fail in the shadows while these businesses are stuck in the spotlight. Underdogs move fast - Big businesses have teams, meetings, and budgets to approve. However, you can test, change, and implement your ideas within hours. Underdogs are authentic - There isnt a team of managers and employees working under you. Its just you. And you can give a personalized experience to your customers unlike your competitors who think of them as just a number. Underdogs are never satisfied - They work harder to build their business and support their customers. People love underdogs so frame your business as an underdog working harder than other big and lifeless corporations. By embracing your disadvantages, you seem like a trustworthy brand, and it emphasizes your strengths that the big competitors don't have. If you liked this post, check out my email newsletter for more actionable advice like this on business mindset and entrepreneurship.", "target": "negative"}
{"text": "Why are mockups and wireframes important? They offer clear visual communication for your ideas, making it easy to collaborate with stakeholders. These tools facilitate user experience testing and early feedback, letting you refine designs before development starts. They save time and resources by enabling quick adjustments during the planning stage. What features should you look for? Ease of use: An intuitive interface lets you design quickly. Collaboration: Tools that allow team sharing and co-editing are vital. Pre-built templates: These save time and spark inspiration. Export options: Look for tools that allow exporting in various formats (PNG, PDF, etc.). Integration: Seamless connection to other project management or design tools is a plus. Here are the top free options in 2025: Figma Web-based, vector editing, and real-time collaboration. Extensive plugin library & responsive design. Easy for individuals and small teams (free tier); some advanced features are paid. Wireframe.cc Minimalistic, drag and drop focus with limited color palette for distraction free wireframes. Super user friendly, no signup required. Fewer features than full scale tools, great for quick sketches. Moqups Comprehensive template/component library, collaboration, and integrates with Google Drive/Slack. Basic free plan, modern interface. Limited export options on the free tier. Balsamiq Wireframes Low fidelity, sketch style interface with drag and drop components. Great for rapid prototyping and easy team feedback. Free version is a trial; limited features. InVision Freehand Online whiteboard for collaborative brainstorming with infinite canvas. Free with unlimited boards; integrates with other InVision tools. Focused more on freeform ideation than structured wireframing. Sketch (Free Trial) MacOS only, offers professional mockups with vector editing and plugin support. Free trial (limited period); powerful but not available on Windows/Linux. Each tool serves different needs, whether you're prioritizing collaboration, simplicity, or full-featured design. Try them out to see which one fits your workflow best streamlining your design process, communicating better with stakeholders, and saving valuable development time. Full article and details here: https://blog.mvplaunchpad.agency/the-best-free-tools-for-mockups-wireframes/", "target": "negative"}
{"text": "Ok so this is gonna sound weird but building TuBoost solo for 18 days has made me realize I might not actually be an introvert... I might just be terrible at asking people for help lol Like I'll spend 6 hours debugging something that probably has a 2-minute solution if I just asked someone who's done it before. But instead of reaching out I'm googling random Stack Overflow posts from 2015 and hoping they apply to my specific edge case  The solo founder thing is so contradictory too... like you need to be comfortable working alone but also constantly networking and talking to users. Some days I love the independence, other days I'm staring at my laptop wondering if I'm slowly going insane from lack of human interaction. Had this moment yesterday where I was stuck on a payment processing bug and spent HOURS trying different solutions. Finally posted in a Discord server and got the answer in 10 minutes. Made me realize how much time I waste being stubborn about figuring everything out myself. But also asking for help feels vulnerable? Like admitting you don't know something means admitting you might not be qualified to build this thing. Impostor syndrome but make it entrepreneurial lol. The building in public thing helps because at least I feel connected to other builders even if we're all struggling separately. But it's still weird to share progress with strangers online while avoiding asking friends and family for actual advice. Customer support has been the biggest eye-opener though... like I'll spend days building features I think people want instead of just asking my existing 35 users what they actually need. Social anxiety disguised as product development strategy  Anyone else deal with this? Like being comfortable with the technical challenges but weird about the human parts of building a business? The networking advice everyone gives feels impossible when you're naturally conflict-avoidant and overthink every interaction. \"Just reach out to potential customers!\" Ok but what if they think I'm annoying?? Weirdest part is I'm fine posting vulnerable updates on Reddit but terrified to send a cold email to someone who might actually use my product. The internet makes no sense. How do you push through the social discomfort of entrepreneurship when your natural instinct is to hide behind your computer and hope customers find you organically? Also is it normal to feel lonely while simultaneously avoiding opportunities to connect with people? Because that's definitely my current vibe and it seems counterproductive lol. The solo thing is both my biggest strength and weakness... love the independence but maybe I'd be further along if I actually talked to humans more often", "target": "negative"}
{"text": "Duuude the AI hype is making me feel like I'm living in a different universe... everyone's building \"AI-powered this\" and \"machine learning that\" while I'm over here celebrating that my file upload form works in Safari lmao Like I see posts about \"AI revolutionizing X industry\" and \"GPT wrapper makes $100k MRR\" and I'm just trying to build TuBoost.io without the payment processing breaking when someone uses an apostrophe in their name  Don't get me wrong, my app uses AI for video processing and it's genuinely useful. But 90% of my work is boring shit like database optimization, error handling, and figuring out why the mobile UI looks like garbage on older phones. Meanwhile everyone's raising millions for \"AI agents that do your laundry\" or whatever and I'm wondering if I'm completely missing the boat by focusing on... actually making stuff work? The pressure to be \"AI-first\" is insane though. Like I'll describe TuBoost as \"video processing tool\" and people are like \"cool story bro\" but if I say \"AI-powered content optimization platform\" suddenly everyone's interested. Same exact product, different buzzwords. Had this conversation with another founder who was like \"you should add ChatGPT integration to everything\" and I'm thinking... my users just want their videos to process without errors, they don't need AI to write their video descriptions lol But also what if I'm wrong? What if I should be building chatbots and AI assistants instead of solving actual workflow problems? The FOMO is real and I keep second-guessing whether I'm building the right thing. The funny part is most \"AI startups\" I've seen are just regular software with GPT API calls sprinkled on top. Like we're all using the same OpenAI models but some people are better at marketing it as revolutionary. Anyone else feeling this pressure to AI-ify everything even when it doesn't make sense? Or am I just being stubborn by focusing on core functionality over trendy features? Honestly starting to think the real skill isn't building AI, it's knowing when NOT to use AI and just solve problems with boring reliable technology. But also maybe I'm just coping because I don't understand transformers and everyone else is secretly building AGI while I'm here debugging form validation  What's your take? Are we in an AI bubble or am I missing something fundamental about where software is heading?", "target": "negative"}
{"text": "Hi all, so in reality, I used to feel trapped in admin hell: juggling client messages, invoices, proposals, and project deadlines, every single tool felt like it added more confusion, not less. It felt endless. So, I started building Retainr.io , a lightweight platform that helps you package your services, onboard clients with a single link, and automate recurring tasks, all under your own white-label portal. Im most proud of how it helped me regain control over my time and actually deliver work without drowning in notifications. What tools or workflows help you stay sane while managing clients solo? Whats saved your mental energy lately?", "target": "negative"}
{"text": "I use to keep track of how many hours I worked for people by using my iPhone app or excel sheets I tried the apps that were out there. Toggl was pretty solid but when I started the timer, I would forget to stop it, if I did remember, I would forget later what and who the timer was for - it got messy, So I created my own little app, added a picture in picture window for the timer, added a long running timer warning and some other small things that you almost cant go wrong with I then added in everything I do daily so I dont need to jump around to other apps. Its awesome and neat now What solution did you create to help an actual issue you had?", "target": "negative"}
{"text": "I know this wont be a popular take, but hear me out. Not everyone is built for running their own business. Its full of uncertainty. Its lonely. And you will be tested in ways you couldnt imagine. Youll have to figure out how to create a good product. Youll have to figure out sales and marketing. Youll have to figure out how to manage finances and all the legal stuff. And much more. Honestly, its a brutal way to make a living. To pull through, you have to be obsessed with either creating a great product or making a lot of money, ideally both. But for the few that are ready for the challenge, I have good news. Overcoming the difficulties of running your own business will give you a lot of freedom and make you very capable. Its hands down the best training ground for self improvement. I went all in on this path 1.5 years ago and its been the most rewarding thing in my life. I have my SaaS now that is about to hit $10k/mo and Ive learned so much. So for most people: keep your job and just build projects on the side. You probably dont want all the stress. For the few that are ready for it, youre in for a hell of an adventure.", "target": "negative"}
{"text": "Alright, can we talk for a second group? I've been grinding for weeks, creating a suite of digital products that I am genuinely proud of. I know they solve real problems. But I'm stuck in the new business loop: I need those first few sales to get reviews and build trust... but I need trust to get the first few sales. Honestly, the temptation to just rage quit is very real today. So I wanted to ask the founders in here who have successfully pushed through this phase: How did you break that cycle? What was the breakthrough that got you your very first sale and that first crucial testimonial? Not looking for a magic bullet, just some perspective from those who have been on the other side of this... Thanks for letting me vent.", "target": "positive"}
{"text": "Hey everyone! Im starting a blog focused on the solopreneur journey. Before I go too far, Id love to hear from this community: What challenges, stories, or resources would you be most interested in reading about? Whats missing from existing content out there? Your input would help shape the blog so its actually useful for solo founders like us. Thanks!", "target": "negative"}
{"text": "Duuude the marketing side of building my saas is absolutely destroying my soul and I need to vent somewhere... Like I can code all day no problem. Building features? Love it. Fixing bugs? Sure. But then I have to actually TELL people about what I built and suddenly I want to crawl into a hole and disappear forever The stuff that's been working (barely): Reddit comments where I actually help people then casually mention my tool Twitter building in public (posting daily even when I feel stupid) Cold emails to YouTubers (95% ignore rate but the 5% who respond are gold) The stuff that makes me want to die: TikTok videos (I look and sound like a robot) \"Networking\" on LinkedIn (feels so fake and gross) Promoting in Discord servers (always worried I'm being spammy) What's weird is when I force myself to be vulnerable and share struggles, people actually respond? Like my posts about failing and being confused get way more engagement than polished \"look at my cool feature\" content. But every single post feels like performing in a play where I don't know my lines. I'll write something, delete it, rewrite it 5 times, then post it and immediately regret it lol. The crazy part is it's actually working though? 35 signups, $700 revenue, 5 people interested in sponsor program. All from forcing myself to be uncomfortably public about everything. Still feels like I'm cosplaying as an entrepreneur while having constant anxiety about whether people think I'm annoying or fake. Anyone else deal with this? Like how do you market your stuff when self-promotion makes you physically uncomfortable? The whole \"just put yourself out there\" advice is useless when \"out there\" feels like standing naked in Times Square lol. What's the least painful marketing strategy you've found? Because I'm running out of ways to procrastinate on promotion", "target": "positive"}
{"text": "Share regular updates and valuable content on Facebook, Instagram, Twitter, and LinkedIn. ( no social media is right or wrong, use everything, post everywhere initially) Build a Landing Page Create a dedicated landing page that clearly explains your apps value, showcases screenshots or demo videos, and features a strong call-to-action (CTA) App Store Optimization (ASO) Boost visibility by including researched keywords in your app title and description. Write a compelling description, and add high-quality visuals, attractive app icons and screenshots make a huge difference. Reach a broader audience by collaborating with niche influencers. Provide them free access to your app for honest reviews or set up engaging giveaways to attract attention. Establish authority and build your audience with blog posts, video tutorials highlighting app features, and shareable infographics that explain what sets your app apart. Grow your email list by offering incentives such as free eBooks or exclusive content. Segment your audience to tailor your messages, and send regular updates on app features, tips, and news. Join relevant subreddits, Facebook Groups, Quora, and niche forums. Engage in discussions, answer questions, and share your expertise to organically promote your app. Start small with Google Ads or Facebook Ads, targeting specific demographics. Submit your app to various app review sites for additional exposure. Showcase your app with live demos or webinars. Pick topics that resonate with your audience, promote the event through social media and email, and interact with attendees via Q&A sessions. Prompt users for feedback after positive experiences, set up referral programs with incentives, and always respond to user reviews to build trust and loyalty. Start implementing these tactics and watch your app soar! Read the full article for more details: https://blog.mvplaunchpad.agency/10-low-budget-ways-to-market-your-app/", "target": "negative"}
{"text": "Hi folks, Quick question for all you product owners, indie devs and startups out there: Would you be down to try a tool for gathering and managing product feedback thats basically like Canny (you know, the one with voting boards, roadmaps, user segmentation, integrations, etc.) but 70% cheaper? I know there some alternatives of canny in the market, but still they are charging only 5-10% less than Canny. Im talking serious savings without skimping on the core features that make feedback loops actually useful. Ive been using Canny for my side project and love it, but damn, the pricing adds up quick. If something popped up thats got 70% of the bells and whistles at a fraction of the cost, Id jump on it in a heartbeat. What about you? Would price be the deal-breaker, or are there specific features youd need that might make you stick with the big names? Curious to hear your thoughts, upvote if this sounds intriguing, and drop a comment if youve got recs or experiences! Thanks", "target": "positive"}
{"text": "The journey was simple: post, repeat, adjust, and post again. This solo creator focused on short-form videos with trending sounds and niche topics. It wasnt glamorous  but stacking small wins turned into something big. As the audience grew, brands saw value in long-term deals. What started as a side hustle slowly became a $20K/month business.  Behind the scenes, many rely on tools like Crescitaly to support that consistency.", "target": "negative"}
{"text": "The latest data I could find says that 27 million Americans are essentially solopreneurs. That's about 80% of all small business in the country. That's a pretty new phenomenon in the grand scheme of things. From 2000 to 2021, the number of solopreneurs increased by 72%. People say this is for all kinds of reasons, like the rise of the gig economy, remote work, and a growing desire for flexible work arrangements. I've got more stats, but I'm really just interested to hear from you all about whether you feel like this is real on the ground.", "target": "negative"}
{"text": "Hi everyone, I was one of perplexity users for a while and to be honest at the beginning it was just perfect, but in the last few months they started to charge more for just integrating new models where tbh I see that they have the same performance. So I decided to see an alternative, searching probably for an open source on github but I didn't find anything so that's why I have decided to build an open source one so if you're interested leave a comment I will share it with you", "target": "negative"}
{"text": "As the title says, I'm building a GIF Maker app solo in 6 months. Documenting the journey here.", "target": "negative"}
{"text": "Mapping out my GTM is overwhelming in itself, but throw in all the tech choices available and I feel like I'm in crazy town! Since I'm bootstrapping, I want to be scrappy, and I'm curious to see what other founders are using. What are you using for prospecting and lead acquisition? For nurturing and automation? CRM and deal pipeline? Attribution and onboarding? Cold outreach and sales dashboard? Bonus if you're also building a subscription-based SaaS.", "target": "positive"}
{"text": "Hello! Just updated, 10 additional languages added, let me know hows the localization. I built this app as a solo indie dev to give people a powerful yet simple way to scan, edit, and manage PDFs  without subscriptions, clutter, or data tracking. To celebrate the bigger update, Im running a promo  grab the Pro version for FREE for the next 2 days!  Why PDFForge?  High-Quality Scans  Capture sharp documents with smart edge detection  Bulk Scanning  Scan multiple pages at once  perfect for notes, receipts, or multi-page files  Full Editing Toolkit  Reorder, rotate, duplicate, or delete pages with ease  Annotations & Signatures  Highlight, underline, add text, or sign directly in the app  Smart OCR Recognition  Convert scans into editable, searchable text instantly  iCloud Sync  Keep your PDFs accessible and updated across all your Apple devices  Privacy First  Clean interface & zero data tracking What Im Looking For: Feedback on usability, design, or missing features Suggestions for improvements or pain points Thoughts on how it compares to other PDF apps  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Every bit of feedback means the world to me as a solo indie dev  thanks for helping me improve PDFForge !", "target": "negative"}
{"text": "I downloaded dimensional a few weeks ago and I LOVE the personality tests and learning things about myself, but 70% of the content and tests are locked under a yearly 59.99 subscription", "target": "positive"}
{"text": "Ive always believed that pets arent just animals. Theyre family. But caring for them can get overwhelming  vet visits, meds, vaccines, weight tracking, and more. So I built Fidos Bark, a free iOS app to keep your pets health organized in one beautifully simple app. Features include:  Track meds, vet visits, and appointments  Share updates with pet sitters, family, or the vet  Add notes and photos  Track multiple pets in one place The app is free and live now if youd like to try it: https://apps.apple.com/app/id6744088514 If you try it out and have recommendations for features youd like to see please let me know. Thanks in advance!", "target": "negative"}
{"text": "Do you know apps accessible on ios that help you track habits? An app that shows a circle diagram, and has a function to record time and not just count down time. Preferably aesthetic and easy to use. And an app thats free, if possible The closest I got to these criteria are YPT and iHour. However, YPT does not include a circular diagram displaying time spent, while iHour doesn't have a time record option. I really wanna use an app to keep track of things and to yk see how im spending time. I've tried tons of apps but most often they weren't free or could only keep track of around 5 habits. I'd love to find an app where I dont feel like checking in as a chore. Because thats what most often happens and I either end up not doing anything (just to not open the app and search through the options then start the timer, etc) or I just dont use the app", "target": "positive"}
{"text": "I tried using canvas bulk create feature which could have been great but it doesnt work with different videos just images so any ideas where i can rapidly do this? For now im using capcut but is very time consuming when i have to edit more than 20 reels Thanks", "target": "positive"}
{"text": "Okay so... I genuinely hate Wix so much. Like, I know I haven't used many website editors and I get that this is supposed to be for beginners but holy shit this has been the most frustrating thing I've ever had to do. I genuinely wish I never started this. Like if I had to make a website builder, this would literally be my perfect example of what NOT to do. Nothing is consistent!! It'll constantly make random changes - like cropping my logo differently every single time for no reason?? And stuff just isn't where it would make logical sense to put it. The editor is just... it's so poor. And then - AND THEN - all they do is try to get you to use their premium bullshit. I'm trying to do something simple and they're constantly trying to sell me these \"premium services\" that their website can supposedly provide. It's absolutely mind-boggling. Look, I haven't used any other website builders, but if I hadn't already spent so much time trying to push through this nightmare, I would tell everyone: DO NOT use Wix. Do literally anything else. I genuinely just came here to post this because I've spent the last WEEK trying to get this website to look halfway decent and I'm just losing my mind. Like why is everything so inconsistent?? Why does it keep changing things I already set up??? Anyway... needed to vent. If anyone has better alternatives please let me know because I'm about ready to throw my computer out the window.", "target": "positive"}
{"text": "Hey everyone, I've been a long-time lurker here, and now I'm finally at a point where I could post... but I'm honestly struggling to even hit the submit button. For the last two years, every single day, I've been working on creating a massive, detailed OSCE (Objective Structured Clinical Examination) course for medical/healthcare students. We're talking hundreds of hours, countless cases, detailed mark schemes  the works. It's been my entire life. The website is built. The content is uploaded. The payment gateway is set up. It's literally ready to go. I planned the launch for this week. And now... I'm completely frozen. It's like all the motivation and drive I had has vanished and been replaced with sheer terror. -What if no one buys it? -What if it's not as good as I thought it was? -What if I get negative reviews? -What if I've just wasted two years of my life? My anxiety is through the roof, and I'm cycling between feeling numb and feeling a deep sense of depression. The self-doubt is overwhelming. The thought of actually promoting it makes me feel physically ill. I guess I'm just looking to see if any other solo founders or entrepreneurs have hit this exact wall right at the finish line. How did you get past the paralysis and just hit \"go\"? Any advice or even just some solidarity would mean the world right now. Thanks for listening.", "target": "positive"}
{"text": "Maybe I have forgotten something somewhere along the way. Let's say that a large brick and mortar takes interest in carrying my products. Let's say they want 50,000 units. That could be like $200k just to get those units to the retailer.... What is a financial institution going to want to see to give a loan for that much??? I hear that a retailer probably won't pay for the actual purchase order for 3-4 months after getting the product. I wouldn't have $200k even in a 401k to use on a loan or such. Can I tell the retailer that I won't sell 50,000 units to them and I need them to start with like 10,000 units or something? I'm just an average income guy right now working a job and doing my business stuff on the side. What method did some of you all use when a large purchase order came along? Thanks8", "target": "negative"}
{"text": "Hi all, I run a small custom jersey business for almost 2 years. I will ask customers pay an amount for deposit to see the design before confirming their order. If they proceed, The amount is deducted from the final bill. If they dont, its supposed to be non-refundable. Heres the situation: Some customers pay the deposit but then disappearred without confirming their order. I don't feel like the deposits hanging in my records forever, because it looks like an unpaid liability. My initial thought forfeit the deposit after a period. But is it proper (and reasonable) to forfeit the deposit after a period of no action? For other small business owners: how do you handle this? Do you forfeit deposits after a time limit, or let them stay valid forever?", "target": "negative"}
{"text": "Curious to see how people would use them. I have a friend who wants to help me but I dont know how he could help", "target": "negative"}
{"text": "I honestly hate social media but Im a small business looking to grow & I know I just need to do it & figure it out. I have no aesthetic & thats the ultimate problem, I dont know how to make my page look cohesive & cute. Any tips that can be offered on how to do this? Maybe an online course? An app to make reels? Idk Im open to all the help I can get.", "target": "positive"}
{"text": "Hey everyone, I just launched my spices business and am getting orders from banglore, Mumbai, Delhi, etc. Its getting really hectic as I dont have a proper shipping in place and I'm relying on shiprocket. The issue is how do I decide shipping prices? It keeps varying according to states, (understandable), but how do I tell the customer upfront? Right now I'm literally manually entering the to and from address and trying to find out the rates and I then inform the customer. Help me out guys, Im in a desperate need of advice. This question might be a little dumb but I've never done anything like this so I'm anxious af lol. I also lost 2 customers because of SHIPPING issues, makes me wanna cry so pls help guys!", "target": "positive"}
{"text": "Im starting a completely legal business, but one in which discretion is necessary. Does anyone have any opinions on which payment methods are the best/easiest, but wont let them see my person info, or let me see theirs? Thanks!", "target": "positive"}
{"text": "Pickleball has always had this your uncle in New Balances plays it kind of reputation but the truth is, its exploding. Courts are packed, waitlists at clubs are insane, and people who swore theyd never touch a paddle are sneaking in games before work. Us 3 brothers thought: what if we made an app that actually makes pickleball feel cool ? Track your matches & see your rating move up/down Earn badges & bragging rights for how much youre playing. Build your crew and follow friends to see where theyre playing next. Earn money or rewards for playing. book courts This is how we will integrate with different products and businesses that we want to integrate this app with We just launched PKL and want honest feedback from people who dont already see themselves as pickleball die-hards. And be brutal  if it feels cringe, tell me. Can you track your matches easily What type of integrations does it need immediately What would get you to actually download & play with your friends? Were trying to take a sport that looks like a backyard hobby and flip it into a culture takeover. If you want to test it out and maybe roast it in the process  heres the link: PKL", "target": "negative"}
{"text": "Basically the title. I come from a very non traditional background and am working a job doing growth strategy for a restaurant chain. The job is good but I want to make some extra income on the side and also stay tapped into the startup ecosystem. I recently graduated from my MBA and gained many skills related to the field plus Ive done a lot of what a consultant does without actually working in a consulting role due to my past experience in startups. I want to know how difficult it would be to get clients for small consulting projects and what services are on demand right now to improve my chances of success in this. I understand this may be a somewhat vague post so Im happy to answer any questions but in short. Is finding solo consulting work with no consulting background feasible? I know this sub is more about small businesses but I thought this could be a good place to get advice on starting this side hustle which is a small business in itself and trying to work with other small or growing businesses", "target": "negative"}
{"text": "Hi everyone! I registered my llc through northwest and also opted for the non P.O. Box mail forwarding service they provide for $20/mo. I got my EIN a few weeks ago using the address northwest provided (filed myself bc they wanted to charge $50 to fill in three lines of text a total scam if you ask me) and am now trying to open a checking account with Amex. I know local credit unions are better but my local credit union has a really bad rep and I also didnt want to use any finance apps like Mercury over a BANK bank if that makes sense. While filling out the application online it asks for the business address but says note you cannot use a P.O. Box, a commercial mail receiving agency (CMRA) or a registered agent. I understand the no P.O. Box thing but I dont understand why the other two arent allowed, is it just so they arent responsible if the CMRA company doesnt do their part and your mail gets lost it covers them legally or if I use the northwest mailing service address they will be within their rights to close my account down the line if they so choose? I dont need to lend any money I only need an account to keep the expenses separate for taxes and other stuff Im also not even getting any revenue and wont be for a while Im still working on a draft with a patent attorney for my future product. I was planning on just doing a capital contribution and use that money to buy stuff for prototypes because its made in house I need the materials and tools to make it Thank you for reading apologies for grammar", "target": "positive"}
{"text": "Hey everyone, I've been researching why small businesses struggle to get consistent customer reviews, and I discovered something interesting: timing is everything. Studies show that customer satisfaction peaks within the first 3 days after a service experience, but that's exactly when most businesses go silent. I'm developing a software to solve this timing gap. Instead of hoping customers remember to leave reviews weeks later, it automatically reaches out during that optimal window when they're most engaged and willing to share feedback. Some valuable insights I've uncovered that might help any business owners here: 72% of customers will leave a review if asked at the right time vs. only 15% who do it spontaneously Automated follow-up increases review volume by 200-300% on average The 3-7 day window has 4x higher response rates than requests sent after 2+ weeks Businesses with consistent review flow see 23% more foot traffic (according to BrightLocal's 2024 study) Quick validation question for business owners: What's your biggest challenge with getting customer feedback - is it timing, knowing who to ask, or something else entirely? I'm looking for a few business owners who'd be open to sharing their current review process challenges. Happy to share more research findings that might be helpful regardless of whether you're interested in the solution. Thanks for any insights you can share!", "target": "negative"}
{"text": "Hi, my partner and I want to start a small business together (each currently earn 55-68,000 annually, mortgage payment of $700 per fortnight). What are peoples thoughts/experiences on Jims Laundry and Jims Test and Tag?", "target": "negative"}
{"text": "My biggest customer got bankrupt and took a whole lot of our profits. Now we either get more clients or close down and we are at a loss due to not getting paid by previous customer and now we are in over our head.", "target": "negative"}
{"text": "Hey folks, I run a Facebook group with about 8,500 members all focused on hair loss discussions . The group is pretty active, people share tips, treatments, products theyve tried, etc. Now Im wondering how do I actually monetize this?  Has anyone here successfully monetized a niche Facebook group? Whats the best strategy that keeps members engaged but also generates income? Would love to hear real experiences.", "target": "positive"}
{"text": "Movie clips online are tuff, but when I ask what movie a clip is from, the comments are full of trolls. Ive been building an app that identifies movies from short-form content in seconds. Built with Expo + Whisper.cpp via the Expo Modules API. Not finished yet, but aiming for TestFlight in ~2 weeks. DM me if youd like to try. Would love feedback on the idea or features!", "target": "negative"}
{"text": "Hey guys, Ive been working on this app for a while now. I wanted to make something a little different from the usual journaling apps, instead of just giving you a blank page, I thought it would be better to ask the user 30 questions, one question everyday of the month. After the 30 days, the same questions repeat, but you get to see how you answered last time, allowing you to see how you've grown as a person over time. It's been fun building this and I think it makes journaling a lot more fun and a lot more meaningful. I would love to get some feedback on it so here it is", "target": "negative"}
{"text": "Ive spent over 10+ years in digital marketing and managed more than $10+ million in ad campaigns for top brands. Now Im working on my own, and I want to use my skills to help others get started. Heres what Im offering for free:  A custom WordPress website built just for you  Facebook and Google Ads setup and optimization  A marketing strategy to help you launch with confidence If youre a startup or small business trying to get off the ground and need expert support with zero upfront cost, Im here to help. Drop a comment or send me a DM if youre ready to start.", "target": "negative"}
{"text": "Just made $7.5, but Soon will reach $100M", "target": "negative"}
{"text": "When I started this project, I thought the pain point was simple: friends send me Spotify links, Im on Apple Music, and I cant play them. So I built a quick fix for single-song links. But after posting yesterday and reading replies, I realized something bigger: people care way more about converting entire playlists. That was eye-opening. Lesson learned: even if you solve your own problem, listen closely to how others respond. Sometimes the real opportunity shows up after you launch, not before. Im now working on playlist conversion (while my tool songhop.to handles single songs today). For anyone else building in public: dont get too attached to your first idea of the main problem. Let your users pull you in the right direction. Not the other way around.", "target": "negative"}
{"text": "https://asistbase.com - basically a cheap alternative in this niche, there's also a free plan if anyone wants to try. Very easy to setup on your business page, dm me if you need help with that!", "target": "negative"}
{"text": "Hey everyone! A little while ago I shared I made a 100% free tool to remove image backgrounds  no limits, no signup required! and a bunch of you liked the results. So I went ahead and wrote up everything, including the full code, in a detailed guide on Medium. Link to the guide: https://medium.com/@aziz_11785/how-to-remove-a-background-from-any-image-for-free-1c14e9ca2b8f Whats inside: Full Python code using U2Net (ONNX) + onnxruntime FastAPI endpoint that returns a transparent PNG Step-by-step setup (pip install, run, and test with curl/Postman) Tips for best results and ideas for integrating it into your workflow It runs locally, is totally free, and theres no signup or limits. If it helps you, an applause on Medium and a quick comment would mean a lot and helps more people find it. Also, Im open to feedback and feature ideasbatch processing, a simple web UI, etc. Thanks!", "target": "negative"}
{"text": "Hey folks, Been a minute since the last post! My buddy and I got most of the core features done, but hit a pretty annoying roadblock. We trained a few voice models, data quality seems decent, but the output still sounds kinda raspy and the pitch wobbles. Lowkey driving us nuts ngl... we even double checked our gear wondering if somethings wrong with it  Turns out this is way more work than I thought (classic side project story lol). But were learning a ton, fix one thing, break another, repeat. Really hoping it all comes together in the end. Hoping to have something out soon! If anyones down to test an early build (Mac only right now) and share some feedback, just drop a comment or DM. Cheers! https://preview.redd.it/6nlfxwms83lf1.png?width=1394&format=png&auto=webp&s=5ea9dcdfa78d76ddd4d93b206587cf44b0387f7e", "target": "negative"}
{"text": "Ive been building SiteAI Agent  point it at your site/FAQ, it trains in minutes, and you drop one JS snippet to embed. Im not sure about: Are answers good enough before adding more capabilities? What would stop you from trying it today? Demo: Chat Agent  Ill set up 3 free pilots this week and share results back here. If you want in, comment your site URL (or DM me if youd rather keep it private).", "target": "negative"}
{"text": "Hey, I'm RepublicDefender78 and I'm sort doing this thing. Years ago I had a job as a content creator but before Youtube. Back then I could only write copy. Since then I've gone pro in something else but have found myself really enjoying playing with stuff like clipchamp and obs. I also stumbled upon a game called Helldivers 2. As I have combined all this hobbies coupled with my concerns for my fellow man in general, I kind of grew a thing. I call it a podcast but it is exclusively on Youtube. I fancy it as my attempt at coming to terms with hiding in my house playing Helldivers when I'm not hiding in my house working. But, just like building a model I still want it to look like what I imagine. So I've been working with ChatGPT do make this informational webseries that doesn't hide that it's struggling to entertain and inform earnestly because no one asked. I could use some feedback. The most recent episode is a pretty significant change over previous episodes. Any thoughts would be greatly appreciated.", "target": "negative"}
{"text": "I suck at marketing. Ive tried learning, Ive tried applying - it just doesnt click. My social media communities are tiny, and honestly Im done fighting it. What I am great at is coding. Really great. Thats my strength, and its time to double down on it. They say master one thing - so I will. This year alone Ive built 5 (maybe 6, Ive lost count) products. I even posted daily. Zero traction. Either Im cursed, doing it wrong, or both - but it doesnt matter anymore. And you know what? Its fine. Ive seen worse. But this hustle culture where you plan, build, market, and maintain everything alone? Thats just too much. Screw it. Next time I build, I wont do it solo. Ill find a marketing partner and grind together. For those still pushing - I hope you get results. It didnt work for me, but it might for you. Love ya all:) As for me, Ill stick to what I do best: building. I know how, I love it, and it works.", "target": "negative"}
{"text": "Hi all  Id like to introduce QuickSummary , my first AI summary app. I built it because I couldnt find a good AI summarizer on the market  most were missing key features or locked everything behind high paywalls. As someone who uses AI summaries a lot, I really wanted something better. What makes QuickSummary different is that its completely free, lightweight, and utility-focused : Summarize from anywhere in any apps AI chat to ask question Lightning fast & smooth performance Free forever + you can even bring your own Gemini API key After just a week since release, the app has already reached 7k+ users . I honestly couldnt believe it! I think its because QuickSummary makes a good tool that really fits the needs of many people  and I believe it might even be the first truly free AI summary app on the market. Since its free & open source , anyone can try it out, give feedback, or even contribute to development. Id love for you to check it out and help shape where it goes next.  App Store: https://apps.apple.com/us/app/summary-ai-quicksummary/id6748961856  GitHub: https://github.com/spaceman1412/QuickSummary Thanks for reading", "target": "negative"}
{"text": "i made a quick website to help solve a problem i have. i usually read about some things in the news or stuff which i have no clue about, the most recent example was the enron scandal. I had always heard of it but never really knew what it was and I never felt like searching it on google and reading a bunch of articles etc, i like learning through videos or podcasts. so i made a website that solves this for me, it includes videos, articles (wikipedia for now) and podcast related to the search topic. I have loved listening to podcasts about these things since they go much more in depth and give me a better understanding, heres the link: https://kno-three.vercel.app/ corny name ik, im not super creative please leave feedback, i have no clue what im doing as you can guess by the long rant", "target": "negative"}
{"text": "Hey everyone! Im working on a bookmark manager app, inspired by Ra*ndrop.io. I really like their service, but every time I used it, I found myself wishing for more attention to UI and small details. Right now, I already have the core app running, a few integrations in place, and the Chrome extension is almost finished. Already done: - persistent copies - automatic categorization (yes, thanks to LLMs) - nested folders and tags - flexible sharings with realtime updates - comments/notes - Telegram integration and a lot more. My goal is to make this something truly great - and Id love to shape it further with your feedback. So, Im looking for a few early testers. If youre interested in trying it out, please DM me - Id really appreciate your thoughts.", "target": "negative"}
{"text": "Hey Folks Ive been flipping electronics on the side for a while, mostly electronics from Facebook Marketplace that I resell on eBay. Its decent side income, but the process was inefficient. Every time I saw a potential deal, I had to: Manually search the title on eBay Estimate the resale price Factor in shipping, eBay fees, and desired margin Do all the math to figure out what I could offer and still make a profit Too many tabs. Too many missed opportunities. So I built something better. Introducing Flipr Flipr Overview Image A Chrome extension that simplifies the decision-making process. Heres how it works: Browse Facebook Marketplace with Flipr extension active. When you see an item, hit the \"sold listings\" button  it opens a new tab with a pre-filled eBay sold search for that items title. Based on the eBay sold history, pick a target resale price , plug it back into the extension, and enter: Your estimated shipping cost Your desired profit margin (%) The product category Flipr runs the numbers and gives you:  eBay fee breakdown  Profit estimate  A suggested maximum offer you should make to hit your margin goal Its clean, fast, and already saving me time while increasing ROI. Why I'm posting here: Id love feedback from folks. especially those whove built Chrome extensions, pricing tools, or anything related to ecommerce/marketplaces Curious what features would actually make this more valuable Also open to monetization input (freemium extension vs standalone SaaS dashboard?) Heres the landing page if you want to check it out:  https://fliprtool.com Happy to answer questions or go deeper on the tech behind it. Appreciate any thoughts!", "target": "negative"}
{"text": "I have created a news digest tool that turn clickbait news headline into honest headline ( https://www.oneminutenews.org ). The tools has no monetization implemented for now, and I need a revenue model to cover for the hosting and API cost The thing is I am not sure what features would people want to pay for. Love to listen to any idea!", "target": "negative"}
{"text": "It is always difficult to find and reach customers, so I thought why not build for an audience that is all in one place. I built a Micro SaaS specifically for a 12K member Subreddit - People were sharing certain information regularly in that subreddit, I simply took it and put it in a website in a directory format - which is secure, easy to search and filter. I got 600 sign ups with just 2 posts, ~130 people started creating content directly on my site, and I got 7 paying customers since I added monetization a couple of weeks ago. It could have been more, but I gave extended free trial for all existing users till Sept 1st. So, hoping they would convert from Sept. Just wanted to share this here like a playbook that maybe you can try as well: Two biggest problems - Finding an idea to build, & Marketing it. My advice - Choose a Subreddit with 10K to 30K members and build a product around it. Why? - because each subreddit is already a niche, and if it has at least 10K members then I would consider it validated - people have gathered there because of a problem - either they need information or a community support. How to start? - look at the subreddit communities that you are already a part of for personal interests, not for business purpose, and choose one. Since you would already have a good understanding of the problem/needs of that subreddit community, you can start helping them by providing valuable information and slowly mention your newsletter/directory, and build an audience. Then you can expand into discord/webapp/micro SaaS/mobile app etc. If you can build and own your audience, then you can think of hundred ways to monetize it. Here is the best part, all the information you need to start would already be present in that subreddit itself, you just have to curate, organize it, maybe add your perspective, and make it easier to read/search/filter. Also, all your 'target audience' are in one place, so you can do cold DMs to reach them for free. Imagine a 50% sign up rate from a ~20K member highly engaged community! (..of course it won't happen in one day). Here are some things you can target to get good results: The subreddit should be between 10K to 30K members (these smaller subreddits are more engaging, and are not heavily moderated, you can promote your links as long as you are sharing information or helping the community.) Choose a Sub which is Non-tech and B2C. The subreddits should not be related to 'money making'/'finance'/'business' etc., because it's too competitive and also they don't allow promotions or linking your product. Find such communities which are just regular people who came to discuss their common interests, talk about their issues, or maybe just for community support online because maybe they can't share this with anyone in their real life. (People say all the good ideas are already taken etc. but you would be amazed to see what kind of niches exist in Reddit, which are completely untapped! And am not even talking about NSFW category.) Think of this as a long-term project, don't rush in to promote your product. First establish foundation and trust, and REALLY help the people (I can't stress this enough) - Money will come eventually if you provide enough value over time, but don't focus on it. I built so many products but nothing worked. But then, I tried this approach and it is working for me so far.", "target": "negative"}
{"text": "Im working on a SaaS idea that Im pretty confident solves a real problemIve seen tons of people complain about it on Reddit and in Google reviews. But instead of burning a few thousand building it out, I decided to put together a quick MVP to test the waters and see if anyone would actually sign up. After launching, I tried everything I could think of to get traffic to the landing page: Google Ads  got clicks but literally zero signups X (Twitter)  everyone says its a goldmine for startups, but with no followers my posts just get buried Reddit  posted in relevant subs without shilling, but no real engagement TikTok  a few short clips, only 50100 views each So now Im stuck. Do I keep pushing the MVP even though it feels like Ive hit a wall, or do I take the leap and actually build the tool? With just a landing page, its hard to do proper outreach or let people try anything. If the tool existed, I could start showing it around, maybe even get UGC creators to make content with it. What would you do if you were me? Would you risk building without much validation, or is there another way youd test demand before committing?", "target": "negative"}
{"text": "Now OBVIOUSLY... Everyone wants to have their work make a profit, whether in the actual bank or the mental bank. But when building a project.. Do you start with the end goal in mind? Or are you building it because you have a passion and hope people will see the passion you have with it I know passion is more of a flare word that has a deeper meaning that is only tied to the person who has the idea/passion for something.. But when it comes to something with a complex build that takes the passion you have for something and puts it in the palm of your hands.. How do you walk that line of \"Doing this for the love of the game\" opposed to \"doing this because I love the game, but I also love being able to pay to eat, and this thing i've invested a year in, doesn't fulfill the passion anymore and i'm broke....\" What is some advice on being able to sustain both?", "target": "negative"}
{"text": "Hey everyone, I recently launched a simple unit conversion website and would love some feedback on the site itself. My goal was to make it lightweight, fast, and easy to use on both desktop and mobile. Things Id especially like feedback on: Overall design and usability Clarity of the interface Mobile experience Anything that feels missing or unnecessary Heres the link: unitsandconversions.com Thanks in advance for any thoughts. Both positive and critical feedback are welcome!", "target": "negative"}
{"text": "Heres the truth: Notion is amazing, but its heavy to set up. FlowTask is my attempt to simplify - one prompt, instant workspace, with an AI (FlowBot) that actually works inside your docs and tasks. But I dont want to waste years building if the market doesnt care. Do you think theres space for this alongside Notion, or is it a dead end? Brutal honesty is welcome -if its not worth it, Id rather hear it now. If you're curious: link", "target": "negative"}
{"text": "I built something using only free AI tools heres what I learned along the way Body: Hey everyone  Ive been experimenting with free AI tools to build something meaningful no budget, no ads, just creativity and automation. Over the past few months, I designed a system using: ChatGPT for content and outreach Canva for visuals and branding Notion AI to organize and streamline workflows Gumroad to share what I built I documented the entire process, including the tools, templates, and lessons learned. If you're curious, the full guide is pinned on my profile. Here are a few things I discovered:  Minimalist branding and emotional storytelling resonate more than flashy tactics  Free tools can go surprisingly far if you combine them strategically  Reddit and Pinterest were my most responsive platforms  Automation without clarity leads to burnout  Trying to be everywhere at once weakens your message Im happy to answer questions or share templates if anyones building something similar. Always open to feedback and new ideas", "target": "negative"}
{"text": "Ive been working on a service API that deals with very large JSON payloads. My non-technical colleagues struggled to read or edit JSON directly, and most of the existing tools were either clunky, outdated, or ridiculously overpriced. So I built Jsonite  a lightweight, free JSON grid editor. Instead of working with raw JSON, you can view and edit documents in a clean spreadsheet-like editor with: Keyboard shortcuts youd expect (copy/paste, undo/redo, find/replace, etc.) Instant editing with possibility to switch between grid/text view Privacy by design since your data never leaves your browser and nothing is sent to a server Although I originally made it to help my teammates, I soon found myself using it too, and I've been finding it pretty useful when dealing with large and complex data. Its completely free to use (both personal and commercial). Hopefully it can save you some headaches!", "target": "negative"}
{"text": "I'm a developer who listens to music 8+ hours a day while coding. My static wallpaper was depressing me. So I built MuMood - it changes your Mac wallpaper to match whatever you're listening to on Spotify/Apple Music. The results have been surprisingly mood-lifting. Jazz = warm tones, electronic = vibrant colors, lo-fi = soft gradients. It's subtle enough for work but makes the desktop feel alive. Been using it for months, figured others might enjoy it too. Free download: mumood.com Anyone else obsessed with their desktop aesthetic?", "target": "negative"}
{"text": "Hi everyone, Im currently based in Belgium and have been thinking a lot about potential business projects here. I dont have a specific sector in mind yet, but Id love to connect with people who are also interested in entrepreneurship, exchanging ideas, and maybe even collaborating on something in the future. One advantage I bring is that Im already legally established in the country, which makes things easier when it comes to the practical/administrative side of starting a business. If anyone is exploring opportunities in Belgium or simply wants to share experiences about the local startup/entrepreneurship ecosystem, Id be happy to chat. Thanks!", "target": "negative"}
{"text": "Guys, gotta ask the room. Solo founder of an AI startup here. After a long grind, I've finally gotten this thing profitable, and honestly, it feels incredible. But man... is it just me, or is this path insanely isolating? I've been trying to find like minded people to connect with, and it's been rough. I feel like I keep running into the same types of people: The \"idea guys\" who have a million-dollar plan but have never shipped a single thing. The people who are just kind of half-assing it, without any real commitment. The founders who are so stuck on their own idea or ego that you can't have a real, honest conversation. I'm just looking for other people who are actually in the trenches, building and debugging and grinding it out. Is this just a normal part of the process that nobody talks about? lol. Seriously, anyone else going through this, or is it just me?", "target": "negative"}
{"text": "I just launched my SaaS called WaitLess, and Id really love to hear your thoughts. Its a queue management system for any business, salons, clinics, restaurants, auto shops, offices, you name it. How it works: A customer calls or checks in  theyre added to the queue. They instantly see their position and estimated wait time via a live link. They get notified 15 minutes before and when its their turn. This way, businesses reduce walkouts and keep customers informed without crowded waiting rooms or frustrated lines. Heres the live demo if youd like to try it: www.getwaitless.com Since this is my first SaaS, Id really appreciate your honest feedback: Does this solve a real problem for businesses? What would you expect in terms of features or pricing? Thanks in advance", "target": "negative"}
{"text": "Me and my two team members have been building for about 13 months now. We had to pivot a few times. the bugs, features, mismanagement of time and resources, state of something or the other always not working - I have felt when we did have people trying us out, they probably could not achieve what they set out to do. Now, a little exhausted but am feeling confident of the state we are in, progress has been a lot slower than I anticipated and we are at 0$ MRR but I think think we are back on track, now I can really start to market it as I had envisioned. I did feel we loose precious time but - I am hopeful of things getting better now. Step 2: Market, events, posts and continuous engagement --> feedback, bugs --> fixes, and repeat. Goal is to get to 500$ MRR, wish me luck!", "target": "negative"}
{"text": "Hello everybody, I've been developing a utility piece titled FlowTask, and I am completely torn about decisions now. The general concept is: Instead of spending hours coming up with systems (as in Trello, ClickUp, Notion), you just type one prompt  FlowTask generates a structured workspace with tasks, docs, deadlines in a snap. Example Write \"Plan a Black Friday sale\", You are given a plan deadline, checklist for marketing, and copy prompt samples. Write \"Research competitor pricing\", You receive a workspace for notes + tasks to accomplish in an organized manner. On top of everything else, I just made FlowBot: It is a context-sensitive AI residing within your workspace. Rather than canned responses, it reads what is already on the page and responds specifically. Example: Upload a contract, Click \"highlight risky clauses\", it highlights problems straight in the doc. Or: Ask it to \"summarize these meeting notes\", it condenses them into neat bullets in real time. Where Im stuck is this: Some folks show me this is a productivity game-changer, \"skip the setup, start executing.\" Others comment, \"All it does is what it does now.\" So let me ask in complete sincerity: Would you really use some such service as FlowTask in everyday life? If yes, whats the #1 use case where it saves you time? If no, whats missing or what would stop you? I do not wish to invest my time in developing something nobody cares about. If this has legs, I'll double my efforts. Otherwise, I'll pivot. Any real feedback (good or harsh) is gold for me. If you're curious: link Thanks,", "target": "negative"}
{"text": "None of us can stick with calendar apps. Tried everything, same story every time. The problem hit me late one night. Want to add \"lunch with mom tomorrow\"? Suddenly you're filling out forms. Title, time, location, alerts... I just want lunch on my calendar. When did this become paperwork? AI calendars were supposed to help. Now you type \"lunch with mom\" and get restaurant suggestions, weather updates, traffic reports. The lunch still isn't scheduled. So we built Trace differently. One input box. Say whatever. It handles the rest. \"Team meeting tomorrow 2pm\"  done. \"Cancel Friday's workout\"  gone. \"Move dinner to 7\"  updated. Making it simple was brutal. Users see one text box, but multiple models work behind it figuring out what you mean, when you mean it, what conflicts. Here's what I learned: people don't want to see your AI work. They want their stuff handled. Every time we showed off the tech, users got distracted. People don't want revolutionary planning. They want their current process to suck less. Since launching paid in February: 400 subscribers, zero ads. Anyone else noticing this? Users seem to prefer when AI just shuts up and works. We're on Product Hunt today - curious to see how this approach resonates with a bigger audience. Kind of nervous but excited to get it out there. Product Hunt: https://www.producthunt.com/products/trace-16 Download on App Store: https://apps.apple.com/us/app/trace/id6503812022", "target": "negative"}
{"text": "A few years back, a small VC firm thought theyd found a winner. The SaaS they invested in was pulling in $60,000 a month in revenue not bad, right? Thats over $700k a year. On paper, it looked solid enough. Customers were paying. Growth seemed possible. And the market was hot. But underneath the hood? It was a ticking time bomb. The company was burning $170,000 every month to keep the lights on. That meant for every $1 coming in, almost $3 were going out. Still, the investors told themselves: Growth will fix this. Just give it time. At first, churn was under control. Customers were sticking around. But then, net retention slipped from over 100% down to around 85%. Instead of asking Why are people leaving? Whats broken in our product? the leadership blamed the customers. And instead of cutting burn, laying people off, slashing spend, forcing a reset they said: Well grow our way out of this. It only got worse. One co founder left. That should have been a wake up call. A chance to reset. But nothing changed. With cash dwindling, they did a least worst merger with another struggling SaaS, hoping two weak companies could magically become one strong one. You can guess how that ended. Equity holders? Wiped out. The company? Gone. The Lesson Revenue isnt enough. $60k/month looks great on a tweet, but if your burn is triple that, youre dead man walking. Retention is oxygen. When it slips, fix the product, dont blame the customer. Culture  survival. Sometimes you need to make brutal cuts to live another day. Even with $60k coming in every month, this SaaS collapsed in slow motion simply because nobody had the courage to slam on the brakes. Source: Autopsy of a SaaS Death  Blossom Street Ventures", "target": "negative"}
{"text": "Looking for what others use for their apps and why ? To create my own stack based on the needs of my app.", "target": "negative"}
{"text": "We tried so much but dont know whats the best most scalable way to do it. Cold email? Cold call? Conference? Industry meetups? Were building AI tools for a legacy vertical.", "target": "negative"}
{"text": "People are addicted. Heres the deal: every productivity app swears itll make you more organized. Tags, colors, subtasks, Kanban boards, recurring reminders. You end up spending more time organizing than actually doing. So I flipped it. You add a task. It auto-deletes in 24 hours. Gone. Forever. \"Finish investor pitch\"  better hurry. \"Buy groceries\"  or youre eating rice and ketchup tonight. \"Clean bathroom\"  too late, now you live in filth. The app doesnt care. Its brutal. It makes you care. We called it \"Amnesia.\" Heres the insane part: people love it. Turns out nobody wants eternal lists of guilt staring at them. They want consequences. Urgency. Survival. Making it work was harder than it sounds. Phones try to save everything. Syncs, backups, archives. We had to fight the entire software ecosystem just to let you forget. Now users brag about it. \"I crushed 10 tasks today because otherwise my phone was going to wipe them.\" In three months: 1,200 paying users Zero features added Negative roadmap (we delete ideas before building them) -$5k MRR Heres what I learned: sometimes the dumbest, most hostile idea is exactly what people stick with. Should we even launch this publicly? Or just keep it underground for the productivity masochists?", "target": "negative"}
{"text": "Been looking into B2B SaaS self-serve onboarding recovery. The gap with e-commerce is confusing. E-commerce (Klaviyo benchmarks): Abandoned cart recovery: $3.65 per recipient 3.33% conversion from recovery alone Top performers: $28.89 per recipient B2B SaaS: User abandons onboarding... \"We miss you\" after 30 days Detects where they got stuck... Nope Recovery metrics... \"We don't do that.\" Does anyone have a tool that actually solves this for B2B SaaS?", "target": "positive"}
{"text": "I am building a end to end encrypted zero knowledge file management system. Here you can store your data and only you can read the date even we can't. https://doclet.app", "target": "negative"}
{"text": "I mean the scrappy, weird, or creative moves that actually worked for you. Could be anything from random chance encounters to quirky marketing experiments that somehow brought in real business. Curious to hear the stories- whats the most outside-the-box way youve ever landed a customer?", "target": "negative"}
{"text": "Version 1 was built by me. Version 2 was built by employee #2. Version 3 was built by employees #2 and #3. We just went live yesterday, and any additonal hires will be \"core employees\". They were important to the build but not critical. Like I could get other people to build at this level too for the same market rates. Do emoployee #2 and #3 get co-founder title? I've already given them the max equity for such a situation at 2% each, even though they didnt request it, nor was it promised. I think we really trust each other at a very high level so I treat them like family. Also, do I give the current main engineer CTO title? I was hoping to poach someone with a lot of pedigree to match our vibe and get the max valuations every round. Afterall, I want their 2% to count. In the space, we won on branding, product features, team and solution. As opposed to typical LLM companies, we dont serve customers our solutions. We use APIs, prompt management, query orchestration etc to serve the best industry solutions. Kinda like if Kaggle, Hugging Face and Wolfram Alpha had a kid. We create pipelines to do everything from fraud detection to cancer research. Our TAM is massive with B2C, B2B, B2E, B2G implementations. I feel a CTO thats ex-faang or something close would bring a lot of \"brand\" value. We are already positioned to deliver the best product to the market. How do I make the optics match? P.s I'm hiring exceptional MLEs, Data Scientists, Developers. We are building a \"calculator on steroids\" in the Data + AI space. DM me for more details!", "target": "negative"}
{"text": "Hi everyone, I have recently launched my product and got a few users. Now, I want to inform them about new features, but I am new to marketing and have no Idea how this actually works. So, what tools do you use to send product update emails? How often do you send them? What do I need to keep in mind to get the best out of it?", "target": "positive"}
{"text": "Aven Technologies Inc. is a global technology company focused on building enterprise-grade solutions that enhance business communication, improve customer engagement, and support scalable growth. Our products range from CRM platforms to advanced communication tools, all developed to meet the evolving needs of modern businesses. We work with organizations to create solutions that deliver measurable impact. Connect with us to explore how Aven Technologies can support your business goals. AvenTechnologies #EnterpriseSolutions #BusinessTechnology #CRM #BusinessGrowth #DigitalTransformation", "target": "negative"}
{"text": "Hey there! - Pretty new to this SaaS space but have been fascinated with computer science and AI as a whole not to mention the potential for revenue. Just looking for some people to collab with! Hit me up if you're interested. Maybe we could start something awesome!", "target": "negative"}
{"text": "I feel like a pile of sh*t when I see someone elses habit tracking app makes some profit and my app just sits there like like a door stopper everyone walks past and doesnt even look at it. Here are some of my thought after building three product. ticketing app (1 year) (launched but removed) - failed becos I suck at marketing and no one needed my app but I kept building but it works and shows myself what I am really capable of doing. Started from frontend to writing backend to hosting to writing cron jobs and all from scratch - learned to not waste time - learned the hard way that people wont come if u just build it. session recording app (1 month+) (launched) - https://recordy.dev/ - recently completed it, but it seems big companies like posthog etc already solves the issue enough to kick micro saas like mine out of the niche. - people didnt actually need it. In my opinion - learned to validate my idea first before building - learned to utilise AI to build fast - learned new existing tools(nextjs, supabase) to build fast - launched on product hunt example api data app (1 week) (launched) https://apiexamples.com/ validated first in Reddit (few people actually said that they have these issue that I am trying to solve) maximising full potential of AI to generate and review code in short amount of time. learned different business model (Adsense) learned that having the knowledge to build doesnt equal to have customers. learned t do SEO optimizing with, google search console and keyword ranking and stuff. What do you guys think? I didnt make a single dollar here but still I am proud of what I have learnt along the way. What is the journey for you guys like? Tell me in the comments :).", "target": "negative"}
{"text": "Executive Summary The SaaS community is actively seeking solutions to critical challenges in market validation and customer acquisition, particularly in the rapidly evolving AI-driven landscape. A dominant theme is the frustration with ineffective cold outreach and the need for more targeted, personalized, and automated marketing strategies. Many founders also struggle to identify genuine market problems beyond their own developer-centric issues, leading to product saturation and a lack of clear differentiation. Furthermore, there's a recognized need for tools that streamline internal business operations, such as tracking software subscriptions and managing user feedback, to reduce costs and improve product-market fit. 1. Top 5 User-Stated Pain Points Ineffective & Time-Consuming Cold Outreach: Founders perceive cold emails and DMs as a \"huge time sink\" with low reply rates, and struggle with the effort required for genuine personalization at scale. Quote: \"cold outreach feels like a huge time sink. Some say writing the first message takes forever, others say getting replies is the real struggle.\" Lack of Market Insight & Product Validation: Many \"indie hackers\" build products based on their own problems or without deep industry experience, leading to generic \"dev tools\" and a struggle to find genuine, paying customers. Traditional validation methods like landing pages are seen as insufficient. Quote: \"a lot of indie hackers / build-in-public folk often haven't had actual deep industry experience in anything, they aren't exposed to any vertical-specific pain points.\" Difficulty Acquiring First Customers & Achieving Distribution: Technical founders often excel at building but significantly underestimate the \"grind\" of marketing and distribution, struggling to get their product in front of the right audience. Quote: \"It doesn't matter how good your code is if you can't distribute it or sell it.\" Information Overload and Disorganized Data: Users, especially solo founders and small businesses, are overwhelmed by the sheer volume of information (emails, social DMs, internal documents) and struggle to filter what's truly necessary. Quote: \"we are building LM-powered software that will help people with information overload and presents the necessary information only like in emails, social DMs.\" Inefficient Management of Software Subscriptions: Companies (from small teams to agencies) waste money on forgotten or unused software subscriptions and struggle with manual tracking methods like spreadsheets. Quote: \"Im thinking of building a lightweight app for teams/companies that subscribe to a lot of software and struggle to keep track of whats still in use.\" 2. Validated Product & Service Opportunities AI-Powered Outreach & Lead Generation Platform The Problem: Founders waste significant time and effort on cold outreach (emails, LinkedIn DMs) that often results in low reply rates and difficulty personalizing at scale. The Opportunity: A SaaS platform that automates the identification of high-intent leads from social media (e.g., Reddit, LinkedIn), crafts personalized messages, and facilitates multi-channel outreach campaigns. Key Features / Deliverables: Keyword-based social listening (Reddit, LinkedIn), AI-generated personalized message drafts, automated DM/email sequencing, lead scoring/prioritization, integration with CRM/outreach tools. Evidence from Data: Directly addresses \"frustrating part of sending cold emails or DMs,\" \"personalization at scale,\" and \"getting any reply at all.\" Mentions Reddit Notifier, F5Bot, and SourceGeek as existing/similar concepts. Market Problem Discovery & Validation Toolkit/Service The Problem: Technical founders often build solutions without deeply understanding specific market pain points beyond their own developer challenges, leading to products with low demand or high competition. The Opportunity: A service or tool that helps founders systematically identify underserved market niches, extract validated pain points from community discussions, and conduct effective demand validation before extensive development. Key Features / Deliverables: Reddit/community scraping for pain points, structured survey/interview templates for validation, \"fake checkout\" or commitment-based validation methods, market size estimations (TAM, SAM, SOM), ICP definition guidance. Evidence from Data: \"Im confused about what kind of startup to build  where do people actually find real problems to solve?\", \"Landing pages don't validate ideas. They validate your marketing copy,\" \"Reddit Idea Scraper\" (a user-built tool) and explicit requests for market research. Collaborative SaaS Subscription Optimization Platform The Problem: Companies, especially small to mid-sized teams, struggle to keep track of their numerous software subscriptions, leading to wasted expenditure on unused tools and inefficient budget management. The Opportunity: A lightweight, collaborative SaaS application that centralizes all company subscriptions, allows employees to mark active usage, provides renewal reminders, and suggests cost-saving opportunities. Key Features / Deliverables: Centralized dashboard for all subscriptions, employee-driven usage status updates, automated renewal alerts, spending analytics by category, AI-powered cancellation/optimization suggestions. Evidence from Data: \"Would your company use a simple app to track software subscriptions?\", \"spending over $200 a month on subscriptions I barely used,\" and a direct mention of \"SubBuddy\" as a solution built to address this. 3. Target Audience Profile The primary target audience consists of solo founders, indie hackers, and small to medium-sized business (SMB) owners and managers , particularly those with a technical background (developers, engineers) who are building or running SaaS products. Likely Job Roles: Software developers turned founders, startup CEOs, marketing leads in small teams, sales development representatives (SDRs), recruiters, and operational managers. Tools They Currently Use: Spreadsheets, Notion, Discord, LinkedIn, Product Hunt, GitHub, generic AI content tools (ChatGPT), Apollo, existing outreach tools (e.g., SourceGeek), and basic monitoring tools. Many are also familiar with modern tech stacks like Next.js, Supabase, Stripe. Primary Goals: Increase revenue, acquire first customers, validate product ideas quickly, reduce marketing costs, optimize operational efficiency, avoid \"building in a vacuum,\" and manage financial outflow effectively. 4. Potential Monetization Models AI-Powered Outreach & Lead Generation Platform: Subscription (tiered based on lead volume, features, or team size), Freemium (basic features free, advanced paid), Pay-per-lead, Enterprise licensing. Market Problem Discovery & Validation Toolkit/Service: Subscription (tiered for tool access), Fixed-Price Service (for custom research reports or validation sprints), One-time License (for template libraries or specific datasets), Consulting packages. Collaborative SaaS Subscription Optimization Platform: Subscription (tiered by number of users or tracked subscriptions), Freemium (limited tracking for free), Enterprise plans with advanced integrations. 5. Voice of the Customer & Market Signals Keywords & Jargon: indie hacker, build-in-public, dev tools, SaaS, MRR, MVP, Product Hunt, cold outreach, DMs, personalization at scale, churn, retention, product-market fit, bootstrapped, solo founder, AI, LLM, vibe coding, distribution, moat, GTM, TAM, SAM, SOM, ICP, ATS, freemium, LTDs, Appsumo, webhooks, analytics, database latency, UI/UX, conversion funnel, NPI/NDA, SDR, cross-promotion, lead generation, API, boilerplate, no-code, micro-SaaS. Existing Tools & Workarounds: Reddit Notifier, Apollo, SourceGeek, GoAgentic, Posthog, Hotjar, Appsumo, Saaszilla, Google search ads, Meta ads, LinkedIn, Twitter/X, Notion, spreadsheets, Discord, Gmail, Stripe, Paddle, Lemonsqueezy, Bubble, n8n, GitHub, Figma, Spotify, Netflix, Shopify, Magento, Canva, ChatGPT, Gemini, Claude, Perplexity, Deepseek, Grok, F5Bot, Zluri, Torii, SubBuddy, Snyk, Checkmarx, Mailchimp, SendGrid, Postmark, HubSpot, Vue, Pinia, Loom, Dadan, AppearOnAI, Perplexity Collections, SerpAPI, DitDo, AICarma, Syndr AI, PureVPN. Quantified Demand Signals: Numerous threads and comments on the frustration and low success rates of cold outreach, indicating a persistent, unsolved problem (\"Comments (28)\" on \"Most frustrating part...\"). High engagement on posts about achieving early MRR, even small amounts like $608, showing strong interest in growth strategies and validation (\"Comments (57)\" on \"$608 MRR\"). A post specifically offering to \"research leads and fine-tune your marketing\" received \"Comments (78),\" demonstrating a clear demand for lead generation and marketing support. Mentions of tools like \"Reddit Notifier\" and a \"Reddit Idea Scraper\" built by users underscore the perceived value in leveraging community data for market insights. The \"SubBuddy\" app, built to solve a personal pain of wasting \"$200/mo on forgotten subscriptions,\" highlights a relatable and quantifiable financial problem. The \"AI Sales Rep\" SaaS, Humen, achieving \"$900 revenue 30-day span\" and a \"waitlist of 150 users\" in a short time demonstrates demand for AI-driven sales automation. Discussion around \"distribution is the only moat left\" with \"Comments (49)\" reflects a widespread concern about competitive advantage in a crowded market. I just want to see if this is somewhat near accurate? are you really facing these problems? and if you like it, would you like it to see for other subs, as reddit posts, or a newsletter maybe?", "target": "negative"}
{"text": "Have you used explainer videos mid-funnel with your brand? Does it actually help with conversions?", "target": "negative"}
{"text": "I'm a solo founder who has invested over $1 million to build a fully-functional edtech platform serving Pre-K through 5th grade . The curriculum is meticulously aligned with Bloom's Taxonomy , a key selling point for a sophisticated educational audience. I've already successfully launched the curriculum for Pre-K through Grade 2, and the rest is on track to be completed by the end of September. We also have a free, live Spell Bee feature for the entire Pre-K-5 range that is already building a user base. As a product-focused founder, my expertise is in building, not scaling. The platform is now at a point where it needs a partner with the resources and experience in marketing and sales to unlock its full potential. I am not just looking for an investor, but a partner who sees the immense value in acquiring a launched and validated product and has the ability to take it to market. If you have a background in scaling SaaS or edtech products and are interested in learning more, please DM me. A confidential pitch deck with further details is available for serious inquiries.", "target": "negative"}
{"text": "There is one thing in automation that is rarely discussed, when AI can do everything quickly and efficiently, will we stop thinking? For example: the CV screening process in the Alurai l tool, there you can sort, m based on the CV, as HR will you lose the 'feel' or intuition in finding the diamond in the rough? The candidate may not fit the machine's criteria, but has great potential. Or in terms of market research, if AI analyzes raw data, will we lose the opportunity to understand the nuances of the story behind it? Is that true: - At what point does it automatically backfire and cause us to lose our human touch and creativity? - How to balance between AI speed and human institutions? - Have you ever had an experience where automation actually made you feel like you were being controlled by a machine?", "target": "negative"}
{"text": "I've been running FanCircles.com for the past eight years. It's a specialist SaaS product that costs around $60,000 per year. It's aimed at music artists and celebrities who have large audiences. For example, a music artist may use this if they're already playing 2,000 people per night. In those situations, we've consistently earned music artists $100,000 per 1,000 fans per year. The problem is the addressable market is much larger than this very difficult-to-reach niche. Don't get me wrong, we have over 100 creators already signed up. However, it's not been my most successful company. For example, my last company Awin.com was sold with a turnover of $150 million. In January this year, we began building what I thought was going to be a 2-3 month project. We call it FanCircles PushPass. Essentially, it's a way to push mobile notifications without the use or need of an app. It's priced at $24.99 a month, and I call it the \"MailChimp of notifications\" - it's a mass-market product. It took longer than 3 months. We're now 8 months later, and we're a week or so away from launch. It not only serves every size of music artist but also influences YouTubers and the whole creator economy, providing them with a way to reach their audience directly while collecting data (including email and location). Notifications can be pushed to their followers after a simple click or scan of a QR code. These notifications can either be simple messages or messages with links to anywhere. So for our YouTuber, it could be a message saying \"Hey, I've posted a new video\" or \"Hey, I have a 10% discount in my store right now. Click here\". For a music artist, it could be \"Listen to my new album on Spotify\" with a link to Spotify. With our 8-year history, I've got a massive database of artists and influences who didn't fit our $60,000 superfan app. And with my affiliate marketing history, the key behind this is a 30% ongoing lifetime commission for every new subscriber referred. I think for any SaaS model, affiliate marketing needs to be built into the P&L. And that's always been my aim from day one. The creator economy is huge, of course, and I want to take advantage of using YouTubers, TikTokkers, and Instagram influencers to promote the product, but it has to be worthwhile to them. And so the 30% lifetime commission is key to building lifetime partnerships. I'm very excited about getting this product launched - there's so much effort being put into it, and with a team of 12 people, we're ready to go. Wish me luck!", "target": "negative"}
{"text": "Building voice agents is easier than ever. There are plenty of no code tools that help you get something up in just a few minutes. The real challenge is making an agent that can survive all the edge cases that show up in real conversations. And thats before you even get into latency, model choice, and scaling to thousands of calls. When we first started building voice agents, this became painfully obvious - so much that we started building quite a lot of observability tooling around our own agents. It got to a point where we realized that making voice agents reliable might be a more interesting problem then building the voice agents themselves. My cofounder and I set on this journey last year - since then weve been through the YC winter batch, had countless sleepless nights building product, handled over 10M+ minutes in audio, and helped several voice AI teams fix the weak spots in their agents. We've built three core features that cover the development cycle of a voice agent - we let voice builders monitor live calls through integrations with all the popular voice agent platforms, catch failures as they happen through custom and pre-built evaluations, and then turn those failures into repeatable tests by simulating real phone calls with customers. That loop helps teams spot issues early, fix them fast, and keep agents from breaking in production. The lesson for us has been that sometimes the side problem - the tooling you build just to survive - turns out to be the bigger opportunity. We're live on Product Hunt today ( https://www.producthunt.com/products/roark ) - would love to get any feedback on our launch page or here in the comments. Have you built voice agents before? How did it go? Did your agent ever make it to production?", "target": "negative"}
{"text": "Ive always wanted to start a business or build an app for 15+ years. Now Im almost 40 and still without success. Fear, laziness, overthinking & worrying what others think always held me back. But today that changes. This is Day 1. Ill prove to myself that I can do it. As for now; i will be starting on 2 projects and working on ideas to: 1. Build an app/ SAAS using No code tools 2. Build a 1 product webpage First step is to learn and improve as i go and not about making money right now. Its about overcoming my fear of failure, overthinking and getting things to work. That will my first success. Ill share it all here and on X  the struggles, the small wins, the lessons. If youre reading this, join me. Reply, engage, give feedback & encouragement. Anyone else struggling like me can also share with me their journey and lessons. I really want to get this done for myself and my lovely family. Please also follow me on X: https://x.com/Startingat_40", "target": "negative"}
{"text": "I need a portfolio site fast for freelancing but dont want to hire anyone or wrestle with WordPress. Are there any quick solutions for non-technical people?", "target": "positive"}
{"text": "I dont need anything fancy, just a proper business email and a one-page website for my handyman services. Feels like every platform wants me to juggle 34 different tools. Is there an option that is easy to set up?", "target": "positive"}
{"text": "I recently realized my mission. I figured out what I love most. It was when I was watching a video about time of negative. I was more excited than hearing about someone's exit, and the thrill might have been even more intense than when I have my own exit. I realized it along with another video I experienced at that time - a video about how the unified field theory of gravity might be completed. At that moment, I realized what I want is to see \"the edge of the universe.\" Gravity distorts space, and observing time might finally bring it into a realm we can control. Then, maybe, just maybe, we could experience leaving our galaxy and traveling to another universe within our generation? You might know this, but the Earth-made object farthest from Earth is Voyager 1. But it hasn't even left the solar system yet. The thought of surpassing that - my heart races just writing this. Of course, when I told my girlfriend about this, she thought I was absolutely crazy lol. Some of you here probably think the same. But I'm convinced this future will come someday, and I'll work to bring it within my generation. That's why I want to focus the ultimate goal of all my business capabilities on helping with that. After taking care of myself, I'll help maintain Earth as our cradle and then help those who can work on this. Sadly, I'm not that smart, but I can still help them. That's my story. Do you guys have a mission like this?", "target": "negative"}
{"text": "Hi mates, I am a 30~ish Male trying to go solo for the first time after being employed at big companies. I am currently working after daily work routine, on a couple of products, trying to resolve some problems I am aware of on the first one, and help a niche I love to expand their knowledge. 1st one is going fine, even if the product seems to be much difficult to develop than the idea I had of, so I am trying to cut features for future development, if ther product goes well, meanwhile the 2nd one is just a POC right now. My question is: how do I \"promote\" my first product? I mean I know the audience, it's a difficult one but still manageable since I may have contact to bypass some procedures, and I am sure my product will impact the life of lots of people, since it first solve a problem myself and my family do have most of the time. Other than this way? Which requires time and probably me leaving my current job, what can I do? Asking on reddit if it could work (for now it's a very country specific, because it should be a way to bypass our slow burocracy) Should I publish a landing page first? What can I do on the landing page or what can I explain without exploiting my idea to others, while receiving feedbacks? Is it useful to do a landing page first eventually before landing the MVP? I am genuinely asking to expand my knowledge. Thanks everyone and cheers.", "target": "negative"}
{"text": "Were handpicking a small circle of creators to represent OmniAi our AI recruiting software. If youve got a real audience and a reputation for being solid, this is your opportunity to work with us. Limited spots. No gimmicks. Youll get a personal code, rev share on every sale, early access, and a direct line to the team. If you believe like we do that AI is rewriting how sales gets done, feel free to apply as top affiliates will receive equity in our company when we go public. comment to apply and we will get on the phone and figure out details!", "target": "negative"}
{"text": "As small business owners, many of us know the feeling: you build a great business, but you feel completely invisible. Often, the first thought is paid ads, but that quickly turns into a costly price war with the giantsa dead end. The second path is SEO, with the hope of outranking the market leaders for broad keywords. Unfortunately, both of these paths are the wrong battle . Instead of fighting for expensive, broad traffic, the key is to target the customers who are already at the finish line, wallet in hand. Heres the playbook on how to 'steal' them from the competition. Here are 3 simple plays: 1. The \"Us vs. Them\" Page ([Your Brand/Product] vs [Competitor]) Customers searching for this are ready to buy. Create an honest comparison page with a feature or service table. Don't just trash your competitionsimply show where you are the better choice (price, quality, location, customer service). 2. The \"Alternative to...\" Page (alternative to [Competitor]) You're capturing people who are actively dissatisfied with the market leader. Create a page that focuses on their pain points and shows how your business solves them. 3. The \"Best for...\" Page (best [product/service] for [niche]) This is the key to success for SMEs. Instead of fighting for broad keywords, dominate your niche. For example: Local Services: Instead of fighting for \"cleaning company,\" dominate \"office cleaning company in Boston.\" E-commerce: Instead of \"running shoes,\" target \"lightweight running shoes for pavement.\" Professionals: Instead of \"lawyer,\" try \"estate planning lawyer in Chicago.\" Position yourself as a specialist for a specific group, and you'll win their trust. 4. So, what's next? (Seriously, do SEO ) In small teams, there's often no time for this, but warring over paid positions in Google Ads is probably an even worse tactic. Besides, there are no excuses these days. If you don't want to hire an agency and don't have much time, there are tons of tools that let you get really good results with a very low investment of time and money. You basically only need a three-app stack. For mapping out user questions, use AnswerThePublic . Next, for the actual content creation, use tools like Verbite to generate solid, ready-to-publish drafts from your keywords. Finally, to monitor your results and your site's technical health, hook up the free Ahrefs Webmaster Tools .This stack lets you cover the key bases by investing about 1.5 hours a week, and month over month, you'll build more authority and gain more organic traffic. TL;DR: Stop fighting giants for broad keywords. Instead, \"steal\" high-intent traffic by creating 3 types of pages: [You] vs [Competitor] , [Competitor] Alternative , and Best [Product/Service] for [Niche] . Once you have these pages, continue your SEO efforts. Don't have time? Use simple tools for research and quick content creation. Month after month, you'll gain more and more traffic. What's the most effective (and maybe underrated) growth tactic you've found for your business? Let's share some knowledge.", "target": "negative"}
{"text": "I work for myself and sometimes I let client emails sit for too long, which I know is a bad habit. I want to find a way to track my own average response time so I have a number to focus on improving. Is there a personal dashboard for this?", "target": "positive"}
{"text": "When I started building my travel-tech idea, I got pulled into startup paperwork mode:  Should we register as Pvt Ltd or LLP?  What about compliance costs?  Do we need a CA on day one? It felt like progress but really, I was just paying for a very expensive hobby. Thats when it hit me:  Validate your idea with cash, not compliments. Because: Compliments dont pay your server bills. Compliments dont prove demand. Compliments dont save you when things get hard. Cash does. Thats why I started thinking in terms of Funding-Market Fit :  Product-Market Fit gets you users. Funding-Market Fit gets you survival.  Its proof your product deserves capital  not just code.  Until you hit it, your company is just paperwork. Heres what it looks like in practice: 1 Build an MVP. 2 Market it before launch (Twitter, Reddit, LinkedIn are free). 3 Get paying users  even if its 100, even if its ugly. 4 Only then, register the company or think about raising. Because at the end of the day: Compliments are free. Cash isnt. Thats Funding-Market Fit.  So if youre building, dont just chase users. Validate your idea with cash, not claps. Because Product-Market Fit gets you traction. Funding-Market Fit gets you survival.  Now tell me  did you register your startup before your first rupee of revenue? Worth it, or just expensive paperwork flex? #StartupLife #EarlyStageStartup #FoundersJourney #BuildInPublic #StartupLessons #FundingMarketFit #ProductMarketFit #StartupFunding #VentureCapital #AngelInvestors #Entrepreneurship #BusinessGrowth #StartupCommunity #IndianStartups #TechStartups", "target": "negative"}
{"text": "been a fullstack dev most of my career, worked on a couple of startups, launched tens of products. but i was never the centre nor the main person responsible for the launch. Recently I have been focusing on building a tool that I genuinely thinks it would be useful, but i have been stuck at this 90% stage for a while. its not that I cant finish the job, its just this time I am the person solely responsible for it and i keep having this feeling of what if, what if people dont see the value in it, what if theres bug people find and it doesnt worketc so I have been dwelling on it, making so many changes that dont really matter, like change the color of this line of text, change that comma to fullstop, just keep pushing back the launch i know i should just do the launch anyway, whats the worst can happen, right? but just let me move that image 5px to the left and Ill do it", "target": "negative"}
{"text": "Hey! I built an app for solopreneurs to work \"together\" on their projects and launch them, it's completely free. Would be good to see as many of you on there as possible and work alongside you building your dreams :)", "target": "negative"}
{"text": "Not gonna lie, the usual suspects like ChatGPT and Claude get all the hype, but these ones dont get enough love. Sudowrite  If you ever hit a blank or want to improve your draft, this is great for brainstorming, rephrasing, and wild creative suggestions. Their Expand feature is super useful. Notion AI  It's really much more than just note-taking. I love that it turns messy thoughts into organized outlines and you can even use it to write first drafts for blog posts or newsletters. Grammarly  Old but gold. I really like the real-time feedback that prevents embarrassing mistakes from slipping through (especially on late-night edits) and their suggestions get specific about tone/clarity. Walter Writes  Still pretty under the radar, but its amazing for rewriting AI drafts so they read more naturally. I use it to humanize posts and avoid that generic robot feel (detect dot ai is a close second). ClosersCopy  Great for marketers who want extensive copywriting frameworks/templates tailored for ads, emails, blogs, and SEO. It's got over 700 frameworks made by pros and helps create highly targeted marketing copy with SEO built in. Which lesser-known AI writing tool do you keep coming back to? Drop suggestions. I love finding hidden gems and will try anything once.", "target": "negative"}
{"text": "Did anyone ever tell you hard work makes you rich? WRONG. Thats the biggest scam society has ever sold you. Look around: cleaners, labourers, waiters, delivery riders theyre hustling harder than CEOs. A construction worker probably works harder than all of us combined. Are they rich? No. Theyre broke, exhausted, and stuck in survival mode for their families. Working harder doesnt make you rich. Working smarter does. More smart work = more money. Build systems that make millions for you. Read the full blueprint that will make you discover the Lazy Millionaire hiding inside you.", "target": "negative"}
{"text": "Hey folks, Bogles passive investing (index funds, diversify, hold long-term) basically almost guarantees success in finance. Im a full-stack indie dev and Im wondering if a similar approach could work for SaaS: Multiple small products instead of one big project Keep things simple and reusable Play the long game Anyone tried something like this? Did it actually work? Any tips or gotchas?", "target": "negative"}
{"text": "Hi there, so I've been building SaaS MVPs for founders and solo entrepreneurs over the past 6 months. 3 of them are now making $500+ MRR. What I deliver:  Full-stack MVP in 2-3 weeks and maintenance after  AI tools, B2B dashboards, marketplaces, agentic workflows, automations and AI-first SaaS  Launch-ready with monetization features Recent win: a clients AI customer knowledge base tool went from idea to $1200 MRR in 90 days. Taking 3 new projects this month at a reduced rate. DM me for portfolio and details, we can book a call and discuss.", "target": "negative"}
{"text": "I spent 6 months surveying 500+ founders across startup communities (reddit, twitter, discord/slack communities, fb groups), and the results were brutal. Here's what I discovered: 87% admitted they built their product based on personal assumptions (what they thought was cool/useful), not actual market research. Even worse, 73% said they wished they had access to real user complaints to see what users would pay for before starting development. The problem isn't lack of ideas. The problem is founders are solving imaginary problems. Think about it lol. every successful SaaS solves a pain point people already experience. Slack didn't invent team communication problems. Notion didn't create the need for better documentation. They found existing frustrations and built solutions early on. There are 100s of competitors but they found out what users hate about existing solutions, and built on top of them to build a superior application. But here's where most founders mess up: they ask \"would you pay for this?\" instead of finding people who are already paying for broken alternatives. After talking to hundreds of entrepreneurs, I kept hearing the same story: \"I spent X number of months building something, launched it, and got 0 shits given. Turns out nobody actually had the problem I was trying to solve.\" This is why I started digging deeper into where real problems actually live. Not surveys or focus groups, but actual user complaints (negative reviews) on different platforms. I analyzed over 150k negative reviews from G2, scraped 50k frustrated App Store reviews, and crawled thousands of Reddit threads where people vent about broken tools. The patterns were eye-opening. People complain about the same software issues repeatedly across industries. They're actively discussing workarounds, paying for multiple tools to solve single problems, and begging for better alternatives in public forums. its actually nuts on how many ideas people miss. These aren't hypothetical problems, they're pretty much frustrations with clear market signals. People want these solutions and are WILLING to pay for it. The difference between successful and failed SaaS isn't the quality of execution. It's whether you're solving a problem that actually exists. if you want to check the data i've scraped and the analysis: Link . would love to hear your thoughts. Before you write your first line of code, ask yourself: are you building something people complain about not having, or something you think they should want? The answer determines everything.", "target": "negative"}
{"text": "As a solopreneur, every decision countsand guessing what users want is risky. The fastest way to build the right product is structured, actionable feedback . Thats why we built Refinely : Capture in-app feedback easily, without interrupting users AI organizes, filters, and prioritizes what actually matters Routes it to Jira, Slack, Discord, email and integrates with Claude Code, GitHub Copilot, or any coding agent so you can turn feedback into actionable work (or even code) quickly Instead of drowning in suggestions, you get the right insights to grow your product.  Try it here (limited free trial): link in comments  Product Hunt launch: https://www.producthunt.com/products/refinelyai?launch=refinelyai", "target": "negative"}
{"text": "I analyze pitches against patterns from millions of documented failures. Not generic advice - specific data on why your exact phrases kill deals. What you get: Death word analysis (phrases that predict rejection) Score across 5 dimensions (Clarity, Hook, Value, Believability, Memorability) Exactly what successful pitches in your space say instead No sugar coating - pure pattern matching How this works: Comment your pitch (2-3 sentences, what you tell potential clients/investors) I'll analyze it against failure patterns You get brutal truth in reply (publicly - keeping it transparent) Why I'm doing this: Beta testing PitchPyre before launch. System trained on 15+ years of pitch outcomes. Not AI hallucinations - actual correlation data. Recent example: Someone pitched \"revolutionary platform that transforms businesses\" - those three words appear in 73% of failed pitches but only 8% of successful ones. Replaced with \"I fix checkout abandonment in 48 hours\" - specific, measurable, valuable. First 10 real pitches get analyzed. No \"testing\" or \"just curious\" - post your actual pitch or move on. Your ego will hurt. Your conversion rate will improve. Drop your pitch below. Format: Who you help, what problem you solve, how you're different. Note: Analysis happens in comments for everyone to learn. No DMs. If you can't handle public feedback, don't post. (Mods if not allowed tell me but this will help the community, because I sucked at this and still do but I have improved) **edit** sorry guys I got blown up by DMs although I mentioned in here, you guys listen other subs don't aye! but IF I missed anyone please reply back to me. **Edit 2: Beta Link - https://forms.gle/US7xejMyart7R4zB9 Yeah its google... its just a form.. **Edit 3: This is not a unicorn or a golden egg, this is your business sparing partner its to train you. Defend your idea/mvp/moat or give up. Persist rise as a phoenix from the ashes. I am going to have a site up here soon, work in progress but the data is the same I am sharing manually. Cheers", "target": "negative"}
{"text": "Hi everyone! I'm a solo developer and I released this app called Lately for people who are always running late. I had some traction due to some articles a while back but now the numbers are dying off. The idea is simple: you tell it when (and if needed, where) you need to be, and it calculates travel time and helps you leave on time. The key features are: Progression bar countdown on the lock screen Live Location updates your travel time as you move Earn badges + points when you're on time Website: https://www.getlately.app/ AppStore: https://apps.apple.com/ca/app/adhd-planner-by-lately/id6740748815 I'd love to get your take on the app.", "target": "negative"}
{"text": "After 3-4 months I am done building my app (I only used Cursor to build it), and am ready to post it. It's an AI party game that lets people answer an absurd scenario with logical questions that an AI thinks of, and then the AI judges their logic and roasts them on it too. Given the vibes and the themes, how do you suggest I go about bringing users to the app? I don't think I should start with paid ads....", "target": "negative"}
{"text": "Are there any good solar system apps that show the planets and major anomalies like comets or asteroid debris clouds (such as the Perseids) in real time positions? Note, I do realize the actual scale of the solar system won't fit on a phone screen, the planets wouldn't even be a single pixel. Or on a flat screen.", "target": "positive"}
{"text": "I made an app like DoorDash but always cheaper! Only in Nashville rn trying to expand. Called Grabbl", "target": "negative"}
{"text": "basically this but customizable. the screenshot is from a random little app I found on the apple app store called challenge. its exactly what im looking for except the create challenge feature hasnt been added yet.", "target": "positive"}
{"text": "Hey everyone! Friends of mine made an iOS app called Suppi: Supplement Coach and thought it might be useful for anyone interested in health and supplements. Its an AI-powered tool that helps you figure out how to take supplements the right way, focusing on timing, absorption, and avoiding bad interactions. This is the app: https://apps.apple.com/app/id6745611073 What it does is:  Scan supplements by barcode to log them instantly  Track timing, dosage, and combinations for better absorption  Get AI-powered suggestions to avoid bad interactions  See trends in your supplement routine and consistency  Get smart reminders so you dont miss a dose I thought it was pretty cool, especially since most apps in this space are just simple trackers. Curious to hear if anyone else here tries it and what you think!", "target": "negative"}
{"text": "Hey everyone! I just launched CalmTrack , a cozy, modern habit tracker for iOS. I built it because most habit apps I tried felt either overwhelming or too clinical  I wanted something calm, minimalist, and stress-free that actually makes me look forward to tracking. With CalmTrack, you can:  Enjoy a clean, calming UI that makes daily tracking effortless  Switch between grid and calendar views to see your streaks at a glance  Personalize habits with unique icons and colors  Stay on track with smart reminders that gently nudge you  Archive past habits and stats to reflect on your journey  Edit habits anytime without losing progress What Im looking for: Feedback on usability, design, or anything that feels confusing Suggestions for features youd love to see next ( Already working on widgets and switching reminders timer from AM/PM to 24H system so soon that improvements will be available.) Any bugs or issues you run into while using it  Download on the App Store Regular price: FREE IAP - 4.99$ Pro version now its FREE for 2 DAYS Would love to hear how CalmTrack fits into your routine  Ill be checking every comment!", "target": "negative"}
{"text": "All I want right now is an app that plays audio files and will show time remainaing or elapsed in a widget. Because I will be using other widgets att the same time, such as a timer for the whole show etc. I have now installed and uninstalled huge number of iPad music player apps and I can't find a single one showing song duration or position in a widget. I suspect there is something convoluted about retrieving song position in the app building framework that makes every programmer avoid it, because this should be a fairly straight forward feature.", "target": "positive"}
{"text": "Hey everyone, Ive been working on an idea and would love to hear what you think. Imagine youre traveling  say from New Delhi to New York  and you want to know something specific, like Whats the best dessert in NYC right now? Instead of scrolling through outdated blogs or generic search results, you just open an app, type your query, and instantly get suggestions/replies from nearby people and fellow travelers in real-time. Kind of like a location-based community Q&A app where travelers can ask and locals (or other travelers) can answer on the spot. Think of it as Reddit meets TripAdvisor meets local chat. Im tentatively calling it Travelgo. My questions to you all:  Do you think this kind of app would actually be useful for travelers?  Would you personally use it when visiting a new city?  What features would make it stand out from existing apps like Google Maps, TripAdvisor, or Reddit itself? Any feedback or suggestions would mean a lot  Thanks in advance!", "target": "negative"}
{"text": "Hey everyone, I built a personal inventory app to catalog everything I own with usefulness ratings and travel flags and Im sharing it with you guys. You can check it out here . Here's what it tracks: Item details - name, category, location, value, and personal usefulness rating (1-10) Travel optimization - flag items as travel-worthy and see your travel vs regular item ratio Usage tracking - mark items as used and track frequency to identify what you actually use Visual analytics - charts showing category distribution, usefulness ratings, and usage patterns Value tracking - see total inventory value and identify your most/least valuable items I'm sharing it for free - no signups or premium tiers. Just a practical tool for people who want to be more intentional about their possessions. PS: If you want to customize it or build similar tracking tools, check out r/davia_ai", "target": "negative"}
{"text": "Looking for an app for iPhone that is basically a shared brain dump. I think of a lot of random things throughout the day that I want to tell my significant other. They have a demanding job and cant answer everything I want to ask during working hours, understandable!! Im looking for something that I can basically write down random thoughts, questions, and fun things my kids do. Then at the end of the day, they can look and respond to all the things. Emphasis on all. Ive tried and did not like: Cozi, Todoist, native reminders app, scheduling messages for pm, writing an actual list, family wall,", "target": "positive"}
{"text": "The ability to say \"no, you don't want to watch that, you want to watch THIS\" is an amazing tool for focusing on goals. But I need to be the one who chooses what it's feeding me. Is there any way to do this?", "target": "positive"}
{"text": "Weve just rolled out some powerful updates to make your adventures even better:  Route history tracking  Road trips, hikes, or city exploring, every step is saved.  Photo tagging on maps  Capture memories and pin them to the exact spot.  Live location sharing  Stay connected with friends and family in real time.  Export your journey  Share as a GPX file or a simple map.  Trip Studio on the web  Sync between app and trackmyjourney.net to view and explore your trips in detail.  Were continuously improving based on your feedbackand the reviews speak for themselves!  Special Offer: Life-Time Premium Give away until August 28 . Download the app and log in. Open Settings  Contact Us and send us a message. Well grab your user ID and enable premium access for you. Start your journey today!   Download : Track My Journey on iOS", "target": "negative"}
{"text": "looking for collaborators to expand features Post Body: Developed by pharmacists in the UK to close the global medication safety gap Already being used by 1,300+ healthcare professionals. Covers AZ medicines with side effects, interactions, counselling, dose calcs, etc. Available on web , iOS , and Android . Were especially interested in connecting with AI experts and healthcare tech enthusiasts whod like to contribute to the next wave of features. Would love feedback from this community  what features would actually make this most useful in your practice or studies https://preview.redd.it/zkln3jljfjlf1.png?width=1080&format=png&auto=webp&s=622e85abf26ca1041a681c94aedddec09f6bacad", "target": "positive"}
{"text": "Hello everyone ! I am looking to automate a repetitive task. On Android, it's easy with an autoclicker, but on iOS it's complicated because apps cannot interact with each other. To get around this, I display my iPhone on my PC using mirroring software, then I want to use an autoclicker on the PC. Problem: ApowerMirror works well but is limited to 10 minutes (then you have to pay). GlideX is unlimited, but when remote control is enabled, the cursor becomes special and autoclickers (even AutoHotkey) no longer work. I'm looking for a free solution or a tip to: Control the iPhone from a PC without limits and have the autoclickers work If anyone has an idea or knows of an alternative, I'm all ears !", "target": "positive"}
{"text": "Hey all! Ive made an app special for pawrents. With this app you can track everything from your dog, like allergies, commands, habits, measurements, weight and more. Get notified for the next coat brushing, teeth brushing, ear cleaning, deworming, flea & tick treatments, potty and shower sessions. With the clicker and dog toys you can train your dog or grab their attention (also available on Apple Watch with the companion app). You have a map that marks nearby dog friendly daycares, groomers, vets, parks and restaurants. The app is free to use , where you can track one dog, and have access to one dog toy. There is also an optional premium subscription which give access to create unlimited dog profiles, 8 dog toys and create custom reminders. - Monthly subscription: 2.99$ (with 3 day trial) - Yearly subscription: 19.99$ - Lifetime (no subscription): currently on temporary sale for 4.99$ (regular price 34.99$) Download: App Store", "target": "positive"}
{"text": "Pixel 7.what are they both from? Apps?", "target": "negative"}
{"text": "Just found out about a new crypto casino called MineBit. It launched this June and already has 5,000+ games (slots, blackjack, roulette, crash, live tables). What caught my eye: Instant crypto payouts (BTC, ETH, USDT, etc.) $10 min deposit $20 min withdrawal Welcome bonus up to 680% + 400 free spins No app needed, works straight from browser Curious if anyone here has tried it yet? How fast are their withdrawals in practice?", "target": "negative"}
{"text": "My wife and I own a food manufacturing business, and although 99% of our business is distribution, we have a small retail shop in front of the production area to sell our products direct to consumer. Our plan was to scale back the distro and focus on retail, so we dumped a bunch of money into the shop, and then covid hit. So, our distro doubled during that time. It seems for the last few years more and more people have become the main character in their worlds, and it has become our duty to make every day a special occasion. The big problem we face is that no matter what we do, it doesnt live up to their expectations. Ill give an example. We have a regular customer who comes in and if were out of Product A., then she acts sad and says that was whole reason she came in. If were out of Product B.  same thing. It has gotten to the point where we tell her were out of something, so when she acts upset we say oh, actually! We DO have some!!. People come in, see our wall of products and ask what do you have special today?. Like, wtf do you mean? Youve never been here. We have 20 products out there. Our distro companies are the same. But thats a whole different story. It just seems like no matter what we do, no one is happy. We had a customer come in with his kid and ask us if we have chicken wings. Why would we sell chicken wings? Where would they have even gotten that idea? Then theyre mad we dont have chicken wings. Like, this really happened. Im so burnt out on people. Its starting to show. We debate just closing the doors to the public but we spent so much money building out the retail area. I dont know. Im mostly venting I guess. Im sure Ill get slaughtered in the comments, because its Reddit. But.had to vent. Im going to explode. EDIT wow. So much valuable info in all of these comments! Appreciate the insight and stories!!!", "target": "positive"}
{"text": "Created an account to ask this, as Im not sure how to proceed with the situation. We run a small seasonal business, and while Im not a fan of hiring friends, we hired a friend. He was a great fit for the job, seemingly had a great attitude and we made it clear that we prioritized the friendship, and if he ever wanted to step out because it was too much, just tell us and there would be no hard feelings. Lets call our friend James. He worked ran our kitchen. Hes in his 20s. James rarely showed up on time, maybe I can count on one hand him clocking in when his shift started. Typically 10 minutes late. I do all opening and closing duties for him, so all he has to do is show up to a fully stocked and ready to go kitchen, work his shift and go home. He gets an hour break daily, sometimes longer if its a hot day (2-3 hours). He works 5 days on 2 days off. When its busy I step in to help and only leave again when its slowed down and I confirm hes all good. The last few weeks James has been incredibly miserable. Constantly saying fuck this fuck me this is stupid in front of the other staff and in earshot of the customers. Other comments were made by him that I had to speak with him about last week, I tried to have a productive conversation about how these comments were rude and offensive and asked him if hed like to be done for the season, no hard feelings, if it was getting to be too much for him. I got a plethora of excuses for why he said what he said. And he didnt mean it. And that he will push through until the season is done (a couple more weeks) and he left. I didnt feel the conversation went poorly, but I also didnt feel it went well. I told him Im not a push through for work type of boss, if you need the time off you need the time off. But he said nothing. He came in for his next shift (late) and worked it until about 5 hours in, which is when he started making the comments above, to which I sent him home. I said okay I think you can go home for the day, you cant be speaking like that at work, we have talked about this He said okay and left. Came in the next day in a decent mood. All was fine. The day after is when shit hit the fan. Myself and the other owner had an engagement we had to be at, we would be gone for 3-4 hours at most, and I overstaffed with completely confident team members so there would be no reason to worry. He had fully trained help in the kitchen, as well as two other staff in the building. I let him know I just needed him until we got back, and then hed be free to have the rest of the day and he agreed that sounded good. When we came back to the premises, I was notified that he had walked out an hour previous, telling no one he was leaving. He just walked out. I messaged him and received no answer. My partner did the same, and didnt get an answer. I worked the remainder of the day. Next day he didnt show up for his shift, still no response when I inquired. He responded two hours later saying he was sore and wouldnt be coming in. I let him know I was disappointed he felt he couldnt communicate any of that with me and that I feel he showed how little respect he had for me and my partner. But to take care of himself and let me know how he gets on. He claims its not disrespectful to walk out and then not show up for a shift with zero communication. And that hes sorry he handled it the way he did, but he didnt disrespect us. Now Im feeling the friendship is strained, and quite honestly Im genuinely angry. Im not sure how to proceed. Is this him quitting? Does he expect to go on like nothing happened? He has yet to respond to any other messages from us. BUT I do know hes doing well because he has responded to mutual friends, as I was concerned about his mental health. Looking for any advice? Ive already taken responsibility for all of his upcoming shifts, because he hasnt responded to anything else. So technically Ive got it covered, even though its going to create 14-16 hour work days for me until end of season and put a strain on my other staff. Do we just pretend nothing happened and give him an ROE saying end of season? Or do I put down he quit and screw him out of any employment insurance opportunities. I dont feel right doing that, so I likely wont, but Im at a loss at what to do.", "target": "positive"}
{"text": "[Question] It's amazing how often businesses lose trust for the same exact reasons: over-promising, under-delivering, or just completely ignoring feedback. It makes you wonder if they're even paying attention. Whats the #1 thing a brand has done that made you instantly lose all trust in them?", "target": "negative"}
{"text": "Honestly once you start growing sourcing turns into a very different game like when i first started picking up a few laptops or trading cards here and there was doable but once you try to keep up with lots of products across categories it feels like you spend more time filtering than actually buying stuff. Margins get tricky too like the market changes and categories you used to make a killing at start filling up with competition quick. What works for 5 deals a week doesnt hold up when you suddenly got 50 of them. Like how are you keeping your sourcing efficient as you scale??", "target": "positive"}
{"text": "I feel like a lot of people get stuck either not having enough people coming in the door, or having leads sign up but never actually show up and turn into paying clients. Which ones tougher for you right now?", "target": "positive"}
{"text": "I'm a big believer in automation but, as many of us do, I kept trying to overengineer automations and would waste my time doing things that either weren't possible or weren't meaningful. I had a bit of an epiphany today that my favorite automation is probably my simplest one. Every time someone fills out my contact form, Zapier adds their info to a spreadsheet that I use as my to do list. That's it. My email inbox is a mess and before when I'd get an email from my contact form it would get lost in my inbox fairly often. I'd say a good 30% of the time I was forgetting to respond until I saw it like a week later and by then it was too late. Now part of my routine is going in the spreadsheet every morning and replying specifically to those inquiries. Anyone else have some stupidly simple automations that they love?", "target": "positive"}
{"text": "How do you handle Employee scheduling/work order scheduling. If we have our maintenance techs work from 8am-4pm, currently they get to the shop at 8am and then head to their first work orders from there. We service a 1 hour radius. How do you handle Employee Scheduling and Work Order Scheduling? Should they be at the shop at 8am or their first work order at 8am and when do they clock in?", "target": "positive"}
{"text": "started a medical clinic 4 years ago. We are currently making maybe 5k profit per month.operating revenue of about 40k a month but most of it goes toward survival. I'm so tired of not bringing home much money and constantly problem solving /putting out fires all day every day. Even after performing the job, we have to wrestle the money from insurance which makes this whole process soul churning. To give a deeper idea, we are seeing around 30 encounters a day and billing 1.5 mill yearly. National average collection is 30% of what is billed. Growing at about 6% monthly in number of patients but still I can't understand the math because if I did this for salary, I'd be taking home 400k $ at a minimum. We made 120k last year and I sank all of it for down-payment and financed the rest of a 1.2 million$ location at 5.75% before interest rates went up. I don't think we would've survived otherwise as rent for clinic space nowadays is like 12k$ /month. I dunno if the boost in motivation paying myself is worth the slowing of our growth but I can't shake the thought that something doesn't add up and I'm paddling the wrong direction while slowly running out of motivation. Anyone who pulled this off who remembers this stage-what would you do?", "target": "positive"}
{"text": "Ive been researching small businesses that dont need a big upfront investment, and digital products (like ebooks, printables, templates, etc.) keep coming up as an option. I get the part about creating them, but my biggest question is:  How do you actually get those first few customers when nobody knows who you are yet? If anyone here has experience, Id really appreciate hearing what worked for you.", "target": "positive"}
{"text": "Hello everyone, Im writing this post on behalf of my mom and wanted to thank you in advance for taking the time to read and share any advice. We truly appreciate it. My mom is a small business owner in California. She works 7 days a week, 1012 hours a day, and recently received notice of an ADA lawsuit. As far as we know, it hasnt been officially filed yet because she hasnt been served, but she did receive a letter/email from a law group stating that a lawsuit has been initiated. The claims in the letter include: Parking slopes being too steep Inadequately marked accessible parking spaces Lack of accessible dining surfaces Dining surfaces without required clear ground space Transaction counter too high Floor mat not secured properly The letter also stated that these issues violated ADA and UCRA, and that they denied the plaintiff equal access. Most of these are relatively simple fixes that my mom is willing to address, except for the parking lot slope, which is the landlords responsibility. From what I can tell, this letter serves as both a lawsuit complaint and a solicitation from a defense firm. When I looked up the plaintiffs name, I found multiple articles showing that this person has filed over 500 similar lawsuits. My questions are: If my mom corrects the issues, does that remove the risk of the lawsuit moving forward? Does she need to hire an attorney to fight this, or is there a simpler/less expensive way to resolve it? We called the law group that sent the letter, but they asked for a lot of money up front, which my mom cannot afford. What are the realistic next steps? Any advice or shared experiences would mean so much to us. My mom is doing her best to run her business, and were just trying to understand how to handle this situation without going into debt. Thank you again.", "target": "positive"}
{"text": "I bought a domain for my shop, and now Im stuck on the email part. Everyone on YouTube says I need to set up MX records and all these DNS settings way over my head. Is there a simpler way to just get a business email that I can just start using?", "target": "positive"}
{"text": "In light of all the gloomy posts over the last few month I wanted to see if we are somehow on an island. I'm in home services business and we have having the best year ever. Right now tracking about 15% ahead of last year. While residential customers are slightly up commercial have in on-fire. Also hiring has been a little easier (about 1/3rd of the applicants actually show up for an interview and on-time, compared to 1/5th last few years).", "target": "negative"}
{"text": "My father ran a refrigeration and hvac business, long story short now I do the same. I stayed to help my dad and ended up doing it for longer than I expected. You have your ups and downs with hvac. My dad was always stressed but loved what he did. I have gone through jobs that give me so much trouble and jobs that are great and profitable, but this one I currently have is beyond that. I am stressed out things are not going well. Its a long time coming for me, I have been wanting to just quit for a while but I haven't because I am the only one working. But last night I cried in my car, I prayed and I let it all out. The only thing that made me smile was imagining myself deleting my number and never looking back. I dont have a back up at all. I feel stuck with an immense amount of pressure. My heart aches and the bills are piling up, and a whole family to care for... in the meantime I am suffocating. Has anyone gone through something similar, if so, what did you do? I am truly gasping for air.", "target": "positive"}
{"text": "I would like to start a startup on SME consulting in the area of supply chain management. I will very much appreciate the help in getting the website created for free!", "target": "positive"}
{"text": "Hello everyone! I wanted opinions from people who have experience or know someone who has experience running a low-cost carrier store like Metro or Boost. I recently came upon an opportunity in the South to invest in some stores for Total Wireless. The master franchiser gave a really good sales pitch and I wanted to get other opinions on this. Thank you for your time!", "target": "negative"}
{"text": "I went to eat at this relatively new (2 years?) restaurant and started a discussion with the owner because I was curious about starting a business. Turns out the restaurant is a small franchise and the owner shared his struggles with opening a franchise. I gave him my contact information and he asked if I wanted to be an investor. I am considering but want to do more due diligence. What are important questions to ask him? What are important information to know about the franchise?", "target": "negative"}
{"text": "Is it a normal thing to be provided with a batch of sample inventory to test on the shelf? I ask because as a side project, were working on a non-perishable household food item and exploring initial distribution options on top of our own e-commerce. I would love to provide a batch to stores at no cost and work out an initial revenue split that makes it worthwhile. Is this a normal thing? Is there a specific way to get a conversation going when it comes to these things? I should mention, if youre based in the US and this is relevant, Id love to discuss if this something you may be open to!", "target": "positive"}
{"text": "What are some of the biggest issues you see in the sports networking and media industry. In my opinion it is the push of non sports stuff being on company's like ESPN try to push on there viewers. Does anyone feel the same? I am a entrepreneur looking into some possible solutions to this issue and just wanted to get some opinions on this or any ideas you have.", "target": "positive"}
{"text": "Say i have a coffee shop. I wanna make a deal to incentivize people to buy something else with the coffee cup, like a water bottle, and a donut! For example, each item costs 1 usd in this shop If a customer buys these today. They would pay 3 usd Now i want to make an attractive deal, reduce my profit per item while lifting up the number of sold water bottles and donuts. I have the basic thought. I am wondering how people executed this decently I must say im new to all of this", "target": "positive"}
{"text": "I heard a lot of professionals who have the option to relocate to major cities and get paid large salaries, but choose to stay or move back to their home town/country to stay close to family or just to live comfortably. Is this true? What do you guys think of hiring remotely for your small business? Does anyone have tips for this?", "target": "negative"}
{"text": "So this week I launched a digital product low ticket offer for a workbook I created for aspiring entrepreneurs & start ups who need clarity on their offer Im an occupational therapist turned online clarity coach and guide And yes I am a Solopreneur. I am in networking groups. Im active on social media. I just announced my product today among my various groups But feeling discouraged no bites, no comments, no likes And look, I know these things take time. But I guess Im wondering if there are other ways to get in front of buyers that I could try or any other tips for digital products and marketing that I may be missing. Would love to hear some feedback and recommendations.", "target": "positive"}
{"text": "Hi everyone! I was wondering if you had advice and tips of how to find manufacturers for creating custom items, currently I've been doing a bit of searching and haven't found anything that matches what I'm looking for, most of search results are just \"custom logo printing\" and that's not what I'm looking for, I want to make a new product from scratch.", "target": "positive"}
{"text": "Hey everyone, Im looking for the best-priced source to buy digital gift cards (Steam, PlayStation, Xbox, Google Play, etc.) for reselling individually in my online store. A few requirements:  I dont mind if the supplier charges a subscription or registration fee, as long as the final price makes sense.  I want to avoid situations where a $5 Steam card costs me $6 for example. (that kills the margin).  Payment methods like Visa/MasterCard.  Instant delivery is very important.  Ive already checked well-known sites like SEAGM, CoinGate, etc., but their prices arent competitive enough. If anyone knows legit distributors or marketplaces with better pricing for bulk or semi-wholesale (even for small quantities), Id really appreciate your suggestions. Thanks!", "target": "positive"}
{"text": "I run a small digital marketing business and specialize in search engine marketing. My background is in Google Ads, YouTube, and other paid media platforms where Ive helped brands scale with enterprise level strategies. The challenge Im running into is convincing small mom and pop shops that they can benefit from this level of SEM expertise at a rate they can actually afford. I price my services lower than most agencies because I want small businesses to have access to the same quality of advertising that bigger companies pay top dollar for. That said, even when I explain the value, many small business owners dont seem interested. Some feel digital ads are out of reach, others think word of mouth is enough, and some just dont want to spend money on something they cant fully see the return on immediately. For those of you who have successfully sold marketing or professional services to local small businesses: How do you make the value resonate? Are there specific angles or pain points I should be speaking to? What has worked for you when trying to turn skeptical business owners into paying clients? Any insights or experiences would be hugely appreciated", "target": "positive"}
{"text": "I've been in the web design/marketing industry for awhile now, but have only been freelancing/running my own business for the past 1.5 years. This week while generating a proposal for a client, I was struggling with whether or not I'm quoting the best way. My goal is to have a standard way of quoting that I can use/adapt for every project so I know I'm not underselling my services or underquoting a project. Currently, I'll look at a client's website and trying to calculate how many hours it'll take to do what they need me to do, multiply that by my hourly and there is the project cost. But what if it takes longer because of unforeseen circumstances? And estimating the exact hours of a task is always a crap shoot before really getting into the weeds of the site set up or marketing needs. How do others handle quoting their services like this? I've read a lot about value-based pricing rather than hourly. Where you take into account the monetary value you're providing the client. So if 40 hours of my time on a website improves your lead conversion, which equates to another $200k in revenue for that client that year, I should charge $50k for that because I'm generating substantially more value for them with my time than a hourly rate of $100/hour (that's just a random example so you get the idea). My recent thinking has been to offer clients four options: Offer to bill hourly. Get paid for exactly the time I work. This is variable and the client could end up paying more than they want. This also requires diligent time/task tracking so the client knows they aren't getting screwed over. Project-based cost. This is a set price ahead of time, but is inflated by some percent to account for unknowns, delays, extra meetings, etc. The idea is to add enough buffer to ensure I don't get underpaid and the client at least knows the total ahead of time. Some sort of value-based pricing like I mentioned above. But this requires truly understanding the financial picture of the business and what the services are going to do for their bottom line (which may not always be possible). Offer a more risky outcome-based pricing, such as getting 20% of all sales from the first year after a new ecommerce website launches. This is the most risky for me, which would mean it's going to cost the company the most. But it's a delayed cost and if it works out they should still make money on the deal. I would love to hear thoughts on these ideas or other ideas/strategies people have used that seem to work well.", "target": "positive"}
{"text": "Enough with all these $10k, $100k mrr posts. It is all getting very bland and pointless. Who has $0 mrr? :D I do.", "target": "negative"}
{"text": "What started as convenience has turned into a system that drains money from every side: Restaurants get extorted with 1530% commissions per order . This forces them to either raise prices or bleed out slowly. Drivers are paid scraps . $11.77/hour before gas on average . Its poverty wages, subsidizing billion-dollar corporations. Customers (thats us) get gouged with hidden fees, inflated menus, bogus service charges. sometimes paying 30%+ more than the food is actually worth . The apps dont create value. They leech it. They take money out of Toronto restaurants, out of workers pockets, and out of your wallet (and funnel it straight to Silicon Valley). So I built something simple: SkipFees . Its a completely free, community-driven directory of Toronto restaurants that deliver themselves . No parasites, no inflated prices, no middleman. I've added a few restaurants manually to get things rolling, but this is first and foremost a community project: Find restaurants near you that deliver directly. Dont see your favorite? Add it in seconds. Every listing is one less order encouraging the exploitation. P.S. Its very simple right now (and might be buggy!), but Im actively working on making it better. Im just a university student who got fed up watching local restaurants and customers get squeezed by billion-dollar bloodsuckers. SkipFees is free, and open to everyone. Check it out here: https://skipfees.com", "target": "positive"}
{"text": "What are you building today any personal projects share in comments with link if finished? I have been working on www.ReelStash.com a add free YouTube video library to watch your favorite YouTube videos.", "target": "positive"}
{"text": "Long story short, I launched my tool as a side project on May 22. It was what I needed back then, and still using it to schedule all my social media posts. Quit my 9-5 like a month ago and I made $932 so far. Mostly focusing on marketing & distribution lately to grow it even further. You can also check it out here if u want: postplanify.com", "target": "negative"}
